"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2024년 8월 13일, 약 10시간을 깨지 않고 잤다. 다행히도 아버지와 나의
      컨디션은 꽤 좋았다. 아버지께서 기침은 계속 하셨지만, 몸살 기운은
      없어보였다. 아침 8시, 일어나자마자 아버지와 숙소의 목욕탕을 사용했다.
      간단하게 씻고, 조식을 먹었다. 조식 기회가 두 번 있었지만, 전날 후지산 가는
      버스를 탑승해야 해서 조식 기회를 한번 날려먹었다. 10시 체크아웃 준비를
      위해 급하게 먹다보니, 사진도 못찍고 먹었다. 적지만 알찬 뷔페식이었다.
      기억나는 메뉴는, 계란말이, 고등어 찜, 소세지, 커피와 빵, 요거트
      푸딩이었다. 조촐해보이는 호텔 식당이었지만, 음식의 퀄리티는 꽤나
      만족스러웠다. 조식의 기운으로 빠르게 짐을 싸고 체크아웃을 했다.
    </p>
    <p>
      딱 10시에 맞춰 체크아웃을 마치고, 구글 지도를 통해 시간표를 보니 10시
      8분에 전철이 온단다. 그 다음 전철은 약 20분 뒤였다. 전철을 타기 위해
      뛰었다. 승강장에 도착하니, 10시 3분이었다. 엄청난 역세권 호텔이었다.
      뛰어간 덕분에 전철을 조금 기다렸다. 첫날 비행기 지연, 둘째날 컨디션 난조로
      인한 저녁 관광 실패에 대해 아버지와 대화했다. 숙소 앞에 있는 이온몰에 꽤나
      맛있는 빵집이 있다고하여 아버지께서 기대하고 계셨는데, 이온몰 근방에는
      가지도 못했다. 그렇게 후지노미야를 떠나 시즈오카 역으로 이동했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/V1Ll3ZS.jpeg",
        "https://i.imgur.com/xibR8uC.jpeg",
      ]}
      alt={["후지노미야 역 플랫폼에서 찍은 사진", "전철 티켓"]}
      caption="후지노미야 역의 낮을 이때 처음 경험했다."
    />
    <p>
      미노부 선을 타고 후지 역으로 이동, 도카이도 본선으로 환승하여 시즈오카
      역에 도착했다. 시즈오카 역에 붙어 있는 파르쉐에 유니클로가 있어서 아버지와
      이것저것 샀다. 나는 편하게 입을 수 있는 반바지와 운동할 때 입을 만한
      상의를 샀다. 아버지는 손등까지 덮는 팔토시를 사며, 미리 사지 못한 것을
      아쉬워하셨다. 후지산에서 사용한 팔토시는 손등을 덮어주지 못하여, 아버지와
      내 손등은, 등산한지 일주일이 지난 지금까지도 살갗이 벗겨지며 물집이 생기고
      있었기 때문이다. 그렇게 천천히 쇼핑하면서 신시즈오카 역으로 이동했다.
      신시즈오카 역의 코인락커에 600엔을 넣고 아버지와 내 캐리어를 넣었다.
      그리고 식사하러 역과 붙어있는 백화점의 제일 윗층으로 올라갔다.
    </p>
    <p>
      아버지는 소바를 좋아하셨다. 같이 먹어본 적은 없지만, 자주 말씀하셨다. 마침
      소바 전문점이 보였고, 약 15분 대기 후 들어갔다. 대기하면서 각자 메뉴를
      골랐다. 아버지는 소바와 참치덮밥, 나는 소바와 가츠동 세트였다. 아주 맛있게
      먹었지만, 아버지는 아쉬웠나보다. 일식에서 나는 간장 냄새를 별로 안
      좋아하셔서, 한국에서 파는 소바를 먹고싶다고 하셨다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/vRBMaeF.jpeg",
        "https://i.imgur.com/JTkIcKg.jpeg",
      ]}
      alt={["소바와 참치 덮밥", "소바와 가츠동"]}
      caption="소바와 참치 덮밥, 가츠동"
    />
    <p>
      식사를 마쳤으니, 공항 버스 시간까지 쇼핑해야 한다. 드럭 스토어와
      돈키호테를 들르는 것이 목표였다. 먼저, 신시즈오카 역 백화점 지하에 있는
      드럭스토어에 방문했다. 가격이 저렴한 편에 속하진 않았지만, 쾌적했기 때문에
      여기서 사기로 결정했다. 반창고, 벌레패치, 진통제 등을 사서 택스프리로
      결제했다. 3층에 있는 핸즈에서 어머니께 드릴 양산을 구매하고, 좀 멀리
      떨어져 있는 돈키호테에 다녀왔다. 주 목적은, 위스키, 말차 아몬드 초코렛,
      오리히로 곤약젤리였다. 아버지와 함께 총 네 병의 위스키를 구매할 수
      있었지만, 면세점에서 사케 (닷사이)를 구매하기로 해서, 두 병만 구입했다.
      다시 신시즈오카 역으로 돌아와, 버스 대기실에서 기다렸다. 체크아웃 이후부터
      버스에서 대기하는 동안, 비행기 지연 연락이 두 번 왔다. 17시 55분 이륙
      예정이었던 비행기가, 18시 20분으로, 그리고 18시 45분으로 두 번 지연되었다.
    </p>
    <p>
      처음 시즈오카 공항에 착륙했을 때, 탔던 버스를 타고 다시 공항으로 돌아갔다.
      낮에 보니 꽤나 이쁜 시골마을이었다. 제일 앞 자리에 앉아 큰 정면유리로
      시즈오카를 구경하며 공항으로 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/4UUumg3.jpeg"
      alt="시즈오카 공항으로 가는 버스에서 찍은 사진"
      caption="한적한 시골마을 시즈오카"
      height={500}
    />
    <p>
      홋카이도의 신치토세 공항에서 우리 가족은 불편한 경험을 했었다. 배가 많이
      고팠지만, 한 개 식당을 제외하고는 모두 영업을 하고 있지 않았다. 면세점의
      가격도 매우 비쌌다. 그 걱정을 하고 시즈오카 공항에 도착했다. 규모에 맞게
      적절한 정도의 매장과 식당이 있었다. 가격도 나쁘지 않았다. 이제 남은
      비행기는 내가 탈 인천행 비행기 밖에 없어보였다. 아주 쾌적하게 공항 시설을
      이용할 수 있었다. 출국장으로 나간 이후에는 작은 면세점과 편의점 밖에
      없으니, 식사와 굿즈는 출국장에 들어가기 전에 하는 것을 추천한다. 마그넷을
      몇개 구매한 후, 출국장으로 가기 전 3층 전망대에 올라갔다. 날씨가 좋으면
      후지산이 보인다길래 기대했지만, 구름에 가려져 있었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/6KyOj5w.jpeg"
      alt="시즈오카 공항 전망대에서 찍은 사진"
      caption="아마도 저 높은 버섯구름에 후지산이 숨어있는 듯 했다."
    />
    <p>
      그렇게, 비행기가 한 대 밖에 없는 낭만 있는 시즈오카 공항에서 떠나게
      되었다. 인천 공항에 도착하여, 아버지와 쇼핑한 품목을 정리하고 집으로
      돌아오게 되었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/ACIdhtt.jpeg"
      alt="시즈오카 공항에서 찍은 비행기"
      caption="이륙 예정인 비행기가 한 대 뿐인 시즈오카 공항"
    />
    <p>
      쉽게 해볼 수 없는 여행을 마무리하고 벌써 일주일이 지나간다. 후지산에
      올라간 경험보다, 아버지와의 추억이 더 오래 남을 것 같은 생각이 든다. 항상
      여행을 다녀오면 드는 생각은, 돈이다. 돈을 많이 벌어야, 아버지 뿐 아니라
      가족들한테 좋은 여행 경험을 쌓게 해줄 수 있다. 더 열심히 일해서 벌자.
    </p>
    <OgLink
      href="https://maps.app.goo.gl/1jCTZKhzuAdJQ7UTA"
      title="점심 식사 / 소바 전문점"
      description="蕎麦 鷹乃"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
