"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      2022년 9월 11일, 아버지가 가고싶어 하셨던 돌로미티를 느끼게 되는 날이었다.
      돌로미티 내의 첫 방문지는 트레치메였다. "트레"는 3, "치메"는 봉우리를
      의미한다. 세 개의 봉우리라는 뜻을 가진 곳이었다. 숙소에서 30분정도 차로
      이동하였다. 차로 이동하는 내내 눈에 들어온 광경에 감탄사를 외쳤다.
      감탄하느라 사진 찍을 생각도 못했다. 트레치메 주차장에 도착한 후, 산장에
      들어가서야 사진을 찍었다. 트레치메에 가기 전에 나는 아버지께, 트레킹은
      하지 않겠다고 말씀드렸었다. 이탈리아에서의 이틀은 육체적으로 많이 힘들었기
      때문이다. 하지만 이걸 본 이상 가야만했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/vNGuWOI.jpeg"
      alt="트레치메 산장에서 바라본 뷰"
      caption="산장에서 커피한잔 마시고 나와서 밖을 보면 이런 뷰가 펼쳐진다. 참고로 트레치메의 반대 방향을 본 것이다."
    />
    <p>
      아버지와 나는 길이 없어도, 그냥 움직였다. 왠지 그쪽으로 가면 좋겠다 싶어서
      걸어갔다. 더 높은 곳으로 가고 있었다. 등산이라 느껴지진 않았고, 약간의
      오르막길을 걷는 느낌이 들었다. 이상하게 움직여서 피곤하다는 느낌은
      안들었고, 상당히 시원했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/HmmONsB.jpeg"
      alt="트레치메 산 주변의 돌탑"
      caption="어느 나라에 가도, 산에는 돌탑이 있다."
    />
    <p>
      그 날의 셀카를 보니, 춥지 않은 겨울 날에 입는 외투를 입고 있더라. 기록을
      보니, 아버지와 80분 정도를 걷다가 가족들이 기다리는 산장으로 돌아갔다.
      그때부터 돌로미티에서의 남은 기간에 대해 더 설레기 시작했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/HJkRqKu.jpeg"
      alt="트레치메"
      caption="트레치메 삼봉우리. 자세히 보면 산장도 보인다. 산장에서 꽤나 멀리 걸어왔나보다."
    />
    <p>
      숙소로 돌아와 점심 식사를 하고 휴식을 취했다. 쉬면서 반신욕을 하는 동안
      아버지는 케이블카 티켓을 구입하러 가셨다. 5일간 돌로미티의 케이블카를
      이용할 수 있는 자유이용권이었고, 내 기억에 75유로정도 했던 것으로
      기억한다. 그리고 첫번째 케이블 카를 타러 갔다. 첫번째는 토파나
      (Tofana)였다. 큰 케이블 카였다. 매우 컸지만 사람이 별로 없는 시간대였는지,
      움직일 수 있을 정도였다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/KIcboIn.jpeg"
      alt="케이블카의 조카"
      caption="케이블카에서 신난 조카"
      height={600}
    />
    <p>
      케이블 카를 타고 올라가는 동안에도 계속 감탄만 했다. 여기가 알프스구나.
      빙하가 녹아서 흐르는 투명한 하천이 흘렀다. 시야도 너무 깨끗했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/dXsAu0B.jpeg",
        "https://i.imgur.com/yMoGTwB.jpeg",
        "https://i.imgur.com/WXHU7GR.jpeg",
      ]}
      alt={["케이블카 바깥 장관", "케이블카 바깥 장관", "케이블카 바깥 장관"]}
      caption="케이블카 바깥으로 장관이 계속 펼쳐진다."
    />
    <p>해발 3,200m인 곳에서 구름이 가까웠고, 식물은 없었다.</p>
    <ImageInEntry
      src="https://i.imgur.com/7kAcD0q.jpeg"
      alt="토파나에서 내려다 본 건물들"
      caption="토파나에서 바라보니 건물이 작게 보였다."
    />
    <p>
      구름이 많고 바람이 불어 구름이 움직이는게 눈으로 느껴졌다. 타입랩스 영상을
      찍고 싶어졌고, 이때부터 대부분의 산에 갈때마다 하나씩은 찍었던거 같다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/uvlFV1N.gif"
      alt="돌로미티에서 구름이 움직이는 타입랩스"
      caption="짧은 영상이지만, 1분 이상 찍었다."
    />
    <p>
      케이블 카로 하산할 때의 뷰는 달랐지만 또다른 멋이 있었다. 같은 길이지만
      어딜 보느냐에 따라 달랐다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/kYWaqH9.jpeg",
        "https://i.imgur.com/UoC7rjH.jpeg",
      ]}
      alt={["케이블카 바깥 장관", "케이블카 바깥 장관"]}
      caption="올라갈 때는 보지 못했던 작은 하트 호수가 있었다."
    />
    <p>
      하루에 두 장소를 방문했지만, 여행 시간은 정해져 있고 케이블카 자유이용권의
      뽕을 뽑아야했기에, 또 이동했다. 이번에는 숙소 바로 옆에 있는 산이었다.
      팔로리아 (Faloria)라는 곳이었다. 뒤에 뭐라고 붙여야할지는 잘 모르겠다.
      팔로리아 산? 팔로리아 봉우리? 무튼. 이번에도 케이블카를 타고 올라갔다.
      내리자마자 숙소가 있는 코르티나 담페초가 전부 다 보였다. 숙소 건물이 꽤나
      컸는데, 역시나 높은 곳에서 보니 다 작게 보인다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/NndeYhH.jpeg"
      alt="팔로리아에서 본 숙소 위치"
      caption="숙소가 어딘지 아버지와 대화하면서 봤다."
    />
    <ImageInEntry
      src="https://i.imgur.com/LhoBmNY.jpeg"
      alt="돌로미티 풍경"
      caption="돌리미티에서는 카메라를 놓을 수가 없다. 눈에만 담기에 아쉽고, 언젠가 다시 보고 싶기 때문에 계속 촬영하게 된다."
    />
    <ImageInEntry
      src="https://i.imgur.com/GakQaBF.gif"
      alt="팔로리아에서 본 구름 타입랩스"
      caption="이번에는 바람이 많이 불지 않아, 구름이 천천히 움직였다."
    />
    <p>
      팔로리아는 사실, 올라갔을 때도 좋았지만 그보다 아래서 기다릴 때 기분이
      너무 좋았다. 여러 군데를 오전/오후 돌아다녔음에도 피곤함보다 설레는 기분이
      더 컸고, 기다리는 곳조차도 낭만있게 느껴졌다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/XnLP4k6.jpeg"
      alt="케이블 카 대합실"
      caption="이탈리아 여행 중 내가 손에 꼽는 사진이다. 그림같은 돌로미티와, 낭만있는 실내, 그리고 아버지, 나, 조카가 편하게 앉아있는게 뭔가 많이 편안하다."
      height={600}
    />
    <p>
      팔로리아에서 내려온 후에 숙소에서 쉴 수 있었지만, 이탈리아 마을의 분위기도
      느껴볼 겸 산책을 나갔다. 있을거 다 있지만 여유로워보이는 그 뷰와 분위기를
      공유하고 싶지만, 아쉽게도 찍어둔 사진이 없다. 패션 매장도 많았는데, 눈에
      몽클레어가 들어왔다. 들어가서 구경해보니 너무 화려하기만 하고 무채색만
      입는 나에게 어울리지 않아보였다. 같이 쇼핑하던 누나가 직원에게 블랙 계열을
      요청했고, 창고에서 검은색 외투를 다섯 벌 정도 갖고와서 보여주었다. 이걸 왜
      디스플레이 안하고 창고에 숨겨놨는지. 사기로 결심하고, FTA와 면세 등 혜택을
      통해 정가보다는 저렴하게 구입했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/gwpYUqn.jpeg"
      alt="몽클레어 쇼핑백"
      caption="역시 여행은 쇼핑이다."
      height={600}
    />
    <p>
      언젠가 돌로미티를 다시 와야겠다는 생각이 첫날부터 들었다. 어머니께서는
      요즘도 TV에 돌로미티가 나오면 반가워하시며 다시 가고 싶다는 이야기를
      하신다. 다시 가고 싶다.
    </p>
  </>
);
