"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      타일 시공을 마친 다음날은 필름 시공 날이었다. 필름은 오래된 것들을
      새것처럼 보이게 하는 마법과 같다. 집의 대부분을 필름 시공한다면 새 집 같은
      느낌이 훨씬 나겠지만, 시간과 금액의 제한이 있기 때문에 필요해보이는 것들만
      최소한으로 작업했다. 문선, 창틀 등 새로 설치한 것들과 오래되어 필름이
      뜯어져버린 문, 샷시, 붙박이 화장대에 작업을 했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/V3I0hj7.jpeg",
        "https://i.imgur.com/BEvuMm5.jpeg",
        "https://i.imgur.com/13FoOv7.jpeg",
      ]}
      alt={[
        "필름 작업 전 오래된 화장대",
        "필름 작업 전 문선",
        "필름 작업 전 창틀",
      ]}
      caption="필름 작업이 필요한 곳들. 오래된 화장대와 새로 만든 것들."
    />
    <p>
      필름 업체는 직장 동료와 코알라타일 사장님이 추천해주셨는데, 사전방문하여
      필름이 필요한 부분을 파악하고 대략적인 견적을 내주셨다. 필름이
      필요해보이는 부분들을 더 발견해달라고 요청을 드렸는데, 정말 최소한으로
      봐주셔서 더욱 더 믿음이 갔다. 조그만 흠이 보인다고 바꾸는 것이 아니라,
      눈에 잘 뜨일지를 같이 확인해주셨다. 나무색으로 문선에 엣지를 줄지,
      흰색으로 일관성을 줄지 또한 함께 꽤 오래 고민해주셨다.
    </p>
    <p>
      필름 시공은 하루로 계획했고, 작업자 네 분 정도가 오셨다. 작업하는 내용을
      살펴보니, 단순히 오래된 필름지를 떼어내고 새 필름지를 붙이는 것이
      아니었다. 시간이 오래 지나 필름지가 접착될 면이 평평하지 않을 수 있기
      때문에 그 면을 갈기도 하고, 새로 설치한 것이어도 목자재가 까끌거릴 수 있기
      때문에 사포질을 하는 듯 했다. 직접 물어본 것이 아니고 추측한 것이라 틀린
      정보일 수 있다.
    </p>
    <p>
      특별한 이슈 없이 오후 네시쯤 작업이 완료되었다고 사진과 함께 카톡이 왔다.
      사실 사진으로 보았을 때는 새것처럼 보이지 않기 때문에 평범하다고 생각했다.
      근데 그날 저녁에 퇴근 후 직접 눈으로 확인해보니, 엄청 이뻤다. 도배가
      되어있지 않았기 때문에 더욱 더 새하얀 것이 느껴졌다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/MkbZxeR.jpeg",
        "https://i.imgur.com/h5L55Kf.jpeg",
        "https://i.imgur.com/PFnBqSZ.jpeg",
      ]}
      alt={["새하얘진 화장대", "새하얘진 문선", "새하얘진 창틀"]}
      caption="새하얘진 집"
    />
    <p>샷시와 주방 쪽 문도 이쁘게 작업해주셨다.</p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/UgS9Uc8.jpeg",
        "https://i.imgur.com/tpH4QxE.jpeg",
      ]}
      alt={["필름 시공된 샷시", "주방 쪽 문과 창틀의 필름 작업"]}
      caption="최고의 날씨에 최고의 필름"
    />
    <p>
      기분 좋게 금액을 이체하고 필름 시공을 마쳤다. 당연히 실력은 말할 것도
      없고, 요청한 것들에 대해서 함께 고민해준 필름 사장님께 감사드린다. 업체를
      공유하고 싶지만, 검색이 잘 되지 않는다. &quot;지블&quot; 필름 업체였던거
      같은데, 인테리어 업체밖에 나오지 않아 따로 첨부하진 않는다. 그리고 필름
      사장님과의 인연은 의도치 않게 다음 날에도 계속 되는데...
    </p>
  </>
);
