"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";
import { YoutubeVideo } from "@/components/entry-detail/youtube-video";

export const content = (
  <>
    <p>
      2024년 8월 12일 오전 5시 일어나서 전날 사둔 시리얼과 요거트를 먹었다.
      간단한 샤워 후 시계를 보니 6시였다. 6시 35분 버스를 타야하니 여유 있게
      편의점에서 커피 한캔 사오려 했다. 창문을 통해 정류장을 보니, 이미 줄이
      길었다. 티켓을 구매하는 줄과 버스에 탑승하려는 줄 총 두 줄이 있었다. 바로
      나가서 나는 버스 탑승 줄, 아버지는 티켓을 구매하는 줄에 섰다. 버스 티켓은
      왕복 3,700엔이다. 만약 편도를 구매한다면, 2,330엔이므로 참고하길 바란다.
      내 앞에 30명 정도 있길래, 45인승 버스에 안전하게 탈 수 있으리라 생각했다.
      버스가 도착했는데, 서울에 다니는 파란 버스와 비슷한 사이즈였다. 좌석도
      많지 않고, 서있는 자리가 많아보였다. 버스에 탑승하니 앉을 자리가 없었다.
      아버지의 몸상태가 좋지 않아 걱정이었는데, 70분 정도 이동하는 버스에 서서
      가야하다니 마음이 불편했다. 그나마 다행히 하차하는 문 앞의 계단에 앉을 수
      있어, 간이 방석을 깔고 아버지와 나란히 앉아서 갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/sfaKLWx.jpeg",
        "https://i.imgur.com/RqEPSrg.jpeg",
      ]}
      alt={["버스 티켓", "버스 정류장에서 대기 중인 사람들"]}
      caption="후지노미야5합목까지 가는 왕복 버스 티켓과 버스"
    />
    <p>
      가는 길은 평온했다. 중간 중간 스마트 와치를 보면, 고도가 높아지는 것이
      보였다. 바깥에는 나무가 많이 보였다. 빽빽하고 길쭉한 나무들이 끊임 없이
      이어졌다. 그렇게 길을 가다보니 어느덧 5합목 정거장에 도착했다.
    </p>
    <YoutubeVideo
      videoId="CGOj7q8JVlw"
      caption="버스 창밖을 통해 보이던 빽빽한 나무"
      height={400}
    />
    <p>
      버스에서 내려 등산화를 꽉 조여매고 날씨를 느낀 후 가벼운 플리스를 입었다.
      태양으로 인해 지열이 느껴지지만, 바람은 차가웠다. 반팔 상태로 등산하려
      했지만, 혹시나 바람으로 인해 감기에 걸릴 수 있어 안전하게 한 겹 입었다.
      정거장에서 걷기 시작했다. 해발 2,300m 정도라, 벌써 뷰가 환상적이었다.
      구름은 내 시야의 아랫부분에 있었다. 그렇게 등산로의 초반부에 도착했고,
      후지산 등산을 예약했던 QR코드를 보여주어 입장 팔찌를 받았다. 그리고 후지산
      보전 협력금 1,000엔을 내고, 증표인 나무패를 받아서 가방에 넣어두었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/nwOnCDZ.jpeg"
      alt="구름 위의 풍경"
      caption="버스 정류장에서 등산로까지 걸어가는 길"
    />
    <p>
      걸어가다보니 2,400m를 알리는 표지판이 있었다. 바닥엔 자갈이 많았고, 자갈의
      두께가 다양했다. 자갈이 맞나? 돌멩이라고 해야하나. 무튼 쉽지 않은
      길이었다. 바닥이 건조하기 때문에, 미끄러지기 쉬운 길이었다. 미래를 대비해,
      천천히 느긋하게 이동했다. 얼마 안 가 6합목에 도착했다. 20~30분 정도
      걸렸다. 5에서 6까지 이 정도면, 후지산 정상까지 어렵지 않겠다는 생각이
      들었다. 이때까지만 해도 상쾌했다. 6합목에서 판매하는 것들을 찍을 정도로
      에너지가 넘쳤다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/qdBAaI6.jpeg"
      alt="해발 2,400m임을 알리는 표지판"
      caption="해발 2,400m임을 알리는 표지판"
      height={400}
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/Pxekl6N.jpeg",
        "https://i.imgur.com/Ipz4OQY.jpeg",
      ]}
      alt={["등산로에 있는 자판기", "등산로에 있는 상점"]}
      caption="6합목에서 파는 음료수는 300엔, 아직 싼 편이다."
    />
    <p>
      아주 잠시 휴식을 취하고, 7합목까지 오르기 시작했다. 엄밀히 말하면,
      신7합목이다. 신7합목에서 더 올라가면 원조7합목이 있다. 아마도 7합목까지의
      거리가 너무 길다보니, 중간에 신7합목을 만든 것으로 파악했다. 나와 아버지는
      천천히 계속 올라갔다. 중간 중간 보이는 후지산 정상 방향을 알려주는
      표지판은 나에게 희망을 주었다. 얼마 안 남았다는 것을 보여주는 기분이었다.
      아무 생각 없이 계속 올라간다. 신7합목에 도착하여 휴식을 취했다. 많은
      이들이 콜라를 마시며 휴식을 취하고 있었기에, 코카콜라 500ml 한 페트 샀다.
      500엔이었다. 평소에는 제로 음료만 마시기 때문에 오리지날 콜라를 줘도
      안먹었는데, 한국 돈 약 5,000원을 주고 먹었다. 많이 시원하진 않았지만, 맛은
      좋았다. 많이 지쳐있었기에 그 정도면 충분했다. 그리고 화장실에 다녀왔다.
      꽤나 깨끗해서 편하게 볼일 봤다. 참고로 화장실 사용료는 300엔이다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/egbDFbH.jpeg",
        "https://i.imgur.com/Kcv1hLt.jpeg",
      ]}
      alt={["후지산 정상 방향을 가리키는 표지판", "구름 위의 풍경"]}
      caption="후지산 정상을 가리키는 표지판 / 6합목을 바라보고 찍은 사진"
    />
    <p>
      원조7합목을 향해 올라갔다. 주변을 바라보니, 이제는 정말 높아진 기분이
      들었다. 식물로 가득해서 녹색이었던 땅이, 이제는 흙과 모래로 가득한 갈색
      땅이 되어있었다. 풀이 있어도, 듬성듬성 존재했다. 아마도 고지대에서만
      자라는 종인 것 같다. 뷰를 보면, 더 높아지는 것은 못느낀다. 5합목부터 이미
      구름 위에 있었기 때문이다. 땅이 변하는 것만 느껴졌다. 아무 생각 없이,
      정상에 도착했을 때의 감정만을 기대하며 계속 올라갔다. 어찌저찌
      원조7합목까지 올라갔다. 무진장 오래 걸렸다. 휴식 간 텀도 짧아졌고, 호흡은
      거칠어졌다. 최대한 호흡을 뱉으라는 아버지의 조언을 듣고 그나마 나아졌다.
      기억이 잘 안 나지만, 원조7합목에서 휴식을 취한 뒤, 8합목을 향해 올라갔다.
      올라가는 길에 발견한 3,000m 표지판은 반가웠지만 실망스럽기도 했다. 이제껏
      올라온게 700m밖에 안되다니. 그렇게 기억도 잘 안 나고 8합목까지 올라갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/fIOoiSG.jpeg",
        "https://i.imgur.com/s06uvxt.jpeg",
      ]}
      alt={["구름 위의 풍경", "해발 3,000m임을 알리는 표지판"]}
      caption="어느샌가 색이 바뀌어버린 땅과 해발 3,000m 표지판"
    />
    <p>
      8합목에서 휴식 중, 아버지께서 나보고 정상을 찍고 오라고 하셨다. 한계를
      느끼신 것이었다. 몸 상태가 좋지 않았는데도 여기까지 올라오신 거다. 그렇게
      아버지께 쉬라고 말씀드리고, 더 위를 향해 올라갔다. 아버지의 꿈을 대신
      이뤄드리고 싶었다. 근데 확실히 혼자 가다보니, 많이 힘들었다. 재미도
      없었고, 한 발자국 밟는 것이 힘들었다. 시간도 얼마 없어서 마음이 급했다.
      90분 안에 정상을 찍고 왔어야 했다. 그렇게 빠르게 올라가기 시작했다.
      9합목까지 얼마 안 남았을 때, 시계를 보니 40분이 지나 있었다. 이 속도면
      9합목까지 10분 이상은 더 걸렸다. 과연 한정된 시간 안에 다녀 올 수 있을까?
      급격하게 자신감이 떨어졌고, 고민을 했다. 몸과 마음이 지친 상태였다. 그렇게
      자리에 앉아 포기를 선언하고 휴식을 취했다. 아버지께 포기한다고 메시지를
      보내고 마음을 비웠다. 스마트워치에 표기된 고도는 3,360m였다. 정상까지 440m
      남은 상태에서 포기했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/37wi655.jpeg",
        "https://i.imgur.com/FlXJi96.jpeg",
      ]}
      alt={["해발 3,360m임을 나타내는 스마트워치", "빵빵해진 초코파이"]}
      caption="3,360m를 나타내는 시계 / 간식으로 챙겨온 고탄수화물 간식이 터지기 직전이다."
    />
    <YoutubeVideo
      videoId="TSG_8N3DK7Y"
      caption="쉬면서 찍은 타입랩스 영상"
      height={400}
    />
    <p>
      그렇게 잠시 쉬다가 하산을 시작했다. 바닥에 돌이 많고 경사가 높다보니,
      내려가는 것도 쉽지 않았다. 무릎을 다치지 않게 노력했지만 쉽지는 않았다.
      이미 힘이 다 빠진 상태이기 때문에, 무릎에 무리가 가는 방법으로 내려갔다.
      아버지는 8합목에서 쉬시다가 원조7합목으로 내려가신 상태라고 했다. 아버지를
      따라잡기 위해 계속 내려갔다. 내가 원조7합목에 도착하니, 아버지는 신7합목에
      도착하셨다. 그렇게 따라잡기를 계속하는데, 내가 이걸 어떻게 올라왔는지 모를
      정도로 멀게 느껴졌다. 합목 간 거리가 상당했다. 그렇게 6합목에서 아버지를
      만났는데, 내려가는 것만 2시간 하고도 10분이 더 걸렸다. 다행히 아버지께서는
      안색이 많이 좋아지셨다. 그렇게 우리는 하산하여 버스 정류장에 도착했다.
      버스는 18시에 출발한다. 90분을 기다려야 했다. 줄 서서 기다리며, 자판기,
      매점 등을 이용했다. 그렇게 버스가 왔고, 18시 10분 출발했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/2SGZCDC.jpeg"
      alt="많은 사람이 줄 서 있는 버스정류장"
      caption="처음에는 내 앞에 열 명 정도의 사람이 있었지만, 자신의 친구들을 껴주는 외국인 덕분에 내 앞에 40명이 줄서게 됐다."
      height={400}
    />
    <p>
      60분 정도 지났을까, 아침에 출발했던 정류장에 도착했다. 12시간 30분만에
      도착한 숙소에서 짐을 풀고 씻었다. 아버지께서 따뜻한 국물을 드시고
      싶다하여, 주변 식당을 찾아보니 가까운 곳에 우동 전문점이 있어서 찾아갔다.
      어려웠지만, 대충 보니 육수의 종류를 고르고, 튀김도 원하는 만큼 담아
      계산하는 방식이었다. 언젠가 사업 아이템으로 가져가도 좋겠다는 생각과 함께
      메뉴를 고르고 계산 후 식사했다. 맛이 나쁘지 않았지만, 너무 지쳤기에 다
      먹지는 못했다. 소화가 잘 안되는 기분이었다. 아버지께서도 걱정하셨다.
      맛없지 않았는데, 많이 남겨서 주방장이 서운해하지 않을까 하고 말이다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/UUed0o2.jpeg"
      alt="우동 튀김 세트"
      caption="아버지는 따뜻한 소고기 우동, 나는 차가운 돼지고기 우동을 시켰다. 오징어, 생선, 야채, 새우 튀김도 곁들여 먹었다."
      height={400}
    />
    <p>
      숙소에 도착하여, 푹 자고 회복하자는 다짐과 함께 일찍 잠에 들었다. 다시
      시도하진 못할 거 같다. 아니, 후지산 등반을 시도할 수는 있지만 후지노미야
      루트를 고르진 못할 거 같다. 목적지를 눈 앞에 두고 아쉬웠지만, 후회는
      없었다. 이제 다시는 등산을 안가겠다는 생각이 들었지만, 지금은 동네
      뒷산이라도 오르고 싶은 생각이다. 산에 오르기 위해 고생했던 것보다,
      올랐다는 뿌듯함이 더 기억에 남는 것 같다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/aJ0VCdd.jpeg"
      alt="후지산 등반 계획과 실제 등반 기록"
      caption="목표했던 빨간색 루트, 실제로 다녀온 보라색 루트. 지도로 보니 초라하다."
    />
    <OgLink
      href="https://maps.app.goo.gl/KHbDTdC777VACgMJ6"
      title="저녁 식사 / 우동 전문점"
      description="마루가메제면 후지노미야점"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
