"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2022년 9월 17일, 이탈리아 관광의 마지막 날이다. 숙소에서 나와 지하철을
      타고 밀라노 두오모로 이동했다. 오전의 대성당은 밤의 대성당과는 다른
      분위기를 풍겼다. 내부에 입장하기 위해 혼자 매표소에 다녀왔다. 매표소는
      대성당 건물에 있지 않고, 옆 쪽에 있었다. 대성당 내부를 구경할 수 있는
      티켓과 옥상을 구경할 수 있는, 그리고 옥상까지 올라갈 수 있는 엘리베이터
      탑승권을 함께 구입했다. 가격은 기억나지 않는다. 퍼플렉시티를 통해
      검색해보니, 당시에 1인당 16유로였던 것으로 확인된다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/MHVG252.jpeg"
      alt="밀라노 두오모 전경"
      caption="아침의 밀라노 두오모"
    />
    <p>
      내부를 먼저 관광하고 싶었지만, 미사 중이라 내부 관광이 제한되었다. 그래서
      옥상을 먼저 갔다. 도대체 옥상 관광은 왜 있을지 궁금했는데, 올라가보니
      느껴졌다. 옥상에 있는 구조물 하나하나가 섬세한 조각품들이었고, 작품이었다.
      그리고 그것들이 파란 하늘과 함께 보았을 때, 주변에 다른 건물들과
      겹쳐보이지 않았을 때 방해받지 않고 감상할 수 있었다. 옥상은 잘 보이지
      않았을텐데 이렇게 정성을 다했기에, 성당이 아닌 대성당인가보다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/kTut6M5.jpeg",
        "https://i.imgur.com/CZqPF4Y.jpeg",
      ]}
      alt={["밀라노 두오모 옥상 구조물", "밀라노 두오모 옥상 구조물"]}
      caption="하늘을 배경으로 보았을 때 완전해진다."
    />
    <p>
      이 옥상에서 꽤나 불편한 사건을 경험했다. 옥상의 모든 길은 꽤나 좁기에
      1열로 이동한다. 그래서 뒷사람들에게 방해되지 않도록 중간에 멈추지 않고
      이동하는 것이 매너이며, 중간중간에 멈추지 말라는 표지도 붙어있다. 룰과
      매너가 있으면, 언제 어디서나 그걸 지키지 않는 사람들도 있다. 아쉽고
      민망하게도, 두오모 옥상에서는 그 역할을 한국의 아줌마/아저씨 단체가 하고
      있었다. 중간에 멈춰 사진을 찍고, 뒷사람들이 이동하지 못하는 상황이
      발생했다. 그런 상황이 두 세 번 발생하자, 내가 신경질을 냈다. "멈추지 말고
      지나갑시다." 다행히 한번 신경질을 내니, 길이 막히지 않고 잘 이동하였다.
      나보다 한참 앞서가던 누나가 나에게 나중에 물어봤다. 혹시 아저씨들한테
      한마디했냐고 하더라. 맞다고 하니까, 아저씨들끼리 빌어먹을 놈이라며 욕을
      하며 지나갔다더라. 여행온 기분을 잡치고 싶지 않았을 뿐더러, 나한테 직접
      무슨 말을 한게 아니기 때문에 잘 무시하고 지나갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/hJNB0FE.jpeg",
        "https://i.imgur.com/eS9qe5Y.jpeg",
      ]}
      alt={["밀라노 두오모 옥상 통로", "밀라노 두오모 옥상에서 찍은 셀카"]}
      caption="옥상에서 여러 사진을 건졌다."
    />
    <p>
      옥상 관광을 잘 마치고 좁은 계단을 통해 내려왔다. 아직 내부 입장이
      안되었다. 잠시 한 카페에 들어가 시간을 떼웠다. 미사가 끝나는 시간에 맞춰
      줄서기 시작했다. 꽤나 길었던 줄을 기다렸고 보안 검사를 받았다. 소지품 중
      조카의 맥가이버 칼 모양의 플라스틱 장난감이 있었는데, 보안 요원들이 이
      장난감을 갖고 들여보내줄 수 없다는 장난을 쳤다. 시트콤의 한 장면 같아서
      찍어두었어야 했는데, 아쉽게도 우리 가족은 유튜버가 아니라 찍을 생각도
      못했다. 우린 하나의 에피소드를 얻고 입장하였다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/LjPMZZm.jpeg"
      alt="밀라노 두오모 입장 대기줄"
      caption="내가 이 줄을 섰다니"
    />
    <p>
      내부에는 대성당의 웅장함과 함께 수없이 많은 작품이 있었다. 벽 한칸마다
      그림이 걸려 있고, 조각상이 있었다. 창문은 스테인드 글라스 작품이었다. 정말
      볼 것이 많았다. 어떤 작품인지, 작품성이 있는 것인지, 무얼 그린 것인지,
      무얼 상징하는지 하나도 모르지만 그냥 옛날에 지어진 건물 내부에 옛날에
      그려진 것들, 옛날에 조각된 것들이 있다는 것 자체가 신비롭고 좋았다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/n1PUQKO.jpeg"
      alt="밀라노 두오모 내부와 기둥"
      caption="내부 공간의 크기에 한 번, 기둥 크기에 한 번 압도 당한다."
    />
    <p>
      꽤나 내부 구조가 복잡했기에, 어떻게든 모든 위치에 내 몸을 두고 구경하고
      싶었다. 어딘가에서 시선이 느껴졌다. 그 방향을 바라보니, 어머니께서 급한
      눈빛을 보냈다. 어머니께 달려갔고, 다섯살 조카가 쉬야가 마렵다는 것. 하지만
      화장실이 보이지 않았고 우린 화장실을 찾아 바깥으로 나갔다. 두오모 옆에
      있는 백화점에 들어가 여자 화장실이 있다는 4~5층까지 걸어서 올라갔다.
      어머니는 조카를 데리고 화장실에 들어가 볼일을 보게 하고 나왔다. 너무
      급했던 상황이라 갑자기 위치가 이동되었는데, 두오모에 다시 입장하긴
      어려웠다. 이미 사용한 티켓이고, 줄을 다시 서기에도 시간이 부족했다.
      아쉽게도 대성당을 더 보지 못하고 식사하러 이동했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/uyRtIV0.jpeg",
        "https://i.imgur.com/ZFTEdVU.jpeg",
        "https://i.imgur.com/CMXX9hv.jpeg",
      ]}
      alt={[
        "밀라노 대성당 예술작품",
        "밀라노 대성당 예술작품",
        "밀라노 대성당 예술작품",
      ]}
      caption="밀라노 대성당에서는 모든 것이 예술 작품이다."
    />
    <p>
      이탈리안 식당에 방문했다. 사람이 많았기에 종업원은 우릴 잘 쳐다보지
      않았다. 참고로 유럽에서는 웨이터를 부르는게 예의에 어긋나기에, 눈을 마주칠
      때까지 기다렸다. 어떻게 겨우 주문을 마쳤는데, 샐러드가 식사 제일 마지막에
      나오는 경험도 했다. 뭐, 사람이 많으니 실수할 수도 있겠지만 안좋게 생각하면
      인종차별 당한 느낌도 든다. 구글 맵 리뷰를 보니 인종 차별에 대한 이야기는
      하나도 없고, 직원이 친절하다고 한다. 우리의 기분 탓이었나보다. 어쨌거나,
      우린 다음 장소로 이동했다. 걸어서 천천히 20분동안 스포르체스코 성으로
      이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/xjeKgaw.jpeg"
      alt="스포르체스코 성 입구"
      caption="스포르체스코 성 입구"
      height={600}
    />
    <p>
      이 성도 꽤나 웅장하고 아름답게 지어진 곳인데, 두오모를 보고 온 직후라
      그런지 감흥이 없었다. 편하게 걸을 수 있는, 날씨를 느낄 수 있는 공원
      같았다. 짧은 시간 머물렀다. 기념품 샵에서 마그넷을 구입하고, 다시 숙소로
      이동했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/4vLVkTq.jpeg",
        "https://i.imgur.com/E4Z76ss.jpeg",
      ]}
      alt={["스포르체스코 성 산책", "스포르체스코 성 산책"]}
      caption="가볍게 산책을 하고왔다."
    />
    <p>
      지하철을 타고 숙소로 왔다. 숙소 앞의 버스 정류장에서 공항으로 가는 버스
      시간표를 보고 시간을 계산하면서 이동했다. 나 혼자 공항으로 이동하고,
      부모님과 누나, 조카는 기차를 타고 프랑스 파리로 이동한다. 꽤 이른 시간
      숙소에 도착하여 전날 사두었던 라면과 떡볶이 인스턴트 식품을 먹으며 저녁
      시간을 보냈다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/tFC0Dsz.jpeg"
      alt="말펜사 공항행 버스 시간표"
      caption="말펜사 공항으로 가는 버스 시간표"
      height={400}
    />
    <OgLink
      href="https://maps.app.goo.gl/9QNKt9guzycTaDUA7"
      title="점심 식사 / 이탈리아식 전문점"
      description="Al Cantinone"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
