"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      그게 나다. 2022년 9월 9일 오전 8시, 나에게 선택지는 두 개 있었다. 우리
      가족은 10시 20분에 베네치아로 행하는 기차를 예매해두었는데, 기차가 출발할
      때까지 무얼하느냐였다. 첫번째는 긴 비행으로 쌓인 피로를 푸는 방법.
      두번째는 두 시간동안 빠르게 로마를 훑는 방법이었다. 코로나 유행으로 인해
      해외여행을 약 30개월 쉬었고, 그만큼 기대했기에 어떻게든 로마를
      경험해보기로 결정했다. 아버지는 로마의 알짜배기를 보여주겠다며 나를 데리고
      출발하셨다. 나보나 광장을 시작으로 로마 시내를 반시계 방향으로 돌았다.
    </p>
    <p>
      첫 방문지는 나보나 광장, 타원형으로 긴 광장이다. 한국에서는 광장이라는
      단어를 잘 사용하지 않다보니 사이즈가 가늠되지 않았었는데, 조그마한 공원
      느낌이었다. 긴 광장의 양쪽 끝, 그리고 중앙까지 총 세 개의 분수가 있는데
      펜스가 쳐져 있었다. 왜인지는 잘 모르겠다. 나보나 공원이 과거 경기장
      코스였다고 한다. 이탈리아 땅을 밟은 뒤 첫 관광지라 기대를 많이 했는데,
      펜스로 인해 사진이 이쁘지 않아 실망했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/MEPe1eK.jpeg"
      alt="나보나 공원"
      caption="나보나 공원"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/E7mtFW5.jpeg",
        "https://i.imgur.com/IzS2iw7.jpeg",
        "https://i.imgur.com/hYU8P7k.jpeg",
      ]}
      alt={["나보나 공원의 분수", "나보나 공원의", "나보나 공원의 분수"]}
      caption="나보나 공원의 분수들"
      height={300}
    />
    <p>
      두번째는 판테온이었다. 판테온 내부에 볼 것이 매우 많다고 들었는데, 로마를
      구경할 시간이 적었을 뿐더러 너무 일찍 방문했기에 어짜피 오픈 전이었다.
      판테온의 웅장함을 밖에서 보기만 하고, 꼭 가야만 한다는 바로 앞 카페로
      이동했다. 70년 정도 되었고 로마 3대 커피 전문점 중 하나라고 한다. 이름이
      타짜도르였는데, 한국에서도 종종 이 명칭을 봤었다. 이 글을 쓰며 찾아보니,
      한국에 있는 타짜도르 가게들은 라이센스를 사서 사용하고 있다고 한다.
      이탈리아 카페에서는 자리를 잡고 앉아서 마시면 자리값을 받는다. 돈과 시간을
      아낄 겸, 그 자리에서 에스프레소와 크로아상을 먹었다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/b5cCZPY.jpeg",
        "https://i.imgur.com/gws4d1g.jpeg",
      ]}
      alt={["판테온", "판테온"]}
      caption="아침 일찍이라 한적한 판테온"
      height={500}
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/2DWvAzW.jpeg",
        "https://i.imgur.com/YCCcAof.jpeg",
      ]}
      alt={[
        "타짜도르의 크로아상과 에스프레소",
        "타짜도르 구석에 있는 커피콩 자루",
      ]}
      caption="타짜도르에서 크로아상과 에스프레소를 후다닥 마셨다. 가게 구석에 있는 커피콩 자루에는 만지지 말라는 한국어가 적혀있어 민망했다."
      height={600}
    />
    <p>
      시간이 별로 없다. 뜨거운 커피를 홀짝홀짝 빠르게 마시고 다시 걸었다. 로마는
      조금만 걸으면 오래된 조각상, 건물들이 상당히 많은데, 꽤나 높은 조각상도
      보였다. 높기도 하지만, 그 높은 기둥에 그림이 그려져 있었다. 나중에
      찾아보니 '마르쿠스 아우렐리우스 원주'라고 한다. 2세기에 만들어졌다고 하니,
      19세기 동안 서있는 기둥인 것이다. 마르쿠스 아우렐리우스가 승리한 것을
      기념한 기둥이라고 한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/O0lTV7e.jpeg",
        "https://i.imgur.com/Oh2qn29.jpeg",
      ]}
      alt={["마르쿠스 아우렐리우스 원주", "마르쿠스 아우렐리우스 원주"]}
      caption="걷다보면 엄청나보이는 건축물들이 많다."
      height={500}
    />
    <p>
      얼마 안 걸어 트레비 분수에 도착했다. 평범한 트레비 분수가 아니었다. 오전
      9시 전인데도 사람이 무진장 많았는데, 분수에서 물이 나오지 않았다. 청소하는
      날이라고 한다. 트레비 분수의 분위기를 살펴보고 바로 이동했다. 빨리
      움직이지 않으면 트레비 분수의 인파에 기가 빨리고 다른 관광지를 구경하지
      못했다. 시간이 부족하다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/i8iGtN3.jpeg",
        "https://i.imgur.com/23ftMQ1.jpeg",
        "https://i.imgur.com/wEPL9cU.jpeg",
      ]}
      alt={[
        "청소 중인 트레비 분수",
        "사람들에게 둘러싸인 트레비 분수",
        "물이 나오지 않는 트레비 분수",
      ]}
      caption="물이 나오지 않는 트레비 분수와 인파"
    />
    <p>
      다음 목적지로 걷다보니 볼 거리가 많았다. 남산에 있을법한 자물쇠가 가득
      붙은 울타리, 성모 상도 있었다. 저 성모상이 들고 있는 화환은 1년에 한 번씩
      소방관들이 교체한단다. 확실한 정보는 아니다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/TGHgDwv.jpeg",
        "https://i.imgur.com/Zth5BBQ.jpeg",
        "https://i.imgur.com/fhrxk8h.jpeg",
      ]}
      alt={["자물쇠가 가득한 울타리", "동상", "동상"]}
      caption="로마는 10m마다 볼 것들이 가득하다."
    />
    <p>
      스페인 대사관이 있다는 이유로 이름이 스페인 광장이 된 큰 공원에도 사람이
      가득했다. 어찌 된게 이 시간부터 관광객들이 이리 많은지, 역시 유럽이고 그
      중 이탈리아, 그 중 로마다. 그리고 그 중 스페인 광장이다. 딱히 볼만하다고
      느낀 것은 없지만, 살면서 한번은 가봤다고 말하고 싶은 곳이었다. 여기는
      아버지 코스의 반환점이었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/Kflczik.jpeg"
      alt="스페인 광장의 계단"
      caption="스페인 광장의 계단. 계단에 앉는 것이 불법이기에 깨끗하다."
    />
    <p>
      이제는 테베레 강을 따라 로마를 느끼면 됐다. 그림 같은 구름이 낀 맑은
      날이었기에 강 따라 걷는 것 자체가 행복했다. 강을 건너면 다시 돌아올
      에너지가 부족할 듯 하여, 멀리서 보기만 했다. 언제 지어졌을지 모를 오래된
      법원이 있었다. 지은지 오래 된 건물을 현대에서도 계속 사용한다는 것 자체가
      낭만 넘치는 도시였다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/pg2JElt.jpeg"
      alt="로마 대법원 건물"
      caption="Corte Suprema di Cassazione. 아마도 대법원인듯 하다."
    />
    <p>
      대법원 건물을 찍고 조금 이동하니 다리부터 성까지 세트처럼 보이는 구간이
      있었다. 천사를 주제로 만들어진 느낌이 들었는데, 이름이 천사의 성이었다.
      자세한 역사와 배경은 모르지만 내 눈에 한번 담은 것만으로도 기분 좋은
      곳이었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/jeYbsyg.jpeg"
      alt="천사의 성"
      caption="천사의 느낌이 드는 천사의 성"
    />
    <p>
      천사의 성에서 고개를 조금만 돌려도 바티칸이 보였다. 추후 바티칸에 있는
      건축물을 공부해보니, 나와 아주 잘 맞을 법한 생각이 들어 못간 것이 아쉽긴
      하다. 언젠가 더 공부해서 바티칸에 있는 것들을 느껴보고 싶다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/saPLZjF.jpeg"
      alt="바티칸 방향의 로마 풍경"
      caption="저 멀리 보이는 돔 건물이 바티칸 오벨리스크이다."
    />
    <p>
      그렇게 다시 숙소로 돌아와 세수 한번 하고 이동을 시작했다. 아직 로마에
      도착한지 두시간 밖에 안됐다. 두시간동안 이 많은 것들을 보았으니, 소화할
      시간이 필요했다. 밴을 불러 우리 가족 다섯 명의 짐을 트렁크에 싣고 테르미니
      역으로 이동했다. 기차로 약 4시간을 달렸다. 한국의 집에서 나온지 30시간
      이상이 되었기에 바로 잠에 빠져들줄 알았는데, 각성 상태가 오래 유지되어서
      그런지 더욱 잠에 들기 어려웠다. 네 시간을 뜬 눈으로 지내고, 베니스 역에
      도착했다. 역에서 가까운 숙소에 짐을 풀고, 우리 가족은 나뉘어 움직였다.
      아버지와 나는 렌트카를 대여하기 위해 베니스의 마르코 폴로 공항으로
      이동했고, 나머지는 베니스 섬으로 관광갔다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/dyqUpMS.jpeg"
      alt="기차 창 밖 풍경"
      caption="생각보다 바깥은 볼게 없었다. 한적한 유럽 시골 느낌이었다."
      height={600}
    />
    <p>
      아버지께서 저렴한 차량을 타기 위해 공항에서 꽤나 떨어진 업체로 예약하셨다.
      공항에서 셔틀버스를 이용해 매장으로 이동했다. 셔틀 버스를 탑승하는 위치
      설명이 매우 불친절하였기에, 공항에서 방황했지만 운이 좋게도 버스에 업체의
      로고가 눈에 띄어 이동할 수 있었다. 차량을 대여하는 과정에서도, 돈을 더
      내야 한다는 둥 여러가지 상황이 있었지만 아버지의 커뮤니케이션을 통해
      어찌저찌 잘 빌렸다. 차량은 스코다사의 카록이었다. 사실, 스코다도 이때 처음
      들었고 카록이라는 모델도 이때 처음 봤다. 현대의 투싼과 비슷한 사이즈의
      차량이었다. 우리는 이 차를 숙소에 주차한 후, 어떻게든 시간을 아끼기 위해
      베니스 섬으로 이동했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/IsZgfQE.jpeg",
        "https://i.imgur.com/dfpTWgA.jpeg",
      ]}
      alt={["차량 렌트 전 사진", "차량 렌트 전 사진"]}
      caption="차를 빌릴 때는 역시 문제가 없는지 사진을 찍으며 점검해줘야 한다."
    />
    <p>
      어느덧 해가 졌고, 베니스 섬은 깜깜했다. 평소보다 10시간 이상 더
      깨어있음에도 불구하고, 어떻게든 이탈리아에서의 시간을 관광하는데
      써야한다는 마음가짐으로 아버지와 나는 베니스 섬을 돌아다녔다. 베니스의
      수상택시도 타보고, 어찌저찌 베니스 섬을 구경했다. 사실 이 날은 기억이 별로
      없다. 저녁을 베니스 섬 가기 전에 먹었는지 다녀와서 먹었는지도 잘 모르겠다.
      숙소에 들어가자마자 샤워 후 바로 뻗어버렸다. 이렇게 길었던 이탈리아에서의
      1일차가 끝났다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/TRgFMsQ.jpeg"
      alt="베니스 야경"
      caption="버스에서 내리자마자 찍은 베니스의 사진. 머릿속의 베니스와 너무 똑같았다."
    />
  </>
);
