"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      왜인지 모르겠지만, 여행을 떠나고 싶었다. 회사가 바빠서 스트레스를 받기도
      했고, 미국에 대한 감정이 계속 떠오르기도 하고. 지금 안 가면 가기 어려울 거
      같았다. 언제 자녀가 생길지도 모르고, ESTA와 국립공원 연간패스는 만료일이
      다가오고 있었다. 그래서 또 다시 미국 여행을 준비하게 되었다.
    </p>
    <p>
      마침 마일리지도 많이 쌓였다. 비즈니스석도 타보고 싶었지만, 굳이 탈 필요는
      없었다. 와이프와 함께 예약해야 했기에, 이코노미 석으로 예약하기로 했다.
      대한항공 홈페이지에서 마일리지로 예약할 수 있는 미주 도착지를 확인해보고,
      그 중 여행하기 좋은 곳을 찾아봤다. 다양한 경우의 수를 공부해본 결과, 최종
      선택은 라스베가스였다. 더 정확히 말하면, 라스베가스를 통한 그랜드
      서클이었다. 라스베가스 외에도 다양한 선택지가 존재했지만, 그랜드 서클을
      비롯한 다양한 대자연이 밀도 높게 존재하는 그 지역을 골랐다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/Q50Baw3.png"]}
      alt="구글 지도"
      caption="구글 지도를 통해 본 여행 경로"
    />
    <p>
      5월 쯤, in/out 일정을 잡아두고, 세부 계획을 짜기 시작했다. 추석 연휴와
      개천절 연휴를 활용하였고, 14박 15일 일정으로 연차를 9일 썼다. 여행 책자를
      사고, 구글 지도를 통해 이동 경로를 파악하며 국립 시설과 유명한 관광 명소를
      나열했다. 위 이미지처럼 나비넥타이 모양의 경로가 완성되었고, 적절한
      위치마다 숙소를 예약했다. booking.com에서 무료 취소가 가능하며 조식을
      제공하는 호텔로만 예약했다. 그리고 3~4주마다 호텔 가격을 비교하며
      취소/재예약했다. 참고로, 여행을 떠나기 1주 전에 호텔 가격을 비교한 결과
      같은 호텔/기간에 5만원 이상 저렴해지는 곳들이 있어서 이 때 재예약을 네
      군데 정도 한 거 같다. 14박 일정에 호텔은 열 세 곳이었다.
    </p>
    <p>
      지난 1월 여행에서도 14박 일정에 호텔이 열 한 곳이었는데, 숙소를 옮길
      때마다 캐리어를 풀고 싸고 옮기는 과정이 꽤 피곤했다. 이번 여행에서는 1인당
      작은 캐리어 하나에 짐을 싸고, 그 캐리어만을 숙소에 들고 다녔다. 큰
      캐리어도 있었지만, 여행에서 구입한 기념품이나, 매일매일 사용하지 않을 법한
      물건들을 넣어두고 자동차 트렁크에 그대로 두었다. 물론 차량 내 물건을
      훔쳐가는 경우가 있어서 다른 사람들에게 쉽게 권하지는 못하겠다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/dPt7R4r.png"]}
      alt="기념품 샵"
      caption="콜로라도 국립 기념물 방문자 센터. 굿즈를 모으는 우리에게는 환장하는 곳이다."
    />
    <p>
      내가 계획한 내용을 미국 자동차 여행 커뮤니티에 올리고 도움을 받았다. 한
      달에 한 번씩은 접속하여 남들의 여행기를 읽어보며 부러워하는데, 내가 가려는
      곳의 정보를 파악하기에 상당히 좋은 장소다. 그랜드 서클을 수 번 다녀오신
      똥꼬아빠님의 도움을 받아 계획에 일부 코스를 추가/수정했다. 다른 글에서
      언급하겠지만, 똥꼬아빠님의 추천 코스는 직접 방문해보니, 한국인들에게
      유명하지 않지만 꼭 가봐야 하는 곳이라 느꼈다.
    </p>
    <p>
      지난 여행에서 준비한 국립공원 연간패스와 ESTA는 재사용했기에 금전적으로 큰
      도움이 되었다. 이번 여행에서는 총 아홉 곳의 국립공원, 두 곳의 주립공원, 두
      곳의 국립시설에 방문했다. 작년에 80불 정도로 구입한 연간패스로 총 11개의
      국립 시설을 방문했으니, 심하게는 2,200불, 올해의 연간패스 가격으로
      계산하면 250불을 아낀 셈이다. 총 2,500마일, 즉 4,000km를 운전했으며, 일부
      국립공원에서는 자차를 이용할 수 없었기에 셔틀버스를 이용했다. 참고로
      Hertz에서 AWD 차량을 14일동안 빌렸다. 금액은 다른 글에서 더 자세히
      다뤄보겠다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/Unzp0B3.png"]}
      alt="자동차"
      caption="내가 빌린 AWD 투싼. 한국 차량이라 운전이 익숙했다."
    />
    <p>
      여행을 다녀온지 일주일이 조금 지난 지금, 아직도 후회 없이 잘 놀고 왔다는
      생각이 든다. 다른 여행 포스팅도 밀렸지만, 기억이 생생할 때 이 여행을
      기록해야 한다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/Q4JRLTM.png"]}
      alt="모뉴먼트 밸리"
      caption="모뉴먼트 밸리 비지터 센터에서 본 butte들"
    />
    <OgLink
      href="https://usacartrip.com/xe/usa_board/2247355"
      title="미국자동차여행 커뮤니티"
      description="내가 직접 미국자동차여행 커뮤니티에 올린 리뷰 요청 글"
      image="https://usacartrip.com/xe/files/attach/images/1827776/2c76bd06659fa4ef13e7c3dbf8ecf034.png"
    />
  </>
);
