"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2022년 9월 16일, 숙소에서 짐을 챙기고 나왔다. 돌로미티에서의 마지막
      숙소였다. 큰 길을 따라 이동했다. 오늘도 자전거, 오토바이, 스포츠카를
      만났다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/DqJmo2m.gif"
      alt="자전거와 함께 달리는 차"
      caption="자전거와 함께 달렸다."
    />
    <p>
      밀라노로 가는 길에 스텔비오 패스 (Passo dello Stelvio)를 지났다. 스텔비오
      패스는 급커브가 많은 길로, 자전거, 오토바이, 스포츠카, 그리고 일반
      자동차의 운전자들에게 인기가 좋은 드라이브 코스이다. 차를 세우고 스텔비오
      패스를 볼 수 있는 뷰포인트가 있어, 내려 한참을 구경했다. 길은 급커브가
      많았다. 경사가 급한 곳에 길을 만들어서 이리 꼬불 길이 된건지, 이유는
      모른다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/gHiJRc1.jpeg"
      alt="스텔비오 패스 뷰 포인트"
      caption="빌리지 손가락 서너개가 합쳐진 코스"
    />
    <p>
      길도 길이지만, 날씨가 좋아 산과 하늘의 조화를 찍기 아주 좋았다. 마지막
      포인트라 더 기억에 남는 것인지 모르겠지만, 돌로미티에서 기분이 제일 좋은
      곳 중 하나였다. 부모님, 누나, 조카와 수십장의 사진을 찍고 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/L0V7UCE.gif"
      alt="돌로미티에서 찍은 타입랩스"
      caption="돌로미티에서의 타임랩스는 언제나 환상적이다."
    />
    <p>
      다음 장소로 이동하는 길에 점심 식사를 위해 피자 레스토랑에 들어갔다
      .사진도 없고, 맛도 정확하게 기억나지 않지만 매우 만족스럽게 식사했던
      기억이 있다. 피자 맛이 좋았고, 야외에서 먹기에 날씨도 너무 좋았기
      때문이다. 장소는 아래에 달아두겠다.
    </p>
    <p>
      그리고 계속 달렸다. 기록을 보니, 아버지께서는 오전부터 합쳐서 네다섯시간을
      계속 운전하셨다. 그렇게 낮에 밀라노에 도착했고, 돌로미티와는 다른 곳으로
      도착해버렸다. 많이 아쉽기도 했지만, 밀라노는 또 다른 매력을 갖고 있었기에
      새로운 기대를 하게 되었다. 나와 아버지는 숙소 체크인 이후 바로 렌트카를
      반납하러 갔다. 지도에 찍힌 장소로 이동했는데, 공원 주차장이었고, 차를
      반납할만한 시스템은 보이지 않았다. 나 혼자 내려 이곳 저곳을 뛰어다니다가,
      렌트카 업체 로고를 발견하고 들어가서 물어봤다. 차를 여기로 갖고 오면 되냐?
      맞다길래 밖으로 뛰어나와 아버지께 말씀드렸다. 함께 차를 반납한 후 숙소로
      걸어갔다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/XziQd2T.jpeg"
      alt="돌로미티 뷰"
      caption="돌로미티에서 찍은 마지막 사진"
    />
    <p>
      어머니와 누나는 쉬겠다고 했다. 아버지와 나는 이탈리아에서의 시간이
      아까워서 쉴 수 없었다. 다음 날 오전에 밀라노 두오모에 가기로 했지만, 밤과
      낮의 대성당은 다른 분위기를 보인다길래 지하철을 타고 바로 이동했다. 숙소는
      밀라노 첸트랄레 역에 있었고 두오모 역까지 지하철을 탔다. 꽤나 늦은
      밤이었는데도 대성당 앞에는 사람이 많았다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/9mLk1CN.jpeg"
      alt="밀라노 두오모와 동상"
      caption="밀라노 두오모를 바라보는 동상"
    />
    <p>
      두오모는 정말 컸다. 사진에서 잘 느껴지지 않을 정도로 정말 컸다. 600년이
      걸렸다고 하는데, 보면 600년보다 더 긴 시간이 필요하게 느껴진다. 이탈리아
      북부의 가장 중심지인 밀라노이자, 그 중 두오모다. 관광객은 두오모를
      배경으로 셀카를 찍고 있고, 누군가는 전쟁에 반대하는 시위를 하고 있다. 밤의
      두오모를 보길 정말 잘했다. 저녁 시간이라 태양이 없어 주는 분위기도 있지만,
      두오모 주변의 사람들의 분위기도 많이 달랐다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/yEQJgRK.jpeg"
      alt="밀라노 두오모 앞의 다양한 사람들"
      caption="누군가는 쉬고, 누군가는 시위하고, 누군가는 셀카를 찍는 밀라노 두오모 앞"
    />
    <p>
      아버지와 나는 매우 피곤했지만, 밀라노를 조금이라도 더 살펴보고자 다른
      곳으로도 이동했다. 두오모 옆에는 비토리아 에마누엘레 2세 갤러리아라는
      쇼핑몰이 있었다. 늦은 시간이라 모든 매장이 닫은 상태였지만, 사람이 많았다.
      특히나 소의 고환을 밟고 한바퀴 돌면 행운이 온다는 유명한 미신으로 인해 성
      불구가 된 소 타일은 많은 생각이 들게 했다. 이 단단한 타일에 여러 사람이
      한바퀴 돌아서 파였다. 수천만번일지 수억번일지 모르겠지만 그렇게 꾸준한
      행동으로 이 단단한 돌이 파였다는 것, 그리고 이 타일을 바꾸지 않고 역사로
      둔다는 것. 쉽지 않고, 누구나 할 수 있는 생각은 아닐 듯 했다. 역사를
      생각하는 수준이 남다르다고 느꼈다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/PvKxivh.jpeg"
      alt="중요부가 파여버린 소 타일"
      caption="불쌍한 소"
    />
    <p>
      여기는 중심지 중 중심지이며, 명품 브랜드의 본고장인 이탈리아인만큼, 고급
      브랜드들이 많이 입점해있었다. 특히나 몽클레어는 이탈리아의 분위기에 맞게
      조형물을 전시해두어 더 고급져보였다. 문도 닫았고 돈도 없어서 우리는 빠르게
      구경하고 다시 숙소로 돌아갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/VQ0zWga.jpeg",
        "https://i.imgur.com/EAxBHUg.jpeg",
      ]}
      alt={["몽클레어 매장", "몽클레어 매장"]}
      caption="갤러리아의 몽클레어 매장"
    />
    <OgLink
      href="https://maps.app.goo.gl/UUC7kL3m7gt9UeXk6"
      title="점심 식사 / 피자 전문점 Ristorante Pizzeria Al Ponte"
      description="Ristorante Pizzeria Al Ponte"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
