"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2024년 8월 11일 일요일, 아버지께서 날 픽업하러 오셨다. 아버지는 얼마 전
      비를 맞아 평소보다 기침을 많이 하셨다. 아버지와 차를 타고 가면서 걱정을
      말했다. 요즘 저가 항공사가 기내 수하물 검사를 빡세게 하는데, 집에서
      캐리어를 재보니 11kg였다. 제주항공의 기준에 1kg 초과한 수치였다. 아버지는
      걱정 말라고 하셨다. 우리는 일행이니까 합쳐서 20kg 미만이면 된다고. 그리고
      1kg 정도로 태클 걸면, 한마디 해주시겠다고 했다. 가는 길에 제주항공에서
      문자, 이메일, 카카오톡이 왔다. 한국어, 영어, 일어로 세통이 왔으니 총 아홉
      통이 왔다. 30분 지연된다고.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/WPVUj81.jpeg"
      alt="문자메시지 목록"
      caption="지연됐다고 여러 언어로 연락을 주는 제주항공"
      height={600}
    />
    <p>
      아버지가 미리 예약해두신 발렛파킹 서비스를 이용하여 주차를 마무리 하고
      떨리는 마음으로 공항에 들어갔다. 이미 모바일 탑승권을 발급 받았고 위탁
      수하물이 없기 때문에 바로 출국장으로 들어갔다. 항상 그렇듯이, 면세품
      인도장에서 온라인으로 구매해둔 로션을 인도받았다. 로션은 짐 쌀 때 신경쓰기
      어렵기 때문에, 해외 여행을 갈 때마다 한 통씩 사서 해외에서 쓰고 갖고
      들어온다. 또 늘 그렇듯, 아버지와 PP카드 혜택을 사용하여 마티나 라운지에서
      식사를 했다. 비행기 탑승을 대기하며 저울로 짐을 재봤지만, 합쳐서 20kg가
      넘었다. 더 쫄리는 마음으로 탑승하는데, 짐의 개수만 살펴볼 뿐 무게를
      검사하진 않았다. 정말 다행이었다. 그렇게 아버지와 후지산을 향한 비행기를
      탔다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/Ng1DbtF.jpeg"
      alt="공항에서 대기 중인 사람들"
      caption="인천공항 1터미널 18번 게이트를 통해 비행기에 탑승했다."
      height={400}
    />
    <p>
      나는 비행기 탑승을 위해 넷플릭스나 디즈니 플러스의 컨텐츠를 다운로드
      해둔다. 하지만 아버지 옆자리에 앉으면 아버지 스마트폰에 눈이 간다. 인터넷
      연결 없이도 사용할 수 있는 지도인데, GPS를 잡을 수 있기 때문에 현재 위치를
      지도 상에서 확인할 수 있다. 바깥을 보며, '저기가 우리 집이다', '저기가
      남양 연구소다', '저기가 니가 가고 싶다던 그 산이다' 등 얘기를 하며
      가다보면 어느덧 바다 위를 날아가고 있다. 넷플릭스 보다가, 살짝 졸다가 하다
      보면 안내 방송이 나온다. 이제 곧 시즈오카 공항에 착륙하니까 안전벨트를
      매라고.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/mo40kq4.jpeg",
        "https://i.imgur.com/vdxleBS.jpeg",
        "https://i.imgur.com/iMrGotl.jpeg",
      ]}
      alt={["하늘에서 본 일본 1", "하늘에서 본 일본 2", "하늘에서 본 일본 3"]}
      caption="하늘에서 본 우리나라는 도시, 산, 바다 할 것 없이 모두 아름답다."
    />
    <p>
      시즈오카가 눈에 들어오기 시작했다. 논과 주택이 빽빽하게 모여있는, 마치
      일본 만화영화에서 자주 본 그런 광경이었다. 작은 공항이라 입국 심사가
      빨랐고, 이동이 적었다. 입국장을 빠져나오자마자 버스 정류장이 있었다.
      항공편이 별로 없어서 그런지, 우리 비행기가 지연된만큼 버스 시간도
      지연되었다. 3번 정류장에서 버스를 타고 시즈오카 역으로 향했다. 참고로,
      스이카나 이코카 같은 교통 카드가 있으면, 타면서 해당 카드를 찍으면 되고,
      현금 결제를 원한다면 그냥 탑승하고 나중에 내리면서 1,100엔을 내면 된다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/xUI6TeH.jpeg"
      alt="착륙 직전에 본 시즈오카 공항 주변"
      caption="착륙 직전에 본 시즈오카 공항 주변"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/NHhb9eR.jpeg",
        "https://i.imgur.com/ZSvoUaJ.jpeg",
      ]}
      alt={[
        "시즈오카 공항에서 시즈오카 역으로 가는 버스 시간표",
        "시즈오카 공항에서 시즈오카 역으로 가는 버스",
      ]}
      caption="3번 정류장과 버스"
    />
    <p>
      시즈오카 역에서 전철로 갈아탔다. 후지 역까지 도카이도 본선을 타고,
      미노부선으로 갈아타서 후지노미야 역까지 갔다. 860엔을 내고 약 1시간을
      이동했다. 숙소는 후지노미야 역 바로 앞에 있었다. 체크인 후, 숙소와 가까운
      세븐일레븐에 가서 다음날 아침 식사거리, 마실 것들, 오늘 저녁거리까지
      구매했다. 호텔에 있는 공중 목욕탕을 이용하고 식사를 했다. 세븐일레븐에서
      사온 고로케와 치킨을 먹었다. 역시 일본은 편의점의 나라, 이 가격에 이
      맛이라니, 너무 만족 스러웠다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/Vo41qgM.jpeg",
        "https://i.imgur.com/m9vYZF5.jpeg",
      ]}
      alt={[
        "세븐일레븐에서 사온 고로케",
        "세븐일레븐에서 사온 고로케를 한입 베어 문 사진",
      ]}
      caption="세븐일레븐에서 파는 치즈 커리 고로케"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/diL9a8M.jpeg",
        "https://i.imgur.com/uEbf83A.jpeg",
      ]}
      alt={[
        "세븐일레븐에서 사온 가라아게",
        "세븐일레븐에서 사온 가라아게를 한입 베어 문 사진",
      ]}
      caption="세븐일레븐에서 파는 가라아게"
    />
    <p>
      다음 날은 5시에 일어나야 한다. 최고의 컨디션을 갖고 출발해야 하는데, 그리
      예감이 좋진 않았다. 아버지의 기침소리는 누가 들어도 건강이 안좋아보였고,
      난 소화가 안되는 기분이 들었다. 하지만 몇십만원짜리 비행기 티켓값과
      몇십만원의 숙소비를 이미 냈기에, 최선을 다해 잠에 들었다.
    </p>
    <OgLink
      href="https://maps.app.goo.gl/Vs7k4mnrhQiBvzpQ6"
      ogTitle="숙소"
      ogDescription="Kuretake Inn Premium Fujinomiya"
      ogImage="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
