"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      이제 조금씩 사람 사는 집으로 변신 중이다. 사람 사는 집으로 변신하기 위한
      가장 중요한 작업이 도배와 조명이다. 직장 동료에게 소개받은 업자분께서는 두
      분이서 작업을 진행하셨다. 친한 형님 아우 관계였으며 작업하는 것을
      보고있으면, 충청도 의형제 바이브가 느껴졌다. 타작업은 소음이 크게
      발생하다보니 관리소에서 허락한 9시 이후부터 공사를 시작했는데, 도배는
      조용한 작업이라며 7시에 현장에 도착하여 작업을 시작하셨다. 참고로 작업하신
      분의 업체명은 또봬요이다. 아마 도배라는 단어를 활용한 업체명이 아닐까
      싶다. 작업자 두 분께서 다양한 장비를 들고 오셨다. 사실 장비가 별로 필요
      없을줄 알았는데, 천장 도배와 조명 작업을 위한 우마도 대여섯개 들고 오셨고,
      다양한 장비가 들어있는 박스들도 갖고 오셨다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/0ehB9rT.jpeg",
        "https://i.imgur.com/4h3wAQX.jpeg",
        "https://i.imgur.com/lAfC1qx.jpeg",
      ]}
      alt={[
        "도배 전 장비가 세팅된 현장",
        "도배 전 장비가 세팅된 현장",
        "도배 전 장비가 세팅된 현장",
      ]}
      caption="도배 전 다양한 장비를 세팅한 현장"
    />
    <p>
      아침에 인사드리고 출근하려 했는데, 준비해두었던 조명도가 허술했기 때문에
      조명 작업자와 커뮤니케이션이 많이 필요했다. 갑작스럽지만 회사에 오프를
      쓰고 계속 현장에 있었다. 이 선택이 어찌 보면 우연찮은 최고의 선택이
      되었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/qTVenUO.jpeg"
      alt="조명도"
      height={400}
      caption="열심히 준비했지만 작업 시 참고하기에 허술했던 내 조명도"
    />
    <p>
      잠시 시간이 있을 때마다 작업된 현장을 살펴보며 이것저것 만져봤는데,
      필름시공 했던 문틀에 닫히지 않는 문들이 있었다. 그래서 필름 사장님께
      연락드렸고, 오후에 와서 고쳐주시기로 했다. 문이 안닫혔던 것도 지금
      생각해보니 신이 도와주신 것이었다. 어머니께서 현장이 궁금하다고 하셔 잠시
      방문하신 후 함께 점심식사를 하고 오후에 현장으로 다시 돌아왔다. 어머니는
      댁으로 돌아가셨고, 조명 위치에 대해 또 다시 논의하며 조명 작업을
      진행하셨다. 필름 사장님께서도 언젠가부터 오셔서 문을 수리하고 계셨다. 필름
      사장님과 대화하던 중 어디선가 폭포 소리가 들렸다. 조명 작업자 분께서
      외치셨다. "아우야, 아우야" 거실로 나가보니, 천장에서 물이 나오고 있었다.
      폭포처럼 물이 나오고 있었고, 작업자 두 분께서 번갈아가며 천장에서 나오는
      물을 양동이에 채워 화장실에 갖다 버리기 시작했다. 머리가 새하얘졌다.
      온몸이 물에 젖어 뛰어다니는 사장님께 내가 뭘해야할지 물어봤다. 관리실에
      연락해달라고 해서, 바로 전화했고 스프링쿨러가 터졌다고 하니 깜짝 놀래서
      직원 세 분이 뛰어오셧다. 소방 밸브를 잠그셨고, 물은 멈췄다. 바닥이 물에
      가득 찼고, 작업자분들께서 바닥의 물을 치우기 시작했다. 현장에 함께 있던
      필름 사장님께서 닦을 것들이 필요하다고 조언을 주셨고, 1층의 의류수거함을
      뒤졌다. 자물쇠가 잠겨있고, 관리실에서도 열 수 없다고 했다. 차를 타고
      집으로 갔고, 재택근무하고 있던 예비 와이프와 함께 오래된 수건 10장을 골라
      현장으로 왔다.
    </p>
    <p>
      사장님들과 바닥을 함께 닦았다. 필름 사장님께서 전날까지 작업했던 타일
      사장님과, 다음 날 예정되어 있는 케라폭시 사장님과 친분이 있었기에 직접
      연락하여 상황을 전달하였고, 나에게 따로 연락을 주셨다. 타일 사장님께서는
      타일 시공에는 전혀 문제가 없을 것이라며 마루가 썩을 수 있으니 제습기를
      준비하라는 조언을 주셨고, 케라폭시 사장님께서는 다음날 현장을 직접 보고
      시공 여부를 판단하겠다고 걱정 말라고 하셨다. 필름 사장님이 함께 있어서 참
      다행이었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/r1gg9ob.jpeg"
      alt="터져버린 거실의 스프링쿨러"
      height={400}
      caption="거실 한켠에서 터져버린 스프링쿨러"
    />
    <p>
      나중에 알고 보니, 천장을 뚫던 드릴이 스프링쿨러에 닿아 열이 전달되었고,
      불이 났다고 판단하여 터진 것이었다. 다행히 정리는 잘 되었다. 스프링쿨러가
      터진 날, 직장 동료들에게 제습기를 세 대 빌려 집을 말렸다. 욕실에 설치한
      휴젠뜨도 제습으로 켜두었다. 도배 사장님의 친 형님께서 목공 작업을
      하시는데, 직접 오셔서 현장을 살펴보고 물에 닿은 곳을 모두 새로 작업하셨다.
      케라폭시 줄눈도 작업이 가능했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/w9cDVEp.jpeg"
      alt="제습기 세 대가 작동 중인 집"
      caption="제습기 세 대가 풀로 돌아가는 현장. 수분 증발을 위해 바닥 보양재도 모두 걷어냈다."
    />
    <p>
      다음날부터는 도배 사장님의 부인께서도 함께 작업을 도와주셨다. 여러 대화를
      나누기도 했고, 우린 결혼 준비를 하고 있다, 우리 딸이 결혼한다는데 보내기
      싫다, 우리 아들은 일찍 결혼했다, 사위가 된다는 놈 죽여버릴거다 등. 그리고
      도배를 가장 열심히 해야했던 날에 폭설이 내렸다. 폭설이 왔음에도 불구하고
      사장님께서는 오전 7시에 현장에 도착하여 작업하셨다. 그렇게 물과 눈이 섞인
      작업의 결과물은 빛이 났다. 참고로, 공용부 벽지는 디아망 PR033-01
      (러스틱회벽 - 화이트), 공용부 천장과 모든 방은 개나리 54160-1로 작업했다.
      디아망 벽지는 직접 고른 벽지이고, 개나리는 사장님께서 추천해주신 벽지였다.
      아주 만족한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/dB9nmE5.jpeg",
        "https://i.imgur.com/OMGLbHn.jpeg",
        "https://i.imgur.com/0Xe08e7.jpeg",
      ]}
      alt={["도배 완료된 집", "도배 완료된 집", "도배 완료된 집"]}
      caption="드디어 옷을 입은 우리 집"
    />
    <p>
      과정이 어려웠기에 결과가 더 만족스러웠다. 작업이 끝나고 결제하려 하니,
      사장님께서는 아직 결제하지 말라고 하셨다. 아랫집에 누수가 있었기에 도배
      작업이 필요했고, 우리 집도 마루에 하자가 생길 수 있었기 때문이다. 한달
      뒤에 아랫집 작업을 할테니, 그 때 상태를 보고 결제해달라고 하셨다. 마음이
      아주 편해지는 결제 방식이었고, 이 이야기를 다른 업자분들께 하니 처리가
      깔끔하시다고 칭찬하셨다. 우리 세대의 아버지 뻘이신 분께서 아들뻘되는
      사람에게 존대말하면서 대응까지 깔끔하게 해주시니 너무 믿음이 갔다.
      사장님께 농담 삼아 말씀드렸지만, 나중에 이사하게 되면 도배 또 해달라고
      했다. 언젠지 모르겠지만, 그때까지 건강하셨으면 좋겠다.
    </p>
  </>
);
