"use client";
import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";
import { SmallTable } from "@/components/entry-detail/small-table";

export const content = (
  <>
    <p>
      2024년 3월, 아버지께서 후지산에 가자고 하셨다. 내일 모레 칠순이신데도
      나보다 체력이 좋으시다. 나중에 후회하지 않게, 아버지가 원하시는 곳은 항상
      함께 가려 한다. 아버지는 이미 후지산에 대해 공부를 많이 하신 모양이었다.
      지난 2월 함께 갔던 홋카이도에서 모두 쓰지 못하고 남은 엔화와 함께 후지산
      등산을 계획했다.
    </p>
    <p>
      후지산은 일본에 있고, 일본은 해외다. 해외 여행을 가기 위해 가장 먼저
      해야할 것은 비행기 티켓 예매이다. 티켓을 예매하기 위해서는 목적지를
      정해야하는데, 후지산 등산로 선택에 따라 목적지가 달라진다. 후지산에는 총
      네 개의 등산로, 요시다 루트, 후지노미야 루트, 스바시리 루트, 고텐바 루트가
      있다. 대부분의 등산객은 요시다 루트로 등산한다. 아마도 도쿄에서 접근성이
      가장 좋기 때문일 것이다. 그렇기 때문에 사람이 모이고, 그에 따라 편의 시설
      (매점이나 화장실)이 가장 많다. 그 다음으로 인기가 좋은 곳은 후지노미야
      루트이다. 가장 높은 곳에서 등산을 시작할 수 있으며, 등산 거리, 등산 시간이
      가장 짧다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/2QmGwgU.jpeg"
      alt="후지산 등산로 지도"
      caption="후지산 등산 공식 홈페이지에서 제공하는 한글 지도"
    />
    <p>
      요시다 루트로 갈지, 후지노미야 루트로 갈지 아버지와 꽤 고민했다. 비교적
      인기가 적은 스바시리 루트와 고텐바 루트는 고민도 안했다. 외국인이 안전하게
      등산하려면 등산객이 어느 정도 있어야 한다고 생각했다. 고민한 결과, 우리는
      후지노미야 루트를 선택했다. 이미 여러번 가본 도쿄보다는, 한번도 가보지
      않은 시즈오카를 통하고 싶었던 내 의지가 반영된 결과이다.
    </p>
    <p>
      시즈오카 공항으로 가는 비행기를 알아보게 되었고, 인천공항에서는 제주항공만
      취급 중인 것으로 파악하였다. 제주항공 홈페이지에 직접 접속하여, 아버지의
      일정과 내 일정, 그리고 가장 중요한 가격을 직접 살펴보며 가장 적합한 날짜를
      정했다. 또한, 7월 초부터 9월까지 일반인의 등산을 허용하는 후지산의 일정도
      고려하였다. 그렇게 8월 11일에 출국하기로 했다.
    </p>
    <SmallTable
      headers={["8월 11일", "8월 12일", "8월 13일"]}
      cells={[["출국 및 등산 준비", "등산 / 하산 및 휴식", "쇼핑 및 입국"]]}
    />
    <p>
      지난 주말, 출국을 일주일 앞두고, 집에 내려가서 아버지와 준비물 검사를
      했다. 후지산 준비물에서 제일 중요한 것은 아이러니하게도 방한이자 방서이다.
      여름에 등산하는 것이기 때문에 땀을 잘 흡수 및 증발시켜야하는 것은
      당연하다. 후지산은 해발 약 3,800m이기 때문에, 방한용품 또한 중요하다.
      그렇기에 등산 가방의 절반은 등산 중 입게 될 플리스와 점퍼로 가득 찬다.
      나머지는 등산에 도움이 될 용품들과 팔토시 같은 방서용품, 그리고
      편의시설에서 사용하기 위한 돈, 신분증 등으로 채워졌다. 특이한 사항으로는,
      유료 화장실을 사용하기 위한 100엔 동전, 주기적인 에너지 보충을 위한
      사탕/과자, 혹시 모를 하산 지연에 따른 랜턴이다. 마지막으로, 현지에서 물
      500mL 페트 네 병을 챙기기 위해 공간을 비워두었다.
    </p>
    <p>
      숙소는 후지노미야 역 바로 앞에 잡아두었다. 6시 35분 버스를 타고 7시 55분에
      후지노미야 5합목에 도착하고, 해발 2,000m의 높이에 10~20분 정도 적응하다가
      등산을 시작할 계획이다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/G8CD1x7.jpeg"
      alt="후지노미야 버스 시간표"
      caption="2024년 후지노미야 - 후지노미야5합목 버스 시간표"
    />
    <p>
      2024년 후지노미야 - 후지노미야5합목 버스 시간표 후지노미야 루트를 따라
      올라가고, 정상에서 휴식을 취하고, 고텐바 루트로 하산 예정이다. 뷰가
      아름답다는 호에이잔에 잠시 오를 것이다. 그리고 다시 후지노미야 루트로
      합류하여 숙소로 돌아가는 것이 목표이다. 지도에 표기된 시간에 따르면, 이동
      시간은 총 440분, 7시간 20분이 소요될 예정이다. 하산하는 마지막 버스가 오후
      7시 출발이니, 그에 맞게 적절히 휴식을 취하면서 무리하지 않게 이동할
      계획이다.
    </p>
    <SmallTable
      headers={["등산", "정상 / 휴식", "하산", "호에이잔 / 휴식", "하산"]}
      cells={[["260분", "30분", "115분", "20분", "65분"]]}
    />
    <ImageInEntry
      src="https://i.imgur.com/cr0IYie.jpeg"
      alt="후지산 등산 경로 계획"
      caption="후지산 등산 경로 계획"
    />
    <p>
      계획한 경로 지난 4월 비행기와 숙소를 예약하고, 한동안 잊고 지냈다. 회사
      일도 바빴고, 개인적으로 신경써야하는 일도 많았다. 다시 정리하며
      준비하다보니, 여행의 설렘이 느껴지기 시작한다. 바쁜 일상에서 잠시 시간을
      내서 벗어나는 만큼, 좋은 날씨에 건강하게 다녀오고 싶다.
    </p>
    <p>참고 자료</p>
    <OgLink
      href="https://www.fujisan-climb.jp/index.html"
      title="후지산 등산 공식 홈페이지"
    />
    <OgLink
      href="https://www.shizuokabus.co.jp/wp-content/uploads/2024/05/2024fujitozanbus-timeE.pdf"
      title="2024년 후지노미야 - 5합목 버스 시간표"
    />
  </>
);
