"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      우리의 마지막 날 일정은 쇼핑이었다. 하루종일 아울렛에서 쇼핑하고, 공항으로
      가는 것이 전부인 날이었다. 다른 날과는 다르게 느즈막히 준비하고 10시에
      숙소에서 나왔다. 목적지는 샌프란시스코 아울렛이었다. 아울렛까지 가면서
      우리는 총 세 군데의 월마트에 들렀다. 마치 일본의 돈키호테나 드럭 스토어에
      들러 원하는 아이템의 물량을 확인하는 듯한 느낌이었다. 각자 사고싶은
      건강보조제가 있었는데, 인기가 많은 제품이었는지 모두 매진이었다. 그래서 세
      군데나 들렀고, 결국 원하는 것을 100% 챙기진 못했다. 어쩔 수 없이 세번째
      월마트 이후에 아울렛으로 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/tQnkmQ1.jpeg"
      alt="미국 여행 마지막 날 드라이브 코스 지도"
      caption="마지막 날의 드라이브 코스"
    />
    <p>
      아울렛에 도착하니, 12시 30분 쯤 되었다. 17시 30분까지 쇼핑을 즐기기로
      약속하고 흩어졌다. 서로 스마트폰을 잘 보자는 약속도 했다. 손에 짐이
      많아지면 기동성이 떨어지기 때문에, 차 키를 받아 차에 짐을 싣기 위함이었다.
      정말 정신 없이 쇼핑했다. 몇 개 기억나는 것들을 설명해보자면. 라코스테
      매장에서는 블루종을 하나 구입했는데, 4년이 지난 지금까지도 잘 입고 있다.
      라코스테가 가장 기억에 남는데, 오래 입은 옷이기도 하지만 이 블루종 자켓이
      40달러였다는 점이다. 내 머릿속에는 이 자켓이 아울렛의 기준이 되어버려, 이
      뒤로는 한국의 아울렛을 잘 가지 않게 되었다. 그리 저렴하지 않기 때문이다.
      등산복 브랜드가 모여있는 매장에서도 후리스를 하나 구매했는데, 내가 입진
      않았지만 당시 룸메이트가 받고 무진장 좋아했던 기억이 남아있다. 이 후리스도
      30달러 미만의 돈으로 구매했던 것으로 기억한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/O749Wyr.jpeg",
        "https://i.imgur.com/oSUxbIg.jpeg",
        "https://i.imgur.com/mhSBB4m.jpeg",
      ]}
      alt={["아울렛에 전시된 옷", "아울렛에 전시된 옷", "아울렛에 전시된 옷"]}
      caption="붙어있는 가격표를 보면 당시 물가를 감안하더라도 무진장 싸다."
    />
    <p>
      7 For All Mankind라는 청바지 브랜드도 처음 방문해봤는데, 가격이나 직원의
      친절함이나 제품이나 모두 만족스러웠다. 그 외에도, 랄프로렌, 아르마니,
      타미힐피거 등 다양한 브랜드에서 쇼핑을 했다. 양손이 가득해지면 차량에
      두고, 다시 돌아와서 쇼핑하기를 반복하며 약 다섯시간을 보냈다. 약속한
      시간이 되고, 차에 모여 트렁크를 열고 짐정리를 시작했다. 각자의 캐리어를
      열고, 새로 산 옷들을 모두 넣었다. 그리고 아쉬운 마음을 안고 공항으로
      향했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/G179t4D.jpeg"
      alt="여행 동료가 양손에 쇼핑백을 들고 있음"
      caption="양손에 쇼핑백을 가득 든 여행 동료"
      height={600}
    />
    <p>
      샌프란시스코 프리미엄 아울렛에서 공항까지 90분 정도 걸렸다. 공항에
      도착해서 7박 8일을 함께 했던 차량을 반납했다. 별 특별한 과정 없이 쉽게
      반납이 됐다. 하지만 차에서 내리면서 동료의 스마트폰이 떨어졌다. 그리고
      아이폰의 액정이 깨졌다. 하지만 우린 여행자 보험이 있다. 여행자 보험을 쓸모
      있게 사용하게 되었으니 오히려 좋은 럭키비키였다. 잠깐 놀랬지만 여행자 보험
      생각에 마음을 가라앉히고, 공항에 들어갔다. 마지막으로 슈퍼두퍼 버거를
      먹으려 했지만, 우리가 들어갈 수 없는 입국장에 매장이 있다고 하여 포기했다.
      공항에 있는 식당에서 미국에서의 마지막 햄버거를 시켰다. 이 버거도
      괜찮았다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/zZTHbu2.jpeg"
      alt="샌프란시스코 공항에서 먹은 햄버거"
      caption="신선해보이는 공항 햄버거"
      height={600}
    />
    <p>
      이제 비행기가 뜨기까지 세시간 정도 남았다. 비행기를 기다리며, 이번 여행에
      대한 이야기, 다음 번에는 어떻게 하면 더 좋겠다는 이야기를 했다. 지금
      생각하면 세시간을 어떻게 흘려보냈는지 기억도 잘 안난다. 공항에 셋이 주르륵
      앉아 멍때렸다가 수다떨다가 그랬다. 한국에 하루에 한명씩 코로나 확진자가
      나오고 있기 때문에 한국이 위험해졌다는 이야기를 했던 기억이 난다. 승객 중
      마스크를 쓰지 않은 사람은 10명 미만일 정도로 미국 여행에 나설 때와 상황이
      많이 달라진 것을 느꼈다. 뭐, 지금 생각하면 웃긴 얘기지만 말이다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/qwWuDFn.jpeg"
      alt="공항 창밖에 보이는 비행기"
      caption="우리가 탈 비행기가 눈에 보였다."
      height={600}
    />
    <p>
      자정에 비행기는 이륙했다. 피곤에 찌들어 잠만 자다가 한국에 도착했다.
      한국에 도착하니 이틀이 지나있었다. 처음 미국에 도착했을 때는 하루 번
      기분이라 좋았는데, 이번에는 하루를 잃었다. 기대했던 여행을 성공적으로
      마무리하고 한국으로 돌아왔다. 다시 차를 타고 각자의 집으로 이동했다.
    </p>
  </>
);
