"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      철거를 마치고 다음날은 시스템 에어컨 배관 설치와 가스 배관 철거를 하는
      날이었다. 시스템 에어컨의 경우 잔금일에 사전방문이 있었고, 에어컨 설치가
      가능하다는 판단 후, 목공 작업 전에 배관 설치 그리고 도배 이후에 실내기를
      설치하기로 했었다. 하지만 이때가 반셀프 인테리어의 첫 번째 고비였다. 배관
      설치 작업자들이 천장 속을 보고, 설치가 불가능하다는 판단을 내렸다. 조금 더
      자세히 말하자면, 설치가 불가능한 것이 아니라, 원하는 위치에 실내기를
      설치할 수 없다는 판단을 내렸다. 대안을 물어보니, 방의 한가운데에 시스템
      에어컨을 설치해야 한다더라. 머릿속으로 잠시 생각해 보니 참 별로였다.
      성능이나, 디자인이나 모두 다 별로였다. 잠시 고민하고 빠르게 시스템
      에어컨을 포기했다. 입주하게 된 집이 꼭대기 층이다 보니 소방 파이프의
      구조로 인해 에어컨 배관 설치를 하기 어렵다는 추측을 하고서 작업자들이
      떠났다.
    </p>
    <p>
      이 날은 에어컨 배관 설치로 채워질 예정이었는데, 설치가 취소되며 빈 날짜가
      되어버렸다. 가스 배관 철거가 있긴 했으나 30분 이내의 짧은 작업이었기에,
      다른 날짜에 진행해도 되는 작업이었다. 하루를 버리게 된 것이 아쉬웠지만,
      시간이 부족한 것보다 훨씬 낫다는 긍정 마인드를 돌렸다. 또, 배관 철거
      사장님께서 편하게 작업하셨을 거다. 그렇게 생각하고 살고 있다. 인덕션을
      사용하기 위해 가스 배관을 철거했는데, 불필요한 배관이 사라져서 매우
      깔끔해졌다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/91pjWSz.jpeg",
        "https://i.imgur.com/LDirETB.jpeg",
      ]}
      alt={["가스배관 철거 전", "가스배관 철거 후"]}
      caption="가스배관 철거 전과 후. 가스배관 철거는 일반 철거와 다르게 그와 관련된 시공 면허가 있어야 작업이 가능하다."
    />
    <p>
      그렇게 하루가 지나가고 다음 날, 목공 작업날이었다. 작업 전 날 시스템
      에어컨을 설치하지 않게 되면서 갑작스럽게 요청 내용이 변경되었다. 하지만
      목공업체에서 잘 챙겨주었다. 작업 내용은, 우물 천장 테두리 메꾸기, 아트월
      및 기타 벽 석고보드, 마이너스 몰딩, 공용부 9미리 문선, 주방 우물천장
      평탄화, 걸레받이였다. 견적서에는 더 많은 내용이 적혀있지만, 비슷한
      내용끼리 묶다 보니 적은 것처럼 보인다. 아침에 현장에 방문하여 작업자분들을
      뵙고 인사드렸다. 커피를 한잔 마시면서 하루 일과를 시작하시는 것으로
      보였다. 옆에서 구경하고 있으니, 커피도 한잔 내려주시고, 자재도 구경시켜
      주었다. 작업자 네 명 간 수다 떠는 내용을 훔쳐들으며 30분 정도 구경하다가
      자리를 떴다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/SchbNZ2.jpeg",
        "https://i.imgur.com/dMpKzle.jpeg",
        "https://i.imgur.com/oMxxyUd.jpeg",
      ]}
      alt={["목공 자재", "목공 자재 및 장비", "목공 자재 및 장비"]}
      caption="자재가 들어오는 첫 공정이다보니, 모든 것들이 신기해보였다. 공사가 끝난지 두달 정도 뒤에 사진을 다시 보니 또 신기하다."
    />
    <p>
      중간에 사정을 구하고 욕실 타일 업체에서 방수 작업자 분이 오셨다. 욕실
      공사를 원활히 지원하기 위해 방수 작업을 미리 하고 싶다며 연락이 왔다. 보통
      공정별 작업자분들께서는 타 공정과 겹치는 것을 반기지 않지만, 작업 구역이
      확실하게 나누어져 있었기에 서로 양해를 구하고 작업을 진행했다. 방수 작업은
      꽤나 금방 끝났다. 약 5시간 정도 걸린 것으로 기억한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/amhKUJz.jpeg",
        "https://i.imgur.com/ymPn14A.jpeg",
      ]}
      alt={["거실 욕실 방수 처리 직후", "안방 욕실 방수 처리 직후"]}
      caption="거실과 안방 각각 욕실 방수 처리 직후. 색감이 매우 이쁘다."
    />
    <p>
      그리고 오후 다섯시 쯤 작업이 완료되었다는 문자가 왔다. 집이 달라져있을
      것이라는 목수님의 텍스트에, 설레는 마음으로 퇴근하자마자 현장으로
      달려갔다. 정말 많은 것이 달라져있었다. 물론, 도배하지 않았기 때문에
      완벽하진 않았지만 골격이 달라져있었다. 우선 문선이 많이 달라졌다.
      공용부에서 바라보는 문선만 작업했기 때문에 방에서 봤을 때와 확연히 달라진
      것을 알 수 있었다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/edy4FDm.jpeg",
        "https://i.imgur.com/UvdZGFT.jpeg",
      ]}
      alt={["매우 작아진 문선", "방에서 본 기존 문선"]}
      caption="매우 작아진 문선과 방에서 본 기존 문선"
    />
    <p>
      그리고 보기 불편했던 거실 아트월과 주방 벽면에 층진 곳을 석고보드로
      메꾸었다. 오래된 디자인처럼 느껴졌던 것들이 사라지니 마음이 편해졌다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/b7YaxkI.jpeg"
      alt="석고보드로 덮은 벽면과 새로 붙인 걸레받이"
      caption="석고보드로 벽면을 덮었다. 벽과 바닥이 만나는 곳에는 걸레받이를 새로 붙였다."
    />
    <p>천장에 마이너스 몰딩도 새로 붙였다.</p>
    <ImageInEntry
      src="https://i.imgur.com/Pz9ZcgO.jpeg"
      alt="천장 마이너스 몰딩"
      caption="마이너스 몰딩"
    />
    <p>
      목공 작업이 마무리된 후, 꽤 많이 후회했다. 목공은 다른 공정과 비교해보면
      가격 대비 달라지는 것이 상당히 많은 공정인데, 돈을 아끼려 노력했던 과거가
      후회됐다. 추후 언급하겠지만, 조금이라도 아끼려다가 더 돈을 쓰게 될뻔한
      상황이 있었는데, 목공업체 사장님께서 양해해주셔서 잘못을 바로잡을 수
      있었던 적도 있다. 역시 뼈대를 제대로 해야 집이 깔끔해지는 법, 목공에 꼭
      많은 투자하시길.
    </p>
    <OgLink
      image="https://blogpfthumb-phinf.pstatic.net/MjAyMTAyMDJfMjU1/MDAxNjEyMjc1ODgzODg0.YelF8bTBJexFXUI1VsYfYi7nbzqhO6ltd7jvCfJDD8cg.4VvnO74M1Qn7ggkM-_2bFI0TFgd-qsWljW6cvbLR0fUg.JPEG.cwu5472/1607773586698%EF%BC%8D23.jpg?type=f204_204"
      title="목공 업체"
      href="https://blog.naver.com/cwu5472"
      description="수원유목수 블로그"
    />
    <OgLink
      href="https://maps.app.goo.gl/o496H7UWoEDhy6yeA"
      title="방수를 진행한 타일 전문 업체 코알라타일"
      description="코알라타일 (KOALATILE)"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
