"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      나는 도쿄에서 아사쿠사를 제일 좋아한다. 2017년 처음으로 도쿄 여행을 갔을
      때, 아사쿠사 방문이 가장 일본스러웠고 저렴한 굿즈를 많이 구입할 수
      있었기에 아사쿠사에 대한 기억이 좋다. 그 이후로 도쿄에 방문할 때마다
      아사쿠사를 무조건 들른다. 2025년 5월 5일, 또 다시 아사쿠사에 방문했다.
      아사쿠사를 마지막으로 여행을 마무리하는 일정이었기에 체크아웃 후 짐이
      많았고, 짐을 맡기기 위해 아사쿠사 역 근방을 돌아다녔다. 모든 락커가 가득
      차 있었다. 아사쿠사 관광센터에 방문하여 락커를 문의하니, 가까운 곳에 유료
      짐 보관소를 소개해주었다. 아마 캐리어 하나 당 400엔 정도 냈던거 같다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/nJR7jcB.jpeg"]}
      alt="아사쿠사 역 근방 락커룸"
      height={350}
      caption="많은 사람이 락커룸에서 실망한 표정으로 나왔다."
    />
    <p>
      사실 아사쿠사를 가면 난 단 하나만 구경한다. 카미나리몬을 지나, 센소지까지
      가는 길에 다양한 굿즈와 일본의 분위기를 느끼는 것이다. 도쿄가 처음인
      와이프에게는 어찌 보면 꽤나 불편한 곳이었을 거다. 나에겐 도쿄 여행의
      추억이 많지만, 와이프가 처음 방문한 이 날에는 사람이 평소보다 두 배 이상
      많았기 때문이다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/QcrTZRg.jpeg"]}
      alt="카미나리몬"
      height={500}
      caption="이 문을 통과하면 아사쿠사 관광의 시작이다."
    />
    <p>
      역시나 사람이 무진장 많았다. 한 걸음마다 사람들 틈을 통과하며 이동했다.
      사람이 그나마 없어보이는 기념품 샵에 들어가서 이것저것 구경하며
      돌아다녔다. 여행의 피로가 가장 많이 쌓인 마지막날이었기에, 집중이 잘 되진
      않았다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/ZKkrS2G.jpeg"]}
      alt="아사쿠사"
      caption="이게 문전성시?"
    />
    <p>
      피로를 이겨내며 어떻게든 구경했다. 한국에 돌아가면, 다른 여행지에 밀려, 또
      오기까지 몇 년이 걸릴지 모르는 관광이다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/nNqFov7.jpeg",
        "https://i.imgur.com/or2yXQv.jpeg",
      ]}
      alt="아사쿠사"
      caption="AI로 사람만 지운다면 정말 멋진 관광지다."
    />
    <p>
      더 이상 버티기 힘들 때, 관광센터 꼭대기에 있는 전망대에 올라갔다.
      전망대에서 아사쿠사를 바라보며 쉴 겸 해서 올라갔다. 네 번째 아사쿠사
      방문이었지만, 여긴 처음이었다. 뻥 뚫린 시야에 감탄하며 잠시 앉아서
      구경했다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/9X8tqBa.jpeg"]}
      alt="아사쿠사"
      caption="내가 저 개미 중에 한 마리였다니"
    />
    <ImageInEntry
      src={["https://i.imgur.com/naABDCG.jpeg"]}
      alt="아사쿠사"
      caption="스카이트리가 가까운 곳에 보인다."
    />
    <p>
      비행기 이륙이 4~5시간 정도 남았을 때, 나리타 공항으로 출발했다. 그 어떤
      여행에서도, 한국으로 돌아가는 비행기를 탈 때는 시간을 넉넉하게 계산하는
      것이 몸에 뱄다. 일찍 도착했기에 가벼운 마음으로 가챠도 몇개 돌려주고,
      편의점 음식도 먹으며 도쿄 여행을 마무리했다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/k9XDTwV.jpeg"]}
      alt="비행기에서"
      caption="안녕히 계세요."
    />
    <p>
      이번 여행에서는 도쿄에서의 추억이 업그레이드 되었다. 그동안 나에게 도쿄를
      표현하라면, 대표적인 두 스팟으로 신주쿠와 아사쿠사를 말했다. 이제는 한 두
      개로 표현하지 못할거 같다. 산과 사찰, 작은 도시로 구성된 가마쿠라와, 도쿄
      안의 꿈 같은 마을 닛포리까지 알게 되었다. (가마쿠라는 도쿄가 아니긴 하다.)
      언제 다시 도쿄에 갈까? 갈 때마다 새로운 곳을 알게 되는 도쿄 여행이,
      계획하지 않았지만 기다려진다.
    </p>
  </>
);
