"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      미국 서부 여행을 꿈꾸기 시작하면서 간략한 계획을 짜봤다. 가고 싶은
      지역들을 리스트업하고, 내 현실적인 휴가 가능 일정과 함께 고민해봤다.
      절대로 뺄 수 없는 곳은 우선 샌프란시스코였다. 내가 미국에 다시 가고 싶었던
      그 이유 자체이기 때문이다. 이제 남은 후보지는 로스앤젤레스, 라스베가스,
      그랜드캐니언, 샌디에고 정도였다. 조직장과 논의해보니, 내가 현실적으로
      여행갈 수 있는 일정은 7박 8일이었다. 이동 시간을 고려했을 때,
      샌프란시스코와 어느정도 거리가 가까워야했다. 그렇게, 자연스럽게
      로스앤젤레스를 선택하게 되었고, 샌프란시스코와 로스앤젤레스를 함께
      여행하게 되었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/j6drk91.jpeg"
      alt="구글 지도에 마킹한 여행 계획"
      caption="구글 맵에 가고 싶은 곳을 찍어두고 코스를 계획하기 시작했다. 별표와 하트는 별 의미 없다."
    />
    <p>
      여행 책자, 구글 맵, 각종 블로그를 훑어보며 내가 가고싶은 곳들을 찍었다.
      자연스럽게 로스앤젤레스 주변의 조슈아트리 국립공원을 알게 되고, 조슈아트리
      국립공원이 있는 휴양도시 팜스프링스, 서쪽 바다를 잇는 1번 국도, 1번 국도에
      있는 솔뱅, 몬터레이와 같은 도시들. 자연스럽게 학습하게 되었다. 내가 1차로
      계획을 짜고, 함께 갈 여행 동료들의 피드백을 받고, 수정하고, 과정을
      반복하며 동선을 짰다. 그렇게 짜여진 동선은 다음과 같다. [인천 공항] →
      [로스앤젤레스] → [팜스프링스] → [로스앤젤레스] → [1번국도] →
      [샌프란시스코] → [요세미티 국립 공원] → [샌프란시스코] → [인천 공항]. 7박
      8일의 일정에 딱 맞고 알차게 보낼 수 있는 최적의 계획과 동선이라 생각하고,
      우리는 여행을 시작했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/aWW49wc.jpeg"
      alt="조슈아트리 국립공원"
      caption="2020년의 조슈아트리 국립공원"
    />
    <ImageInEntry
      src="https://i.imgur.com/ASsDxFE.jpeg"
      alt="그리피스 천문대"
      caption="2020년의 그리피스 천문대"
    />
    <ImageInEntry
      src="https://i.imgur.com/0O8brdV.jpeg"
      alt="소살리토"
      caption="2020년의 소살리토"
    />
    <p>
      이 글을 쓰고 있는 2024년 9월에 생각하기에도 최적의 시기, 최고의
      계획이었다. 코로나로 인해 하늘 길이 봉쇄되기 직전이었기에 최적의 시기,
      동행했던 동료들의 후기와 내 기억에 따라 최고의 계획이라 판단한다. 지금도
      종종 뜨는 내 스마트폰의 구글 포토 푸시 알림은 4년하고도 7개월 전의 이 여행
      사진을 나에게 보여준다. 최근 가고 싶어도 가기 힘들었던 환율을 생각하면,
      1,160원 정도였던 그 당시 환율이 종종 떠오른다. 2026년에는 조금이라도
      환율이 더 내려가길 바라며, 4년 전의 여행을 기록해본다.
    </p>
  </>
);
