"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      2022년 9월 18일, 새벽 4시 쯤 모두 일어났다. 짐을 싸고 체크아웃 후 이동해야
      했기 때문이다. 각자 캐리어 한 대씩 끌고 밀라노 첸트랄레 역으로 이동했다.
      난 역 앞에서 말펜사 공항으로 가는 버스 티켓을 구매했고, 나머지 가족들과
      작별 인사했다. 부모님과 누나, 조카는 첸트랄레 역에서 가리발디 역으로
      이동하여 TGV를 타고 파리로 갔다. 캐리어를 버스 트렁크에 넣고 자리에
      앉았다. 짐을 누군가가 훔칠 수 있다는 생각에 긴장하고 있었지만, 피곤해서
      어느샌가 긴장이 풀려버렸다. 구글 맵을 보며 이동했는데, 게임에서만 봤던 산
      시로 경기장이 멀리 보였다. 촬영하고 싶었지만, 반대편 창가에 보였기에
      자제했다. 한 시간정도 지나니 공항에 도착했다. 빠르게 내려 내 캐리어가 잘
      있는지 확인하고, 짐을 챙겨 공항 내부로 이동했다.
    </p>
    <p>
      공항에 들어가자마자, FTA 관세 환급을 받으러 키오스크로 이동했다. AMEX
      카드는 환급이 어렵다는 이야기를 듣고 겁먹었지만, 아무 불편함 없이 환급을
      신청하고 마무리했다. 체크인 후 출국장으로 들어갔다. 남은 유로화 현금과
      신용카드를 이용해서 선물용도로 초콜렛을 구입했다. 페레로 로쉐였는데, 큰
      가나초코렛 같이 생긴 제품이었다. 나중에 한국에서 지인들과 먹어보니, 맛은
      우리가 흔히 아는 페레로 로쉐와 똑같았다. 늘 그렇듯, 공항에서 지루한 시간을
      보내다가 비행기에 탑승했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/N2N9Bva.jpeg",
        "https://i.imgur.com/IhZjIPc.png",
      ]}
      alt="공항"
      caption="맨체스터 시티의 메인 스폰서답게 비행기가 맨시티로 도배되어 있는 에티하드 항공"
    />
    <p>
      옆자리에 꽤나 덩치가 컸던 아랍 남성 때문에 자리가 조금은 불편했던 기억이
      있다. 불편하지만, 그렇게 몇 시간을 날아 아부다비에 도착했다. 아부다비
      공항에서도 지루한 시간을 보내다가 비행기에 탑승했고, 이번에는 운이 좋게
      비행기의 제일 뒷편에 타게 되어 의자를 제일 뒤로 눕히고 편하게 자면서 갈 수
      있었다. 누워서 이동하니, 시간이 정말 금방 갔다. 인천에 도착하여, 공항
      버스를 타고 집에 갔다. 당시에는 해외 여행을 다녀오면, 며칠 이내에 코로나
      검사를 해야 하는 규정이 있었기에, 잠시 쉬고 보건소에 다녀왔다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/hxELkaa.jpeg"]}
      alt="차량 창문"
      caption="보건소로 다녀오는 길에 한국의 분위기가 정겹고 신기하게 느껴져서 촬영했다."
    />
    <p>
      죽기 직전에도 생각날 것 같은 여행이었다. 부모님과 함께 했다는 점에서 더
      뜻깊은 여행이었다. 이 여행을 마치고 사흘 정도는 부모님 생각이 날 때마다
      눈물을 펑펑 흘렸다. 연세가 드셨다는 점이 슬프기도 했고, 함께 했던 시간이
      끝난 것에 아쉽기도 한 심정 때문이었다. 무튼, 이 추억을 잊지 않겠지만,
      조금씩은 희미해질 것이다. 이미 3년이 지나 조금 희미해졌지만, 더 색이
      바래기 전에 기록을 남겨 다행이다. 이탈리아 여행에서 좋았던 것들을 남겨보려
      한다.
    </p>
    <p>
      우선, 이탈리아에 대해 누구나 말하는 역사다. 역사가 길기도 하지만, 그렇게
      따지면 우리나라도 반만년 역사를 갖고 있다. 이탈리아는 옛 것을 고수한다.
      기념비적인 것들을 지킬 뿐 아니라, 오래된 모든 것들을 지킨다. 머물렀던
      숙소들 대부분이 몇 십년 이상 된 것들이고, 백 년 이상 된 건물도 매우 많다.
      그런 것들이 좋았다. 그리고 그걸 고이 모시는 것이 아니라, 생활 속에 둔 것이
      좋았다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/s35vear.png"]}
      alt="로마"
      caption="이탈리아 첫날 본 건물은 모두 백년 이상 되었을 것이다. 아님 말고."
    />
    <p>
      그리고, 알프스의 대자연이다. 대부분의 사람들은 알프스라고 하면 스위스를
      떠올린다. 그리고 물가가 매우 비싼 나라라고 생각한다. 하지만 알프스 산맥은
      꽤 많은 나라가 붙어 있고, 그 중 이탈리아는 다양한 케이블카와 주변 도시로
      인해 좋은 여행을 할 수 있다. 무튼, 이탈리아의 도시에서 머무르며 알프스의
      대자연을 느낄 수 있는 것은 엄청난 장점이다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/n7QiaIG.jpeg"]}
      alt="케이블카 뷰"
      caption="케이블 카에서 본 이탈리아의 도시 코르티나 담페초"
    />
    <p>
      언젠가 이탈리아에 꼭 다시 가려 한다. 특히나 어머니가 좋아하셨기에,
      어머니를 모시고 가고 싶다. 우리 가족은 이때의 기억이 너무 좋았기에, 2025년
      추석 연휴에 캐나다에 다녀오기로 했다. 알프스 산맥 대신 로키 산맥을 보고,
      로마와 밀라노 대신 캘거리와 밴쿠버를 볼 예정이다. 언젠가 다시 갈 수 있기를
      희망하며.
    </p>
  </>
);
