"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      2016년 2월, 한 연구실에서 학부생 연구원으로서 연구를 하던 시절, 갑작스럽게
      샌프란시스코 출장이 잡혔다. 해외로 나가본 것은, 여섯 살 무렵, 어머니와
      누나의 손을 잡고 로스앤젤레스 여행을 다녀온 것이 전부였다. 설레면서 두려운
      감정을 갖고 갔던 미국 출장은, 미국병과 설렘을 갖고 돌아왔다. 3박 5일이라는
      매우 짧은 일정이었음에도 불구하고, 눈 앞에 펼쳐진 미국의 광경에 대한
      그리움이 병이 되었고, 언젠가는 내 돈과 내 시간을 들여 미국을 다녀올
      것이라는 꿈과 설렘을 갖고 살아왔다. 아마도, 이때 3박으로 미국을 다녀온
      것이 너무나 아쉬웠기에, 미국에 대한 동경이 더 커진 것이 아닌가 싶다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/wmS5D9f.jpeg",
        "https://i.imgur.com/6UUVUnK.jpeg",
      ]}
      alt={["샌프란시스코의 광장", "롬바드 길"]}
      caption="2016년 방문했던 샌프란시스코"
    />
    <p>
      물론 3박 5일이 관광이 아니었다. 출장이었기 때문에, 오후 4시정도까지는
      진짜로 일을 했다. 출장의 목적이 미국의 실감미디어를 보고 사용자를
      인터뷰하는 것이었다. 나는 수능 영어 출신이기에, 프리토킹이 되는 동료
      연구원들의 도움을 받으며 일했었다. 그리고 남는 시간에는 함께 출장 온
      샌프란시스코에서 수 년간 일하셨던 교수님의 리드로 샌프란시스코의 다양한
      랜드마크들을 구경하고 다녔다. 난 샌프란시스코에 대해 하나도 모르는
      사람이었기에, 그냥 따라다니면서 고개만 끄덕였다. 나중에 알고보니
      국제적으로 유명한 랜드마크들이더라. 금문교, 롬바드길, 피셔맨스 워프, 피어
      39.
    </p>
    <p>
      2019년 4월, "내년 2월 설 연휴와 그 이후에 맞춰 미국 여행을 다녀오겠다"고
      회사에 선언한 뒤, 함께 여행에 참여할 사람과 돈을 모으기 시작했다. 함께
      여행할 사람의 기준은 딱 두 가지였다. 첫번째는, 당연히 나와 여행할 만한
      사람이어야 한다는 것이었고, 두번째는 운전 가능자였다. 단순히 운전 면허가
      있는 것이 아닌, 어느 정도 운전을 즐기고 경험이 많은 사람을 의미하는
      것이다. 그 이유는, 미국을 편히 여행하기 위한 가장 좋은 교통 수단이
      렌트카이기 때문이고, 또한 나는 차도 없고 심지어 면허도 없는 뚜벅이 중
      뚜벅이였기 때문이다. 여행 자금 (+ 쇼핑 자금)을 위해 한 달에 50만원씩 저축
      계획을 짰다. 일렀지만, 여행 계획을 짜기 시작했다. 캘리포니아를 그리기
      시작했다. 나는 전반적인 계획을 짜고, 11월부터는 매주 월요일마다 30분씩
      온라인 음성 회의를 통해 계획의 틀에 살을 붙이기 시작했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/0NggoYT.jpeg"
      alt="금문교"
      caption="2020년에 다녀온 샌프란시스코"
    />
    <p>
      2020년 1월, 그렇게 나는 미국에 다녀왔다. 그럼에도 미국에 대한 동경은
      해소되지 않았다. 그리고 여자친구와 신혼여행지를 논의하다가 또 다시 미국에
      가게 되었다. 아직 많이 남긴 했지만, 2026년 1월에 미국에 다시 방문하게
      되었다. 2026년을 계획하며, 2020년을 뒤돌아보면서 늦었지만 여행을
      기록해보려 한다.
    </p>
  </>
);
