"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      우리 가족은 2025년의 추석 연휴에 기회를 잘 봐서 장기 여행을 가기로 했다.
      주 결정권은 아버지께 있기에, 난 내가 희망하는 곳을 제안했다. 그 결과
      후보지는, 아이슬란드, 아르헨티나, 동유럽, 뉴질랜드, 그리고 캐나다였다. 주
      결정자가 아버지지만, 난 참모답게 각 후보지 별로 단점을 고려하여 얘기했다.
      웬만해서는 다 뇌피셜이다. 아르헨티나는 치안이 좋지 않고, 시설이 낙후되어
      60/70대 부모님을 내가 계속 신경쓸 거 같다는 걱정이 된다고 했다. 뉴질랜드는
      우핸들이 무섭다고 했다. 아이슬란드는 여행하기 불편할거 같다고 했다. 그래서
      동유럽이나 캐나다를 가자고 제안했다. 근데 유로 환율을 보니, 캐나다를
      가야만 했다. 물론 캐나다 달러도 오르긴 했지만, 1달러, 1유로 등 1단위가
      한화로 더 싼 것이 더 저렴하게 느껴졌다. 그 당시 1캐나다 달러는 1,000원,
      1유로는 1,670원 정도였다. 아버지를 열심히 설득했고, 캐나다 로키 산맥을
      가기로 했다. 그렇게 2025년 9월 28일, 부모님과 함께 셋이서 캘거리행
      비행기를 탔다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/bZV0vdH.jpeg"]}
      alt="인천국제공항"
      caption="역시 카메라로 찍으면 깊이가 다르다."
    />
    <p>
      시작부터 순탄치 않았다. 공항에 도착할 때 쯤 되니, 세 시간 연착이랜다.
      하지만 체크인은 기존과 같은 시간에 하니, 늦지 말랜다. 연착의 이유는,
      항공사 직원들이 노동법 상 필수 휴게시간을 지켜야 하기 때문이랜다. 근로
      시간은 다 계산이 될텐데, 왜 그랬을까.. 다행히도 여행에 대한 설렘과
      기대감으로 인해 스트레스를 받진 않았다. 웨스트젯 항공사에서는 연착에 대한
      보상으로 1인당 2만원 정도의 쿠폰을 제공했다. 우린 이 쿠폰으로 여행 중 먹을
      빵과 캔디를 구입했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/zmHYbqH.jpeg",
        "https://i.imgur.com/UHexvkF.jpeg",
        "https://i.imgur.com/xdxW4eL.jpeg",
      ]}
      alt="비행기"
      caption="연착으로 인해 기사님이 빨리 달리셨다."
    />
    <p>
      약 10시간의 비행 끝에 캐나다 캘거리에 도착했다. 연착으로 인해 조금은 늦은
      시간에 도착했다. 착륙이 오후 6시 30분이었고, 한 시간의 절차를 거쳐
      바깥으로 나와 버스를 타고 숙소로 이동했다. 8시 30분이 돼서야 짐을 풀고
      매트리스에 누웠다. 배가 출출해서 어머니와 둘이서 피자집에 방문했다. 구글
      맵을 통해 장사 중인 것을 확인했는데, 문이 잠겨있었다. 안에 있던 직원이
      우릴 보더니 문을 열어줬다. 위험하기 때문에 문을 잠궈놓고 장사한댄다. 조각
      피자를 숙소로 사와 끼니를 떼우고 바로 잠들었다. 내가 먹은 피자 워스트 3
      안에 들 정도로 맛이 없었다. 맛이 우웩이 아니라, 무맛이었다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/0dKbFk3.jpeg",
        "https://i.imgur.com/Z0O3Dwv.jpeg",
      ]}
      alt="피자와 호텔"
      caption="캐나다에 머무를 18박 일정 중 가장 좋은 숙소"
    />
    <p>
      첫날이라 시차 때문인지, 일찍 자서인지, 눈이 일찍 떠졌다. 아마도 4~5시에는
      깬 것으로 기억한다. 나만 그런게 아니고, 부모님도 일찍 일어나셨다. 호텔
      레스토랑에서 조식을 먹고, 캘거리 구경에 나섰다. 이른 아침이기도 하고,
      캘거리가 관광 도시가 아니기에, 딱히 볼 것은 없었다. 외국 도시, 캐나다의 한
      도시 여행이라 생각하며 돌아다녔다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/YA3ZeVC.jpeg"]}
      alt="호텔에서 본 뷰"
      caption="높은 층이 아니었음에도 뷰가 좋았다."
    />
    <p>
      약에 취해 잠에 빠졌거나, 좀비가 된 노숙자도 종종 보였다. 물론 가까이 가진
      않고, 눈도 마주치지 않았다. 요즘 미주에 마약이 그리 문제라던데, 그 현장을
      내 눈으로 직접 봤다. 이곳 저곳 걸어다녔다. 카메라에 담으면 이쁠만한 것이
      보이면, 촬영했다. 지난 도쿄 여행에 고프로를 가져갔었는데, 고프로로
      동영상은 안 찍고 사진만 찍는 나 자신을 보고, 미러리스 카메라를 구입했다.
      멋진걸 보면 동영상보다 사진으로 남기고 싶은 생각이 더 많이 들었던거 같다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/KJDcoi7.jpeg",
        "https://i.imgur.com/rcH6Lqn.jpeg",
      ]}
      alt="캘거리"
      caption="창문이 깨진 차량과 이쁜 우체통이 공존하는 캘거리 도심"
    />
    <ImageInEntry
      src={["https://i.imgur.com/BAZPG7I.jpeg"]}
      alt="전차"
      caption="캘거리의 유일한 랜드마크인 캘거리 타워"
    />
    <p>
      숙소에 들러 체크아웃 후, 캠핑카 업체와 약속된 장소로 이동했다. 업체의 셔틀
      버스에 탑승하기 위함이다. 약속 시간보다 조금 일렀기에, 부모님께 캐리어를
      맡기고 기념품 샵에 들렀다. 여행지에서는 항상 마그넷을 구입하는데, 캘거리
      마그넷은 이때가 마지막 기회였기 때문이다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/5OCtRJW.jpeg"]}
      height={400}
      alt="전차"
      caption="처음엔 웃기고 신기했지만, 점점 적응되는 표현"
    />
    <p>
      약속 시간이 되어도 셔틀은 오지 않았다. 업체에 전화해서, 내 이름과 버스가
      오지 않는다고 얘기하니, 중국집과 비슷한 답변을 들었다. 지금 생각해보니, 내
      영어 발음과 표현이 좋지 않았을텐데 전화로 정상적인 커뮤니케이션이 된걸
      보아, 캐나다는 대화가 잘 통하는 나라였던거 같다. 셔틀이 왔고, 30분을
      이동해 업체에 도착했다. 참고로, 캠핑카는 콩글리시다. RV (Recreational
      Vehicle)라는 용어를 사용하더라.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/ueXcOxC.jpeg"]}
      alt="표지판"
      caption="여기서 사진을 찍으시오."
    />
    <p>
      카운터에서 예약을 확인하고, 보증금을 결제했다. 직원이 캠핑카의 하나하나를
      설명해줬다. 한 10분정도 설명했을까? 영어를 계속 듣다보니 집중력이
      떨어졌는지 뒤로 갈수록 더 안 들렸다. 그래도 다행히 우리 같은 사람이
      많은지, 유튜브에 업로드된 가이드 영상을 보라며 QR코드를 줬다. 아버지와
      함께 한 문장 단위로 유튜브 영상을 보며 캠핑카를 공부했다. 캠핑카 업체에서
      두 시간을 넘게 있었다. 그 당시에는 몰랐지만, 캠핑카 공부에 빠졌었나보다.
    </p>
    <p>
      먼저 차를 몰고 코스트코로 이동했다. 캠핑카에서 14박이 예정되어 있었기에,
      먹고 싶은 식자재는 마음 편히 구입했다. 한국에서도 코스트코를 가면 양이
      너무 많아 구입이 어려웠는데, 오히려 캠핑 예정인 우리에게는 구입을 선택하기
      쉬웠다. 코스트코의 핫도그까지 먹어준 뒤, 첫 캠핑 장소로 이동했다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/FKDoaUL.jpeg"]}
      height={400}
      alt="운전 뷰"
      caption="저기 보이는 것이 로키 산맥의 일부인가?"
    />
    <p>
      첫 운전은 아버지께서 하셨다. 어릴 적부터 아버지께서 운전하는 모습을 보면,
      절대로 졸음 운전을 하신 적이 없다. 조수석, 뒷좌석에 탄 모두가 잠에 들어도,
      아버지는 꿋꿋이 운전하셨다. 난 성인이 되고 난 뒤, 운전을 하면서 조수석에
      앉은 조수의 예절에 대해 터득했다. 절대로 조수는 잠에 들면 안되고, 함께
      지도를 보며 길을 봐야했다. 근데 이 날은 쉽지 않았다. 난 목이 꺾이면서 잠에
      들었고, 버틸 수가 없었다. 차가 점점 느려지며 멈추는 느낌을 받으며 잠에서
      깼다. 어떤 호수 앞에 아버지가 차를 세우셨다. 너무 졸려 죽을 수도 있겠다는
      생각에 휴식을 선택하셨다. 그때부터 잠에서 깨어, 바깥 창문을 보며
      캠핑그라운드로 이동했다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/ZgycjOh.jpeg"]}
      height={500}
      alt="캠핑카"
      caption="거의 처음이자 마지막으로 편 차양막"
    />
    <p>
      캠핑그라운드에서 처음으로 캠핑카를 주차했다. 어머니께서 저녁 식사를
      준비하시고, 난 캠핑장의 시설을 보고 왔다. 캠핑카에 적응하지 못해서였는지,
      수면 부족이었는지, 이 좁아 터진 캠핑카에서 열 네 밤을 자야 한다는 것에
      갑작스러운 스트레스를 받았다. 한껏 예민해진 상태로, 식사 후 잠에 들었다.
      오늘은 로키 산맥에 도착만 했고, 내일부터는 진짜로 로키 산맥을 느낄 수
      있으리라는 기대감으로 잠에 들었다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/yZkh4ba.jpeg"]}
      height={350}
      alt="화장실"
      caption="생각보다 너무 깔끔했던 화장실 겸 샤워장"
    />
    <OgLink
      href="https://maps.app.goo.gl/WukkyZqMbu7aAFQw6"
      title="캘거리 숙소"
      description="Homewood Suites by Hilton Calgary Downtown"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/G3uT5RcXtYnakoga8"
      title="캠핑카 업체"
      description="Fraserway RV Calgary (Airdrie)"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/i5EaaF1QsZqDN2ui6"
      title="캠핑장"
      description="Tunnel Mountain Trailer Court"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
