"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      하나의 글로 작성하기에는 어려울 정도로 작은 공정이지만 절대로 빼먹어서는
      안되는 작업이 있다. 우선 첫번째는 케라폭시다. 케라폭시를 편하게 말한다면,
      이쁘고 오래가는 줄눈이라 표현할 수 있을 것 같다. 다른 줄눈에 비해 작업은
      까다롭기에 시공비도 더욱 비싸다. 자세히 말하기 어렵지만, 아마 일반 줄눈의
      4~5배 정도이다. 일반 줄눈은 손재주 좋은 일반인들이 직접 작업하는 반면,
      케라폭시는 전문가만이 할 수 있다. 재료 관리와 시공 자체가 어렵기 때문이다.
    </p>
    <p>
      작업은 두 욕실과 주방의 바닥 및 옆면 타일을 작업하는데 4~5시간 정도
      걸렸다. 당일 사장님이 방문하시고 여러가지 줄눈의 색상을 보여준다. 샘플을
      통해 타일 옆에 맞춰보고, 논의하여 색상을 골랐다. 공간마다 타일 색상이
      달랐기에, 줄눈의 색상도 조금씩 다르게 했다. 사실 우리집 같은 타일을
      선택했다면 케라폭시 외에는 선택지가 없긴 하다. 어두운 타일 색을 골랐는데,
      거기에 흰색 일반적인 줄눈 시공을 한다면 퀄리티가 확 낮아보이기 때문이다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/HzvR8r1.jpeg",
        "https://i.imgur.com/pZY00hm.jpeg",
      ]}
      alt={["케라폭시 색상표", "케라폭시 색상표"]}
      caption="Mepei사에서 판매하는 케라폭시 색상들 (공식 홈페이지)"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/J1e6KJo.jpeg",
        "https://i.imgur.com/9yiOSIB.jpeg",
        "https://i.imgur.com/XkCgMx6.jpeg",
      ]}
      alt={[
        "케라폭시 작업이 완료된 욕실",
        "케라폭시 작업이 완료된 욕실",
        "케라폭시 작업이 완료된 주방",
      ]}
      caption="타일과 전혀 이질감 없는 케라폭시 줄눈. 마치 타일과 한몸인 듯 하다."
    />
    <p>
      두번째는 탄성이다. 탄성코트는 우리가 자주 가지 않는 공간일 수 있는 발코니,
      대피공간 등을 새것으로 만들어준다. 물론 외적인 요소도 있지만, 곰팡이
      제거나 단열에도 좋은 영향을 미친다고 한다. 그리고 가격도 매우 저렴했기에
      부담 없이 작업을 진행했다. 우리 집은 탄성코트를 칠해야 하는 공간이 네
      군데나 있기에, 가격을 10만원 더 올려서 작업했다. (일반적인 가구에는 세
      곳이 있다고 한다.) 사장님께서 방문해서 작업하셨고, 4시간만에 빠르게
      끝났다. 얼굴도 못뵙고, 작업 후 결제로 마무리됐다. 비포 앤 애프터를 보면
      차이가 극명하게 보이지만, 과거의 그 더러웠던 발코니를 이미지로 담기
      싫었는지 구글 드라이브에서 찾지 못했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/gf1HVYU.jpeg",
        "https://i.imgur.com/2DGI456.jpeg",
        "https://i.imgur.com/5Ct2505.jpeg",
      ]}
      alt={[
        "탄성코트 시공 완료된 발코니",
        "탄성코트 시공 완료된 발코니",
        "탄성코트 시공 완료된 발코니",
      ]}
      caption="작업이 완료된 공간"
    />
    <p>
      비교적 작은 공정이지만 만족도는 매우 높았던 작업들이다. 누군가는 이 작업에
      왜 돈을 들이냐고 비난할 수도 있지만, 이 작업들로 인해 우리 집이 더욱 살고
      싶은 집이 되는 것이 아닌가 싶다.
    </p>
  </>
);
