"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";
import { SmallTable } from "@/components/entry-detail/small-table";

export const content = (
  <>
    <p>
      최근 무진장 바빴다. 언젠가부터 2024년 말에는 내 집을 갖겠다는 목표로
      살아왔다. 2024년 7월, 슬슬 집을 알아보겠다는 생각으로 임장을 다니다가 한
      집에 꽂혀버렸다. 내 목표 금액보다 조금 더 비싼 집이었지만, 이미 마음을
      홀려버렸기에 바로 계약했다. 그렇게 내 인생 최초의 집을 갖게 되었다. 예산을
      조금 벗어났기에 최대한 절약할 수 있는 방법을 고민해보다가 직장 동료의
      추천으로 반셀프 인테리어를 진행하게 되었다. 매우 간단하게 설명하자면
      반셀프 인테리어란, 인테리어 업체의 역할을 내가 하는 것이다. 일정 관리,
      업체 선정, 민원 관리 등. 인테리어 업체에 보수를 주지 않기 때문에 돈을 더
      아낄 수 있다는 장점 하나만으로, 반셀프 인테리어를 선택했다. 7월 초에
      계약했고, 11월 초에 거래였기에 약 4개월 간의 기간이 있었다. 아니,
      실력있기로 유명한 시공업체를 선점 섭외하기 위해서는 1~2개월 정도의 시간이
      있었다. 그렇게 나는 하고 싶은 공정과 그에 따른 일정을 짰다. 지금은 매우
      짧게 작성하지만, 3~4주간 매일 퇴근 후 공부한 결과이다.
    </p>
    <SmallTable
      headers={[
        "잔금 전",
        "1일",
        "1일",
        "1~2일",
        "5일",
        "1일",
        "4일",
        "0.5일",
        "0.5일",
        "1.5일",
      ]}
      cells={[
        [
          "동의서",
          "보양",
          "철거",
          "목공",
          "타일",
          "필름",
          "전기/도배",
          "줄눈",
          "탄성",
          "싱크대\n붙박이 설치",
        ],
      ]}
    />
    <p>
      그렇게 8월 내에 실력 좋기로 소문난 시공업체를 예약했다. 지인의 인테리어
      공사에서 한번 검증받은 분들을 계약하는 것이 마음이 편했기에, 직장 동료의
      라인업과 80% 정도 같게 했다. 일정 중 빠진 내용은, 샷시와 단열, 마루 정도가
      있다. 2011년 준공인 집이다보니, 샷시와 단열은 불필요하다고 판단했고,
      마루는 꽤 깔끔하게 되어 있었기에 돈과 시간을 아끼자는 차원에서 진행하지
      않았다.
    </p>
    <p>
      공사가 시작되는 11월이 될 때까지 계속 걱정했다. 잘 될까? 내가 잘 해낼 수
      있을까? 결론은 잘 해냈다. 그 당시 날 가장 걱정 시킨 것은 세 가지였다.
      우선, 일정에 차질 없이 잘 진행될 수 있을지 여부였다. 공사를 하다보면,
      예상치 못한 문제가 발생하게 되고, 그에 따라 일정에 변동이 생긴다.
      결론적으로 문제는 없었다. 예상치 못한 문제는 발생했지만, 일정을 잡을 때
      이런 상황을 대비하여 여유를 꽤 두었기 때문에 문제 없이 잘 진행했다.
      두번째는, 예상치 못한 문제에 잘 대응할 수 있을지 여부였다. 언급한대로,
      예상치 못한 문제가 발생하고 그에 대해 나는 빠르게 결정을 해야 한다. 이것도
      문제 없이 잘 지나갔다. 종종 문제가 발생했지만, 빠르게 결정했고 현재도 후회
      없는 선택이었다. 마지막 세번째는, 직장 일과 공사 관리를 잘 병행할 수
      있을지에 대한 걱정이었다. 잘 병행했지만, 물론 엄청나게 힘들었다. 운이 안
      좋게, 직장 생활 중 가장 바쁜 프로젝트가 진행되었고, 그 중 인테리어 공사도
      진행했다. 인과관계가 확실하진 않지만, 그 당시 무리했던 스트레스로 인해
      현재 허리와 다리에 부상이 있어 운동도 못하고 병원에 다니고 있다. 공사가
      끝난지 한 달 이상이 지난 지금에도 말이다.
    </p>
    <p>
      그렇게 11월이 되었고, 일정이 시작되었다. 아파트마다 규칙이 다르겠지만,
      우리 단지는 공사하는 동의 50% 이상 가구에서 동의서에 서명을 받아야 한다.
      세 가구씩 15층이므로, 총 45가구였기에 23가구 이상의 서명이 필요했다. 내가
      직접 서명을 받을 수 있었지만, 주변에서 말렸다. 내가 방문 시, 나를 인테리어
      업자로 생각할 것이고, 인테리어 업자를 대하는 입주민들의 눈빛과 태도가 많이
      불편할 수 있다는 것이었다. 그렇게 동의서도 업체를 통해 진행하기로
      결정했고, 여러 종류의 업체와 협업하는 타일업체 사장님께 추천을 받아
      진행하였다. 남겨둘 업체 홈페이지에도 금액이 적혀있지만, 30가구 이하였기
      때문에 12만원에 진행했다. 공사 시작하기 일주일 전에 작업해주셨고, 그에
      대한 증빙 사진들도 전달되었다. 각 집마다 방문 후, 부재중이라면 안내
      쪽지문을 남겨두었다. 그리고 승강기와 관리사무소 앞 게시판에 공사 안내문을
      부착하였다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/Dok4ZAt.jpeg",
        "https://i.imgur.com/fwDWK5i.jpeg",
        "https://i.imgur.com/OBbw6id.jpeg",
      ]}
      alt={[
        "공사 안내문이 붙은 아랫집 현관문",
        "공사 안내문이 붙은 관리사무실",
        "공사 안내문",
      ]}
      caption="동의서, 공사 안내문 등 공사의 시작을 알리는 각종 작업"
    />
    <p>
      2024년 11월 8일, 오전에 잔금을 치루고 오후부터 보양 작업을 시작했다. 마루
      공사는 진행하지 않기 때문에 바닥 보호를 위해 모든 구역에 바닥 보양을
      진행했다. 또한, 각종 자재가 이동하는 루트를 모두 보양했다. 지하주차장에서
      우리 집까지 이동하는 복도와 승강기를 보양했다. 현관문이 상할 수 있다는
      타일 사장님의 조언을 듣고, 현관문 안쪽까지 가볍게 보양을 마쳤다. 동의서
      작업을 진행한 업체에서 보양도 작업하였다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/zAYax3P.jpeg",
        "https://i.imgur.com/aaCfR98.jpeg",
      ]}
      alt={["보양 작업 전 거실", "보양 작업 후 거실"]}
      caption="보양 전과 보양 후의 거실"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/z0EAhuc.jpeg",
        "https://i.imgur.com/g1ncMxe.jpeg",
        "https://i.imgur.com/0fwrsNi.jpeg",
      ]}
      alt={["현관 보양", "승강기 보양", "복도 보양"]}
      caption="현관, 승강기, 복도 보양"
    />
    <p>
      꿈꾸던 내 집을 위한 인테리어 공사가 시작되었다. 4개월 간 걱정의 대상이었던
      인테리어 공사가 시작되었다. 몇 년, 혹은 몇 십년 내가 살아갈 집을 꾸미는
      인테리어 공사가 시작되었다.
    </p>
    <OgLink
      image="https://cdn.imweb.me/upload/S2023020942f7e817aa33e/106068356c349.png"
      title="동의서 및 보양 업체"
      href="https://insup.kr/"
      description="인테리어 서포터즈"
    />
  </>
);
