"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2024년 5월 13일, 오늘은 교토에 가는 날이다. 교토는 천년 간 일본의
      도읍지였다고 한다. 그렇기에 역사가 느껴지는 건축물이나 문화가 느껴진다고
      하길래 기대를 많이 했다. 하지만 많이 걸어왔던 여행으로 인해 피로가 꽤나
      쌓인 상태라 조금 다운되어 있었다. 늘 그렇듯 맛있는 호텔 조식을 마쳤다.
      좋은 숙소의 요소 중 하나인 맛있는 조식이다. 평소에는 아침을 먹지도 않지만,
      피로가 쌓일 수 있는 여행에서는 맛있는 조식이 필수다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/c0QKGtU.jpeg"
      alt="호텔 조식"
      caption="맛있는 호텔 식사"
      height={400}
    />
    <p>
      오전 9시에 출발하여 가라스마 역으로 이동했다. 약 50분이 걸렸다. 역에서
      버스 정류장으로 가며 구글 맵을 살펴보니, 주변에 쇼핑할 곳을 찍어둔게
      보였다. 역 바로 앞에 있는 다이마루 백화점에 꼼데가르송 매장이 있는 것을
      확인하고, 오전 10시부터 영업을 시작한다는 것을 확인했다. 열시가 지난지
      얼마 되지 않았기에 바로 달려갔다. 여자친구의 가디건과 내 레인코트를
      구매하였다. 꽤나 비쌌지만, 이 때가 아니면 꼼데가르송 옷을 언제 사겠는가.
      백화점 꼭대기 층에서 택스 리펀까지 받고 다시 관광으로 돌아갔다.
    </p>
    <p>
      버스를 타고 기요미즈데라로 이동하였다. 비가 꽤 내렸다. 웬만해선 비를
      맞으며 다녔겠지만, 우산을 안 쓰기에는 애매한 정도로 비가 왔다. 사람이 적지
      않았는데, 모두 우산을 펼치고 다니다보니 움직이기 어려웠다. 음식점과 기념품
      매장으로 가득한 오르막길을 올라갔다. 꽤 걷다보니 기요미즈데라의 인왕문이
      보였다. 사진에서 보던 것보다 조금은 작아보였다. 멀리서 봐도 일본의
      건축물이라 느껴질만한 분위기가 느껴졌다. 작지만 화려하고, 공간을 찌르는
      듯한 각.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/cGqU6Zx.jpeg",
        "https://i.imgur.com/Euo0vI4.jpeg",
      ]}
      alt={["기요미즈데라 인왕문", "기요미즈데라 인왕문"]}
      caption="기요미즈데라 인왕문"
    />
    <p>
      더 들어가보니 기요미즈데라 내부를 더 들어갈 수 있는 입장권을 판다. 단순히
      건축물만 보는 것이 아니라, 기요미즈데라를 품고 있는 산까지 같이 볼 수
      있기에 들어가보고 싶은 곳이었지만, 이미 여행에서 더 걷기에 많이 지친
      상태였다. 우린 무료로 공개된 곳만 더 걷다가 돌아가기로 결정하고
      둘러보았다. 모두 입장해서 그런지, 사람이 별로 없는 곳이 많았다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/HFZ5YYK.jpeg",
        "https://i.imgur.com/Ghj25tC.jpeg",
      ]}
      alt={["기요미즈데라에서 본 뷰", "기요미즈데라 내의 작은 부처상들"]}
      caption="기요미즈데라 이모저모"
    />
    <p>
      일본의 한 관광지를 내가 전세내고 산책하는 것으로 지껴질만큼 사람이 별로
      없었다. 아주 편하게 이곳저곳을 모두 둘러보며 배를 채우러 이동하기로 했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/Xgzc2DE.jpeg",
        "https://i.imgur.com/XwksZmd.jpeg",
        "https://i.imgur.com/yf654rU.jpeg",
      ]}
      alt={[
        "기요미즈데라 내 정원",
        "기요미즈데라 내 정원",
        "기요미즈데라 내 건물 장식",
      ]}
      caption="기요미즈데라 이모저모2"
    />
    <p>
      아마도 산넨자카라고 부르는 길목을 지나 이동했다. 꽤나 경사가 있는
      내리막길이었지만, 아까보다는 사람이 적었기에 움직이기에는 더 편했다. 더
      한적했기에 굿즈샵을 구경하기에 훨씬 좋았다. 가벼운 쇼핑과 함께
      점찍어두었던 식당으로 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/eZJB5zH.jpeg"
      alt="산넨자카 계단"
      caption="여기가 산넨자카일 것이다."
      height={500}
    />
    <p>
      오늘의 점심 식당은 일본 가정식을 판매하는 곳이다. 나는 유명한 식당을 그리
      좋아하지 않는다. 내 입맛은 까다롭지 않은데, 아주 약간 더 맛있는 것을 먹기
      위해 줄을 서야하기 때문이다. 그래서 보통 여행 다닐 때에는 구글맵으로
      관광지 주변에 리뷰가 나쁘지 않은 곳들을 찍어두고 방문한다. 줄이 과하게
      길면 안 먹고, 줄이 없거나 적당하면 먹거나 대기하는 것이다. 이번 식당도
      그렇게 찾았다. 청어 소바와 장어 덮밥을 먹었다. 청어 소바의 비주얼이
      충격적이었기에 먹어보고 싶었다. 생선 특유의 비린 향이나 맛이 하나도
      느껴지지 않고 단백질의 식감이 많이 느껴지는 건강한 음식이었다. 조금
      달았다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/gTfw7M4.jpeg"
      alt="청어 소바와 장어덮밥"
      caption="청어 소바와 장어덮밥"
      height={500}
    />
    <p>
      식사를 마쳤으니 커피를 한잔 해야했다. 목적지 없이 걷다가 카페를 발견하면
      들어가자고 했다. 일본식 건물에 입점한 스타벅스를 발견했지만, 사람이 너무
      많아 들어가지 않았다. 조금 더 가다보니, 사람이 없는 한적한 길에 꽤나
      깔끔하게 꾸며둔 카페를 발견했다. 바로 들어가서 라떼와 아메리카노를 주문,
      비가 오는 바깥을 보며 잠시 쉬어갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/KrqwuKO.jpeg",
        "https://i.imgur.com/Kte3PZL.jpeg",
      ]}
      alt={["카페 2층 창문 뷰", "아이스 아메리카노와 아이스 라떼"]}
      caption="가끔씩 쉬어야 여행을 제대로 할 수 있다."
    />
    <p>
      그렇게 기온 거리까지 천천히 걸어갔다. 기온에는 깔끔하고 쾌적한 굿즈샵이
      많기 때문에 기념품을 쇼핑하기에 아주 좋다. 귀여운 손수건, 양말, 부채 등
      다양한 것들을 구경하며 쇼핑했다. 자연스럽게 역에 도착했고, 다시 오사카로
      이동한다. 원래는 난바 역의 남쪽을 구경하기로 했지만, 몸이 너무 지친
      상태였다. 그래서 목적지를 우메다로 변경하고, 쇼핑과 간식을 즐기기로 했다.
      헵파이브에 있는 스투시에 방문하여 옷을 구경했는데, 원하는 스타일이 없어
      고민을 많이 했다. 살까, 말까. 그나마 가장 마음에 드는 옷을 같이 구매하고
      숙소로 이동하는 길에 타코야끼를 구매했다. 가장 인기가 많은 타코야끼인
      하나타코였다. 줄이 무진장 길어 걱정했지만, 테이크아웃은 줄이 매우 짧았다.
      줄을 관리하는 종업원은, 절대로 테이크아웃하여 주변에서 서서 먹으면
      안된다고 강조했다. 집이나 숙소에서 먹어야지, 길바닥에서 먹으면 안된다고
      강조했다. 그래서 줄이 짧았나보다. 우린 숙소가 주변에 있었기에
      테이크아웃하여 숙소로 가져갔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/qxEg13Y.jpeg",
        "https://i.imgur.com/NwoitWi.jpeg",
      ]}
      alt={["타코야끼를 사는 중인 나", "기본 타코야끼와 파가 들어간 타코야끼"]}
      caption="문어가 문어를 사는 장면이다. 역시 맛있긴 하다."
    />
    <p>
      숙소에서 휴식을 취했다. 남은 시간은 숙소에 뻗어서 잠자고 싶었지만, 우리는
      저녁에 스냅사진을 예약해둔 상태였다. 아주 잠시만 휴식을 취하고 난바로
      이동했다. 마지막 오사카에서의 식사를 무엇으로 할지 고민했고, 규카츠가 먹고
      싶다는 그녀의 희망사항에 따라 모토무라 규카츠를 먹으러 이동했다. 줄이
      짧았기에, 약 10분간 대기 후 식사했다. 우린 별로 배가 고프지 않았는데,
      나오자마자 허겁지겁 하이볼과 함께 먹어버렸다. 빠르게 먹어서 그런지, 스냅
      작가님과의 약속 시간까지 한 시간 정도 남았다. 난바 파크스와 난바 시티를
      걸으며 조카의 선물을 찾아다녔다. 결국 찾지 못하고 발만 피곤해진 상태로
      스냅사진을 찍으러 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/sIduBeu.jpeg"
      alt="모토무라 규카츠"
      caption="일본 어디에나 있는 규카츠 맛집 모토무라"
      height={500}
    />
    <p>
      일본에 워킹홀리데이 비자로 일을 하고 계신 분이었다. 오사카의 숨겨진 사진
      명소를 잘 알고 계셨고, 돌덩이처럼 굳어있는 우리의 포즈를 잘 풀어주며
      한시간동안 폭풍 사진을 찍기 시작했다. 한시간동안 웃다보니 얼굴이 아팠다.
      나중에 결과물을 받고나니 아주 만족스러웠지만, 그 당시에는 너무 피곤했다.
      스냅 시간이 마무리되고, 인형뽑기방에 가서 또 3,000엔을 기부하고 나왔다. 난
      이런 거랑 잘 안 맞더라. 앞으로 근로 소득만 챙겨야겠다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/DHedSyy.jpeg"
      alt="도톤보리에서의 스냅 사진"
      caption="일본을 배경으로 한 스냅샷"
      height={500}
    />
    <p>
      그렇게 일본에서의 마지막 밤을 보냈다. 이 날부터 발의 피로도가 급상승했다.
      걷기에 좋은 스케쳐스 워킹화였는데, 어느 순간부터 신발이 딱딱하다는 느낌이
      들 정도로 발이 아파왔다. 교토의 분위기로 압도당할 것으로 기대했던
      날이었지만, 내 인생 첫 스냅의 기억이 강했던 날이다.
    </p>
    <OgLink
      href="https://maps.app.goo.gl/SSjzjz5pjo7J8yTaA"
      title="점심 식사 / 교토 일본 가정식"
      description="쿄노 아지토코로 우에무라"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/wQSMzD9dWm9roBy67"
      title="교토 카페"
      description="The Unir Coffee Senses"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/BbV9yzH2fu5thauo8"
      title="오사카 대표 타코야끼"
      description="하나다코"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/BJFBcJET8mQEJyKc7"
      title="저녁 식사 / 규카츠"
      description="규카츠 모토무라 난바 미도스지점"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
