"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      나는 2026년 1월에 결혼 예정이었다. 보통 결혼을 하면 다들 신혼여행을 가지
      않는가. 그래서 신혼여행 장소를 논의했고, 미국으로 결정했다. 여러가지
      이유가 있었는데 가장 큰 이유는, 내가 미국 여행에 좋은 기억과 동경심을 갖고
      있었기 때문이다. 우리는 2020년 5월에 연애를 시작했는데, 내가 그 해 1월에
      미국 여행을 다녀왔던지라, 미국 여행에 대해 많은 이야기를 했었다. 그리고
      코로나 시국으로 인해 여행을 못가게 되어서인지, 미국 여행에 대한 기억이 더
      깊어졌다. 그래서 우린 2020년이 지난 뒤에도 언젠가 미국 여행을 같이 가자고
      이야기했었다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/H4FPIyN.png"]}
      alt="다리와 바다"
      caption="2020년 미국 여행 중 찍은 빅스비 브릿지"
    />
    <p>
      다른 이유들도 있었지만, 대부분의 이유는 논리적으로 말이 안 되는 이유였다.
      1월에 갈 만한 여행지 중 날씨 좋은 곳이 없다거나, 치안이 안 좋다거나 등.
      요약하자면, 미국 여행이 가고 싶었기에 가는 것이었다. 내가 다녀온 곳들
      일부와 안 가본 곳을 합쳐 여행을 계획했다. 설날 연휴를 포함하여, 14박
      일정이었다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/dQn2U8C.png"]}
      alt="달력"
      caption="14박 15일 여행 일정"
    />
    <p>
      지난 여행에서 두 국립공원에 방문했었다. 요세미티와 조슈아트리
      국립공원이다. 그 당시 자연에 압도되어 경외감을 느낀 경험이 너무 좋았기에,
      이번 여행에서 국립공원을 필수 코스로 포함했다. 국립공원이 많이 모여 있는
      곳을 찾아보니, 시애틀 주변에 꽤 있었다. 그래서 우린 시애틀 in,
      샌프란시스코 out으로 정했다. 시애틀 주변에는 세 개의 국립공원이 있었다.
      우선 노스 캐스케이즈 국립공원은 시애틀의 북쪽에 있었기에 이동 경로가
      불편했다. 그래서 패스. 두번째 마운트 레이니어 국립공원은 코스에 포함하고
      싶었다. 하지만, 1월은 눈이 많이 올 수 있는 비수기이기에 방문하기 어려웠다.
      내 기억에 동쪽 입구만 열려있고, 서쪽은 폐쇄했었다. 그래서 패스. 마지막
      올림픽 국립공원은 엄청난 스케일을 갖고 있는, 무조건 가보고 싶은 곳이기에
      코스에 포함했다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/5mfO4AZ.png"]}
      alt="리알토비치"
      caption="올림픽 국립공원의 리알토 비치. 날씨가 아쉬웠다."
    />
    <p>
      샌프란시스코로 이동하는 길에 국립공원이 더 있었다. 오리건 주의 크레이터
      레이크, 그리고 캘리포니아 주의 레드우드, 라센 볼카닉 국립공원이다. 사실
      계획 당시 라센 볼카닉 국립공원은 존재 자체를 몰랐는데, 알았더라도 경로가
      불편했기에 방문하긴 어려웠을 거 같다. 크레이터 레이크와 레드우드는 일정에
      포함했다. 그리고 내가 지난 여행에서 가장 인상 깊었던 요세미티 국립공원까지
      포함했다. 이렇게 총 네 개의 국립공원을 방문하기로 했다. 네 국립공원을
      이용하려면, 연간 패스를 구입하는 것이 가성비가 좋다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/9XuQ4II.jpeg"]}
      alt="레드우드 국립공원"
      caption="이번에 방문한 레드우드 국립공원에는, 키가 매우 큰 나무들로 가득했다."
    />
    <p>
      그렇게 계획하던 와중, 정보를 얻기 위해 자주 방문하는 자동차 여행
      커뮤니티에서 연간 패스에 대한 글을 보았다. 트럼프 정부에서 외국인에 대한
      연간 패스 가격을 세 배 가량 인상하기로 했다는 것이다. 시기는 2026년, 1월
      1일부터. 기존에는 80불이었지만, 250불로 인상되었다. 환율을 생각하면
      11~12만원이었던 것이 35~37만원 정도가 된 것이다. 방법을 찾다가, 첫 호텔에
      문의 메일을 보냈다. 내 택배를 보관해줄 수 있냐고. 90일까지 보관이
      가능하니, 참고하라는 답변을 확인하고 12월에 연간패스를 호텔로 주문했다.
      80불에 구입한 연간패스이며, 2026년 11월까지 사용 가능했다. 그렇게 나는
      20만원 이상을 아꼈다. 참고로, 이와 비슷하게 미국 여행 시 필요한 ESTA 역시
      2025년 9월에 가격이 오른다 하여, 8월에 구입했다. 21불에서 40불이 되었는데,
      두 명이니까 5~6만원 가량 아꼈다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/jIMfSQN.png"]}
      alt="연간패스"
      height={400}
      caption="내가 구입한 미국 국립공원 연간패스. 2026년 11월까지 사용 가능하다."
    />
    <p>
      그 외에도 더 코브 팰리세이즈 주립공원, 로그 리버, 마운트 후드 등 비교적
      유명하지 않은 장소에도 코스로 포함했다. 반년이 지난 지금 글을 쓰는
      시점에도 그때로 돌아가고 싶은 생각이 계속 드는 이유는, 아마도 그 여행이
      주는 기분이 특별했기 때문이 아닐까 싶다. 14박의 기록을 남겨보려 한다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/bcCslzG.png"]}
      alt="마운트 후드"
      caption="기대하지 않았던 곳에서 이런 뷰를 보면, 여행 계획에 대해 허무함이 느껴진다. 마운트 후드."
    />
    <OgLink
      href="https://usacartrip.com"
      title="자동차 여행 커뮤니티"
      description="미국자동차여행"
      image="https://usacartrip.com/xe/files/attach/images/1827775/7be1b303a77cc2f2b1231cc4a8e73530.png"
    />
  </>
);
