"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      2022년 9월 추석 연휴에 이탈리아로 가족 여행을 가게 되었다. 언제부터
      논의되었는지는 잘 모르겠다. 아마도 아버지께서 이탈리아의 알프스인
      돌로미티에 꽂히게 되었고, 꽤나 긴 휴가를 앞뒤로 붙여 가족 여행을 가게 된
      것이다. 이탈리아까지의 비행기는 가격도 있고 거리도 꽤나 멀었기에 파리
      일정도 짧게 붙여 다녀오게 되었다. 일정을 모두 짜놓고, 회사에 휴가 일정을
      검토받아보니 나는 가족 여행 기간을 모두 함께할 수는 없었다. 나를 제외한
      가족은 3일 먼저 로마로 떠났고, 난 로마에서 합류하기로 했다. 그리고 난
      밀라노에서 다시 한국으로 돌아오고, 가족들은 파리행 기차를 탑승하게 되었다.
    </p>
    <p>
      대부분의 일정은 나보다 더 대문자 J인 아버지와 누나가 미리 짜두었다. 가족
      구성원 간의 갈등을 최소화하기 위해서는 계획에 따라야한다는 생각이 들어,
      나는 짜준 일정을 소화하기만 했다. 나에게 주어진 건 밀라노에서의 일정
      하루였고, 조사해보니 생각보다 갈 곳이 많지는 않아서 아주 쉽게 일정을 짰다.
      이 당시 가장 힘들었던 것은, 코로나 검사였다. 한국에 다시 돌아오기 위해서는
      외국에서 코로나 검사를 받고, 음성 결과지가 있어야했다. 그래서 각종
      블로그를 검색하며, 밀라노에서 코로나 검사할 수 있는 보건소, 병원을
      찾아다녔고 그에 따라 일정을 맞췄다. 다행인지, 불행인지. 그 노력이
      불필요하게 되었다. 출국하기 일주일 전 쯤, 뉴스를 통해 이제 그럴 필요가
      없어졌다는 소식을 들었다.
    </p>
    <p>
      9월 8일, 가족들은 이미 로마로 떠난지 3일차, 난 이제 합류하러 간다. 집
      앞에서 예약한 공항버스를 타고 인천공항으로 이동했다. 버스가 90분정도 늦게
      왔지만 괜찮았다. 난 항상 공항에 비행기 이륙 시간보다 4~5시간 먼저 도착하는
      것을 목표로 하기 때문에 90분 늦어져도 이륙 3시간 30분 전인거다. 안전하게
      도착하여 마티나 라운지 식사 후 이곳저곳을 돌아다녔다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/Ftx5kQr.jpeg"
      alt="셀카를 찍는 모습"
      caption="얼마나 심심했으면 평소에 찍지도 않는 셀카를 찍었다."
      height={500}
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/dZFWaF3.jpeg",
        "https://i.imgur.com/Rj5oLI9.jpeg",
      ]}
      alt={["마티나 라운지에서 식사 중", "공항 창을 통해 본 비행기"]}
      caption="마티나 라운지에서의 식사 후 내가 탈 비행기를 보며 기다렸다."
    />
    <p>
      약 10시간을 비행하여 아랍에미리트의 아부다비 공항에 도착했다. 전산 오류로
      인해 한국에서 받지 못한 환승 티켓을 받고 3시간을 대기했다. 정말 지루한
      환승 대기 시간이었다. 공항을 이곳 저곳 구경하며 즐겨야하는데, 낯선
      곳에서는 두려움으로 인해 조심하다보니 아무것도 하지 못했다. 앉을 자리를
      찾으며 본 공항에는 금과 보석으로 만들어진 장신구를 파는 곳이 많았다.
      흡연장도 무진장 많았고, 맥도날드가 있었다. 단순히 환승하는 곳이라 아무
      준비 없이 갔던 것이 후회된다. 언젠가 환승한다면 공항 공부를 미리 하고
      즐겨봐야겠다. 다시 로마로 향했다. 약 7시간이 걸렸고, 간단한 입국 심사 후
      레오나르도 다 빈치 공항에서 로마 시내로 향하는 기차를 탔다. 티켓을 꼭
      펀칭해야 범칙금을 내지 않는다고 하여 승무원에게 펀칭 방법을 문의했지만
      그냥 가라고 했다. 불안했지만 그냥 탑승하여 이동했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/RBizyDo.jpeg"
      alt="로마 시내로 가는 기차에서 창 밖을 보는 중"
      caption="로마 시내로 향하는 기차 안에서"
    />
    <p>
      로마 테르미니 역에서 내려 가족들이 머무르고 있는 숙소로 향하는 버스를
      알아봤다. 버스타는 곳은 구글 맵으로 금방 확인이 가능하지만, 버스 티켓을
      어디서 사야할지 몰랐다. 기차역 앞에 있는 가게에 영어로 물어봐도 잘
      이해하지 못했다. 큰 소리로 버스를 외쳤고, 이 말을 이제서야 이해한
      퉁명스러운 아저씨는 버스 티켓을 줬다. 동양인을 처음 보는 듯 한
      이탈리아인들의 시선을 느끼며 숙소 주변의 정류장에 도착했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/GgPC0wD.jpeg"
      alt="복잡한 로마 테르미니 역 앞"
      caption="로마 테르미니 역 앞은 서울역 버스환승센터가 생각날만큼 복잡하다."
    />
    <p>
      정류장에서 아버지가 맞이해주셨고, 함께 숙소로 이동하였다. 그 날은 로마에서
      떠나는 날이었고, 체크아웃 전 아버지가 속성으로 로마를 소개해주겠다며 짐을
      두고 바로 바깥으로 나갔다. 이때가 아침 8시가 안됐다. 비행기에서 제대로
      수면을 취하지 못했기에, 이 날이 내 인생에서 가장 긴 하루였다.
    </p>
  </>
);
