"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      다른 공정과는 과정이 달랐다. 목공, 도배, 필름 등의 공정은 전화나 카톡,
      문자를 통해 견적 받고 예약했지만, 욕실 타일을 담당하는 업체에서는 오피스로
      초대했다. 용인 죽전에 있는 오피스에는 수십가지 타일이 전시되어 있었고
      욕실이 세 개 있었다. 실제 동작하는 욕실은 화장실 하나였고, 나머지는
      모델하우스처럼 디자인만 보여주고 나머지는 동작하지 않았다. (수도꼭지에서
      물이 안 나왔다.) 오피스에서 사장님의 상담을 통해 견적을 받았다. 직접
      부동산 앱에 접속하여 내가 계약한 집을 VR로 직접 살펴보며 대략적인 견적을
      냈다. 견적서를 직접 종이로 받아보니, 제대로 상담을 받아본 기분이 들었다.
    </p>
    <p>
      거실과 안방에 있는 두 욕실을 타일부터 도기까지 모두 진행하기로 했고,
      주방의 바닥과 벽면 타일을 진행하기로 했다. 이 아파트는 준공 당시부터 주방
      바닥이 타일로 되어있었는데, 마루 작업을 진행하지 않다보니 주방을 다시
      타일로 진행할 선택지 밖에 없었기 때문이다. 그렇게 각 구역별로 견적을 받고
      예약한 후, 시공을 시작했다. 결론적으로, 견적부터 결과물까지 모두 마음에
      들었지만 추가로 사장님께서 타 공정 업자분들을 소개해주셨기에 원활한 반셀프
      인테리어를 진행할 수 있었다. 중간중간에 어려운 인테리어 개념을 문의하면
      항상 빠르고 친절하게 답변주셨기에 그 누구든 간에 타일은 무조건 내가 진행한
      코알라타일에서 견적을 받아보길 바란다.
    </p>
    <p>
      공사 시작 전 날, 사장님께서 연락이 왔다. 공사가 바쁘지 않다면, 미리 공사
      자재를 옮겨도 되냐는 문의였다. 마침 일정이 비었기에, 원활한 욕실 공사를
      위해 자재를 옮겨두시라고 했다. 퇴근 후 직접 가보니 집이 욕실 자재들로
      가득찼다. 이걸 왜 미리 옮겨 놓는지 처음에는 이해 못했지만, 직접 타일
      한박스를 들려고 해보니, 무진장 무거웠기에 노동을 미리 해둔 것이라
      생각했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/5WzTZ5u.jpeg",
        "https://i.imgur.com/x87C0nA.jpeg",
        "https://i.imgur.com/BnONrGd.jpeg",
      ]}
      alt={["타일 자재", "타일 자재", "타일 자재"]}
      caption="타일, 천장, 접착제 등 무거운 자재들을 미리 옮겨둔 업체"
    />
    <p>
      5일짜리 공사였기에 하루하루 발전해나가는 것이 보였다. 매일 작업이 끝나면
      사장님께서 카톡으로 사진을 전달주시고, 그날의 이슈를 알려주었다. 한번은
      타일의 무게로 인해 문이 잘 닫히지 않는 문제가 발생한 적이 있다. 미리
      계약서 작성하면서 설명받았던 내용이지만, 그런 일이 발생할줄 모르고 목수
      측에 일정을 미리 잡아두지 않았었는데, 타일 사장님께서 여러 곳에 직접
      연락하여 목수를 섭외하고 문 사이즈 작업을 해주셨다. 이런 점들이 사소할 수
      있어도 반셀프 인테리어의 일정을 지킬 수 있게 하는 요인이 된다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/yhVphyn.jpeg",
        "https://i.imgur.com/Ul47S4K.jpeg",
        "https://i.imgur.com/4pcAlGJ.jpeg",
      ]}
      alt={[
        "타일 공사 초반의 주방 모습",
        "타일 공사 초반의 욕실 모습",
        "타일 공사 초반의 욕실 모습",
      ]}
      caption="타일 공사 초반의 욕실과 주방"
      height={400}
    />
    <p>하루하루 발전하는 것을 보는 맛이 있었다.</p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/u54OPy5.jpeg",
        "https://i.imgur.com/UZGvJIZ.jpeg",
      ]}
      alt={["마무리되어가는 욕실 모습1", "마무리되어가는 욕실 모습2"]}
      caption="점점 마무리가 되어가는 욕실"
      height={500}
    />
    <p>
      그리고 완성이 되었다. 주방에 싱크대가 설치되지 않아 아직 빈 느낌이
      있었지만, 욕실은 모든 것이 완성되었다. 이 집에서 처음으로 완성된 공간이
      나온 것이다. 이제는 집에서 볼일을 볼 수 있게 되었다. 추후 비데를
      설치하기로 결정했기 때문에 변기에 커버는 제외하고 견적냈었는데, 사장님께서
      실수로 커버도 설치해주셨다. 연락해보니, 다시 떼는 것보다 서비스로 주신다고
      하셨다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/XcaB46g.jpeg",
        "https://i.imgur.com/tXHuEPx.jpeg",
        "https://i.imgur.com/H0FKSeK.jpeg",
      ]}
      alt={["완성된 주방", "완성된 첫번째 욕실", "완성된 두번째 욕실"]}
      caption="완성된 욕실들과 주방 타일"
    />
    <p>
      완성됐다고는 하지만 사실 100% 완성이 아니긴 했다. 추후 케라폭시 줄눈도
      진행해야 하기에 95% 완성 정도로 볼 수 있다. (물론 5%가 꽤나 비싸고 차이가
      크지만 말이다.) 다음날부터는 철거와 타일 시공을 하면서 화장실 문틀이
      상하기도 했고, 오래된 샷시 필름을 수리하기 위한 과정이 진행된다. 타일
      사장님과 직장 동료가 추천해준 필름 시공업자인데, 이 업체에 시공을 맡긴
      것이 추후 큰 일에 엄청난 도움이 되었다.
    </p>
    <p>
      따로 무언갈 받지 않았지만, 좋은 업체를 소개하기 위해 타일 시공 업체를
      남겨둔다.
    </p>
    <OgLink
      href="https://maps.app.goo.gl/o496H7UWoEDhy6yeA"
      title="방수를 진행한 타일 전문 업체 코알라타일"
      description="코알라타일 (KOALATILE)"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
