"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";
import { YoutubeVideo } from "@/components/entry-detail/youtube-video";

export const content = (
  <>
    <p>
      2024년 5월 11일, 에너지가 넘치는 여행 2일차이다. 내 생일이기도 하다.
      오사카 여행 시 꼭 방문해야 한다는 유니버설 스튜디오 재팬 (이하 USJ)을 가는
      일정이다. 대부분의 관광지의 경우, 역사나 입장권 금액에 대해서만 공부하면
      편한 관광이 가능하지만, USJ는 알아야할 것들이 많았다. 더 자세히 말하면,
      시간 고효율적으로 많은 컨텐츠를 즐기기 위해 여러가지 공부를 했다. 미리 USJ
      앱도 깔아두고, 입장권과 패스를 실물로 뽑아오기도 했다.
    </p>
    <p>
      USJ는 크게 두 가지의 티켓이 있다. 입장권과 패스이다. 입장권은, 놀이동산의
      자유이용권을 생각하면 된다. 입장권을 사면 USJ에 들어갈 수 있고, 대부분의
      놀이기구에 대기 후 탈 수 있다. "대부분"이라고 표현한 이유는, 일부 에어리어
      (마리오나 호그와트)는 상황에 따라 입장이 제한되기 때문이다. 앱에서
      선착순으로 대기할 수 있다는 정보를 봤었는데, 이것저것 다 파악하기가
      어려웠다. 나 같은 사람들을 위해 나온 자본주의의 끝판왕인 익스프레스 패스
      (이하 패스)가 있다. 패스는 미리 정해진 놀이기구에 대해서 줄을 '거의' 서지
      않고 탈 수 있는 치트키이다. 패스4와 패스7이 있는데, 각각 네 개의 놀이기구,
      일곱 개의 놀이기구를 줄 서지 않고 탈 수 있다. 당연하지만, 패스7이 더
      비싸다. 나는 입장권과 패스7을 미리 구매했다. 와그와 같은 플랫폼에서 한 달
      전에 열리는데, 대기하다가 구매했다. 이상할 수도 있지만, 패스를 쓰려면
      입장권이 있어야 한다.
    </p>
    <p>
      그리고 웃기게도, USJ의 티켓과 패스 가격은 날마다 다르다. A~E 총 다섯 개의
      분류로 나뉘어, A가 제일 싼 날, E가 제일 비싼 날로 분류된다. 일본의 연휴
      기간에 걸리면 E로 제일 비싸고, 반대의 경우에 A이다. 당연히, A인 날은 별로
      없다. USJ 홈페이지에서 최근 세 달 간 확인이 가능하다. 8월을 보니, 일본
      휴일인 '바다의 날'이 껴있는 연휴 기간이 E로 설정되어 있다. 내가 입장하는
      5월 11일의 경우 B로 설정되어 있어 비교적 저렴한 가격이었다. 입장권은
      83,500원, 패스7은 183,500원이었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/3QV3kZH.jpeg"
      alt="USJ 홈페이지에서 본 2024년 8월 달력"
      caption="USJ 홈페이지에서 본 2024년 8월 달력. 8월 10일부터 17일까지 연휴기간으로 E로 설정되어 있다."
      height={350}
    />
    <p>
      숙소에서 8시 50분에 나와 전철을 타고 유니버설시티 역으로 갔다. 역에서
      USJ까지 10분정도 걸으면 입장이 가능하다. 미리 뽑아둔 입장권을 보여주고
      들어가면 된다. B라서 저렴한지 사람이 꽤 많았다. USJ앱을 보면서 이곳 저곳
      위치를 파악하고, 패스에 적혀있는 놀이기구가 보이면 가까운 순서로 이동하여
      입장했다. 처음 탄 놀이기구는 할리우드 드림 더 라이드. 약 10년만에 탄
      놀이기구가 USJ에서 제일 스릴 넘치기로 유명한 롤러코스터였다. 영혼을 쏙
      빼고 또 다음 놀이기구로 이동했다. 더 플라잉 다이너소어. 또 영혼이 빠졌다.
      USJ에서 제일 무서운 두 개를 처음에 타버렸다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/0992GTW.jpeg"
      alt="USJ의 입장 문"
      caption="USJ의 입장 문"
      height={500}
    />
    <p>
      11시 30분부터는 해리포터 에어리어 입장시간이라 바로 들어갔다. 입구부터
      호그스미드의 느낌이 물씬 나는 분위기가 든다. 호그와트, 그리고
      협력학교(?)의 교복을 입은 학생들이 쇼를 벌이기도 하고, 지팡이를 팔기도
      한다. 안에서 포비든 저니와 플라이트 오브 더 히포그리프를 탔다.
      히포그리프는 그냥 롤러코스터인데, 히포그리프 모양으로 만들어진 형태다.
      포비든 저니는 움직이는 4D 느낌의 놀이기구였다. 해리포터의 감성이 느껴지는
      놀이기구였다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/UQppMPl.jpeg",
        "https://i.imgur.com/DqgewtS.jpeg",
        "https://i.imgur.com/fkgOfSO.jpeg",
      ]}
      alt={[
        "해리포터 에어리어 입구",
        "호그와트행 급행열차",
        "호그스미드 상점 모형",
      ]}
      caption="더 위저딩 월드 오브 해리 포터"
    />
    <p>
      나와서 점심 식사를 가볍게 하고, 미니언 메이햄을 탔다. 포비든 저니와
      비슷한, 움직이는 4D 놀이기구였는데, 미니언즈 시리즈를 보고 왔어야 했다. 안
      봐도 재밌지만, 미니언즈 세계관을 안다면 더 재밌었을 것이다. 재밌게 즐기고
      나왔는데, 문제가 생겼다. 16시 20분부터 닌텐도 월드 입장이 가능한데, 약
      2시간 정도 시간이 비는 것이다. 이 시간을 효율적으로 즐기려 여러 굿즈샵들을
      돌아다녔지만, 에너지와 흥미가 부족했다. 그러던 와중 좋은 자리를 잡아
      그늘에서 쉬면서 멍때렸다. 저 멀리 유니버설 스튜디오의 상징인 지구본이
      돌아가고 있는게 보여 내 갤럭시의 줌도 테스트해볼 겸 사진을 찍었다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/GNLFILr.jpeg",
        "https://i.imgur.com/TFpGtMF.jpeg",
        "https://i.imgur.com/XGP4cRS.jpeg",
      ]}
      alt={[
        "멀리서 본 USJ의 지구본",
        "조금 멀리서 본 USJ의 지구본",
        "100배 줌으로 본 USJ의 지구본",
      ]}
      caption="갤럭시의 힘으로 찍은 USJ의 지구본"
    />
    <p>
      어찌저찌 시간을 잘 보내고 들어간 닌텐도 월드. 마치 슈퍼마리오 세상 속에
      들어온 듯한 느낌이 든다. 입구에서부터 차원의 변경이 일어나는 듯한
      느낌이다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/KlsqlI4.jpeg",
        "https://i.imgur.com/o4OVM8M.jpeg",
      ]}
      alt={["닌텐도 월드 입구", "닌텐도 월드 입구에 있는 액자"]}
      caption="초장부터 발라버리는 닌텐도 월드"
    />
    <p>
      여기서는 마리오 카트와 요시 어드벤처를 탄다. 마리오 카트는 주변에서
      재밌다는 이야기를 많이 들어 기대했는데, 난 별로였다. 디스플레이가 나오는
      안경을 쓰고, 카트를 타며 등딱지 미사일을 쏘는 게임 형태의
      어트랙션이었는데, 오락실 게임보다 못하다는 느낌이 들었다. 오히려 사람들이
      별로라고 했던 요시 어드벤처가 좋았다. 느긋하게 요시에 앉아, 닌텐도 월드를
      천천히 한바퀴 돈다. USJ에서의 일정이 끝나가면서 몸이 지쳐서 그런지 그
      느긋함 속에서 보는 게임 세상이 꿈 같았다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/opyuSnM.jpeg",
        "https://i.imgur.com/Xj8cuIw.jpeg",
      ]}
      alt={[
        "마리오 카트 대기 공간에 있는 쿠파 동상",
        "마리오 카트 대기 공간에 있는 전시품",
      ]}
      caption="마리오 카트 대기 공간"
    />
    <ImageInEntry
      src={[
        "https://i.imgur.com/sGmuEV9.jpeg",
        "https://i.imgur.com/6gBqfIn.jpeg",
      ]}
      alt={[
        "요시에 탄 상태로 본 닌텐도 월드",
        "요시에 탄 상태로 본 뻐끔플라워",
      ]}
      caption="요시에 탄 상태로 본 닌텐도 월드"
    />
    <p>
      그렇게 패스7을 모두 사용하고 USJ를 나오게 되었다. 떠나기 전 지구본에서 잘
      찍지도 않는 셀카를 찍었다. 생각보다 많이 작았다. 한바퀴 도는게 어렵지
      않았다. 나무위키를 통해 검색해보니, 에버랜드의 2/3 사이즈였다. 기대했던
      것보다 많이 작았다. 근데, 중요한건 크기가 아니었다. 작은 어트랙션 안에서
      느껴지는 컨텐츠와 그 몰입도가 너무 좋았다. 우리나라에서도 이런 컨텐츠를
      만들 수 있으면 좋겠다는 말을 지인들 만날 때마다 하고 있다. 손흥민, BTS,
      봉준호, 펭수, 뽀로로, 티니핑, 렛츠고.
    </p>
    <YoutubeVideo
      videoId="jY2y36z9RS4"
      caption="유니버설 스튜디오의 상징"
      height={300}
    />
    <p>
      이제 떠나서 저녁 식사와 쇼핑을 하러 난바로 이동했다. 저녁 식사는 라멘.
      고기를 추가해서 먹었고, 역시는 역시다. 라멘은 항상 국물이 부족해서
      아쉽지만, 그래도 맛있었다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/VIV0tqi.jpeg"
      alt="사쿠노사쿠 라멘"
      caption="사쿠노사쿠 라멘"
      height={400}
    />
    <p>
      앞에 있는 호젠지에 들러, 일본 감성이 확 느껴지는 신사와 고양이를 보고
      쇼핑을 했다. 빅카메라에 들러 위스키를 구매하고, 돈키호테에서 녹차 아몬드와
      고체 카레 등 집에 사갈 것들을 구매하고 숙소로 이동했다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/tcngslM.jpeg",
        "https://i.imgur.com/wlgh0eq.jpeg",
      ]}
      alt={["고양이", "호젠지"]}
      caption="호젠지와 호젠지를 지키는 고양이"
    />
    <p>
      지금까지 여행해봤던 일본에서의 하루 중, 이번 하루가 가장 일본이 느껴졌다.
      일본의 캐릭터 컨텐츠, 신사, 고양이, 라멘. 아마 이 날을 평생 잊지 못할
      것이다. USJ는 비싸서 다시 갈지 모르겠지만, 나중에 동키콩과 포켓몬 관련
      에어리어가 생기면 방문해볼 생각이 있다.
    </p>
    <OgLink
      href="https://www.usj.co.jp/ticket/common/studiopass/price-calendar.html"
      title="USJ 공식 홈페이지에서 제공하는 날짜별 가격 분류"
      description="Studio Pass Price Calendar | Universal Studios Japan™ | USJ"
      image="https://www.usj.co.jp/img/usj_ogp.png"
    />
    <OgLink
      href="https://maps.app.goo.gl/ChaMbC53fZ6kYPt87"
      title="라멘 전문점 사쿠노사쿠 (작작 라멘)"
      description="作ノ作 千日前本店"
      image="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
