"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      2024년 5월 14일, 오늘은 한국으로 돌아가는 날이다. 원래 오늘 오전에는
      오사카 성을 구경하기로 했었다. 하지만, 전날 밤에 논의한 결과 가지 않기로
      했다. 체크아웃 시간인 11시까지 쉬다가 바로 아울렛으로 이동하기로 결정했다.
      오사카 성을 못 보게 되는 것이 아쉬웠지만, 체력 상태를 고려하여 결정했다.
      그렇게 우리는 오전에 호텔의 조식과 사우나를 즐겼다. 11시까지 호텔 방에서
      쉬다가 체크아웃했다. 떠나기가 아쉬울 정도로 만족스러운 숙소였다. 대부분의
      오사카 여행객들은 난바 역을 거점으로 잡는데, 우리는 약간의 우연과 약간의
      계획이 섞여 우메다 역을 거점으로 잡은 것이 신의 한 수였다. 대중교통,
      조식과 대욕장 같은 시설, 서비스 모두 상당히 만족스러운 숙소였다. 과거의
      기록을 살펴보니, 4박 5일 간 96,000엔의 가격이었다. 오사카에 다시 간다면 저
      숙소로 다시 가고 싶을 정도이다.
    </p>
    <p>
      숙소를 나와 여행의 마지막을 장식할 린쿠 프리미엄 아울렛으로 향했다.
      간사이를 떠나는 여행객들을 완벽히 노린 아울렛으로, 간사이 공항 역에
      도착하기 딱 한 역 전에 있다. 린쿠 타운 역에서 내려 조금 걷다보면 아울렛이
      나온다. 우리는 캐리어를 맡아주는 매장에 들러 캐리어를 맡기고 확인증을
      받았다. 캐리어 하나에 300엔이었고, 두 개라 600엔을 주고 맡겼다. 약 10분
      정도 걷다보면 아울렛이 나오고, 다양한 브랜드 매장이 있다. 미리 아울렛을
      조사하여, 방문할 곳들을 적어두었다. 순차적으로 하나하나 방문했다. 나이키,
      아디다스, 르코크, 뉴발란스, 버버리, 리바이스 등. 지금까지 여행을 다니면서
      방문했던 미국이나 이탈리아의 아울렛과는 가격이 달랐다. 싸다는 느낌이 들지
      않았고, 몇몇 상품은 검색해보니 한국이 더 싼 경우도 있었다. 오랜 시간
      돌아다녔지만, 조금 밖에 구매하지 못했다. 아쉽긴 했지만 뷰가 맛집인
      아울렛이라 그거라도 즐기자는 생각으로 구경했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/dter0OG.jpeg"
      alt="린쿠 프리미엄 아울렛에서 바라본 공항 다리"
      caption="저 다리를 건너면 간사이 공항이다."
      height={400}
    />
    <ImageInEntry
      src="https://i.imgur.com/1NBxvsV.jpeg"
      alt="린쿠 프리미엄 아울렛의 관람차"
      caption="린쿠 프리미엄 아울렛의 랜드마크인 관람차"
      height={800}
    />
    <p>
      각자 사진도 찍고 공항으로 이동했다. 수하물을 부치는데, 둘이 합쳐 규정보다
      10kg 오버됐다. 기억으로 1kg당 1,200엔의 추가 비용을 내야 하는 상황.
      아울렛에서 구매했던 노스페이스 배낭에 이것저것 넣기 시작했다. 아무리
      열심히 채워도 8kg정도 오버되어 8~9만원을 내게 되었다. 좀 더 신경써서 짐을
      나누어 기내 수하물로 챙겼어야 했는데, 신경쓰지 못해서 내는 돈이었다. 꽤나
      깔끔했던 공항에 앉아 쉬다가 한국으로 돌아왔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/bUw9cvs.jpeg",
        "https://i.imgur.com/0ppfA4y.jpeg",
      ]}
      alt={["간사이 공항의 석양", "비행기에서 본 대한민국 시내"]}
      caption="간사이 공항을 통해 한국으로 돌아오는 길"
    />
    <p>
      빠르면 5년 내에, 늦어도 10년 안에는 오사카에 또 갈 것이다. 이렇게 느낄
      정도로 여행의 질에 아주 큰 만족감을 느꼈고, 가성비도 좋았다. 다음 번에
      간다면, USJ는 제외하고 계획을 짤 것이다. 3박 4일 간, 교토와 나라를
      당일치기로 가는 여행도 좋고, 고베나 오쓰에 다녀오는 것도 좋을 것이다.
      교토의 기요미즈데라 뿐 아니라 치쿠린도 가보고, 나라에서는 크게 숲을 한바퀴
      둘러볼 것이다. 언제일지 모르겠지만 꼭 다녀와야겠다.
    </p>
  </>
);
