"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      반셀프로 인테리어 공사를 마치고 12월 초에 이사하고 약 4개월을 살았다.
      집들이도 대여섯 번 했다. 어느덧 생활 패턴이 생기기 시작했고 그 패턴에
      적응하느라, 혹은 인테리어 공사와 개인적인 일에 썼던 신경 때문인지 몸이
      많이 안 좋았다. 무튼, 이젠 적응했다. 반셀프 인테리어를 진행하면서 느꼈던
      것들과, 새 아파트에 살면서 좋았던 혹은 불편했던 것들을 두서없이 기록해보려
      한다.
    </p>
    <p>
      이번 공사 중 가장 잘 한 의사결정은 휴젠뜨 설치 여부이다. 직장 동료의
      추천도 있었고, 언젠가는 욕실에 제습기를 두고자 했던 생각도 있었기에 막판에
      휴젠뜨를 설치하기로 결정했다. 휴젠뜨는 욕실의 환풍기 위치에 설치하는
      '무언가'이다. 환풍기 역할을 기본적으로 하기 때문에 환풍기라 부를 수 있지만
      그 외 꽤나 다양한 기능이 붙어 있기에 '환풍기'라고 부르기엔 아쉬운
      물건이다. 드라이, 제습, 냉/온풍 등의 기능이 포함되어 있다. 휴젠뜨2와 3 중
      선택할 수 있었는데, 큰 차이는 블루투스 스피커, 안내 음성, LED무드 포함
      여부 차이였다. 불필요하다고 판단하여 가격이 조금 더 저렴한 휴젠뜨2로 욕실
      두 곳에 설치했다. 기본 스펙의 환풍기보다 20만 원 정도 비쌌던 것으로
      기억한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/7ZlPX8X.jpeg",
        "https://i.imgur.com/NKGvLwD.jpeg",
      ]}
      alt={["욕실 천장에 설치된 휴젠뜨", "휴젠뜨 리모컨"]}
      caption="욕실 천장에 설치한 휴젠뜨와 리모콘"
    />
    <p>
      휴젠뜨가 진가를 발휘하는 시점은 샤워를 마친 후이다. 수건으로 몸과 머리를
      닦으면서 드라이를 켠다. 수건으로 완벽하게 닦지 못하는 수분을 말려준다.
      몸을 다 말리면 스퀴지로 물을 모두 쓸어내린다. 물로 인한 곰팡이나 냄새를
      방지하기 위함이다. 그리고 휴젠뜨의 제습 기능을 켜고 할 일을 하다 보면
      화장실이 모두 말라 있다. 그리고 손님이 왔을 때도 매우 편리하다. 샤워를
      거실 욕실에서 드라이까지 모두 한 방에 해결할 수 있기 때문에 서로 편하다.
      참고로, 스퀴지를 사용하다보면 타일이나 도기에 스퀴지의 플라스틱이나 고무가
      묻는 경우가 있는데, 짜는 기능이 있는 대걸레를 알리로 구입해서 사용하니
      매우 편했다.
    </p>
    <p>
      다음으로 좋았던 의사결정은 청소기장과 로봇청소기장이었다. 말 그대로
      청소기와 로봇청소기를 둘 수 있는 공간이고, 문을 달았기 때문에
      청소기장이라고 칭한다. 왜 잘했냐? 청소기를 안 보이는 곳에 두고 언제든지
      편하게 쓸 수 있다는 것이 만족스럽다. 전에는 청소기를 방 한켠에 거치해
      두었는데, 이제는 눈에 안 보이게 둘 수 있는 것이다. 로봇청소기장은 더
      특별히, 로봇이 드나들 수 있는 통로를 만들었기에 더 만족스럽다.
      스마트폰으로 청소하라고 오더만 하면 바로 청소를 시작할 수 있다. 물론
      시간이 흘러 청소기 기종을 바꾸게 된다면? 청소기장 수리를 통해 사이즈를
      조절하거나 청소기를 다른 곳에 두어야 한다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/ObyiWKk.jpeg",
        "https://i.imgur.com/CWXU0Kp.jpeg",
        "https://i.imgur.com/zrv5ESF.jpeg",
      ]}
      alt={["로봇청소기장이 있는 공간", "로봇청소기장 내부", "청소기장"]}
      caption="로봇청소기장과 청소기장"
    />
    <p>
      공용부 벽지를 디아망으로 선택했는데, 이는 아주 조금은 후회된다. 더 명확히
      말하면, '하지 말걸'이라는 후회가 아니라, '굳이 안해도 되겠다'라는
      생각이다. 디자인과 안전성으로 인해 디아망을 선택했고, 그로 인해 자재비가
      30만 원 추가되었는데 일반적인 실크 벽지의 디자인과 크게 다르지 않기
      때문이다. 그리고 결정적인 것은, 집들이로 방문한 손님들 중 이 벽지의
      특별함을 알아챈 사람이 없다는 점이다. 큰 금액 차이는 아니지만, 최대한
      인테리어 비용을 줄이고자 하는 분들께 조금이라도 도움이 되는 의견이길
      바란다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/8CnDraT.jpeg"
      alt="디아망 벽지의 회벽 스타일"
      caption="자세히 보면 내가 선택한 회벽 스타일이 보인다."
    />
    <p>
      와이프는 목공 작업을 통해 불필요한 우물천장과 벽을 평탄화한 것이 최고의
      선택이었다고 말한다. 또한 9mm 문선이 작지만 집을 고급스럽게 만들었다고
      한다. 반셀프 인테리어를 직접 시행한 내가 정리하자면, 목공 작업에 많이
      투자한 것이 집을 이쁘게 만드는 것에 큰 도움이 된 듯하다. 나는 목공 작업에
      더 많은 투자를 했어야 한다는 생각이다. 갑작스럽게 이것저것 추가한 것이
      많지만 더 투자하여 모든 방의 걸레받이를 바꾸고, 천장 몰딩을 무몰딩으로
      하였으면 어땠을까 싶다. 지금도 만족하지만, 이제는 하고 싶다고 해도 할 수
      있는 것들이 아니다 보니 '더 할 걸'이라는 생각이 든다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/Onbws3p.jpeg"
      alt="9mm 문선과 내 방 모습"
      caption="9mm 문선을 통해 본 내 방"
    />
    <p>
      이번에는 아이템이 아닌 공정에 대해 이야기하자면, 시공 팀을 크루(?)로
      섭외하는 것이 좋았을 듯 하다. 이번 공정 중, 철거, 타일, 줄눈, 필름 업체가
      서로 친하게 지내는 일종의 크루였는데, 공정 간의 이해와 협력이 있다 보니
      훨씬 편했다. 스프링클러가 터지는 사건으로 인해 더 느낄 수 있었다. 다르게
      말하면 같은 크루가 아니었기에 서로를 이해하지 못하는 경우도 있었다. 종종은
      타 공정 탓을 하는 험담을 듣기 때문에 눈살이 찌푸려지는 경우도 발생한다.
    </p>
    <p>
      마지막으로, 지금까지 말했던 것과 결이 다른 이야기로 결론짓자면, 돈을
      아끼지 말라는 것이다. 앞에서 가성비 운운하다가 왜 돈을 아끼지 말라는
      것이냐면, 해봐야, 혹은 안 해봐야 가성비를 느끼고 후회라는 것을 할 수 있다.
      대부분의 인테리어 공사는 그 기간을 놓치면 다시 하기 어려운 것이기 때문에
      후회를 느낀다. 했기 때문에 후회하는 것들은 돈이 아깝다고 느끼기만 하면
      되는데, 안 했기 때문에 후회하는 것들은 살면서 계속 생각이 난다.
    </p>
    <p>
      이 집에서 약 4개월을 살았고, 앞으로도 최소 5년은 더 살 계획이다. 아니 10년
      이상은 더 살고 싶다. 반셀프 인테리어로 인해 몸이 성치 못했던 기억을 갖고
      살다보면 평생 살 수도 있을 것 같다. 행복하게 신혼 꾸리고 살다 보면, 다른
      집을 원하게 되거나 이 집에 살던지 정하겠지.
    </p>
    <p>
      이제 이 카테고리에서는 인테리어에 관련된 것들이 생각날 때마다 종종
      들어와서 남겨보려 한다. 여러가지 가전/가구에 대해서도 추후 남겨보도록
      하겠다.
    </p>
  </>
);
