"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";

export const content = (
  <>
    <p>
      이번 미국 서부 여행은 아쉽다면 아쉽고, 좋다면 좋았던 여행이었다. 우선
      확실한 것은, 성공적인 여행이었다. 와이프에게 말로만 전달했던 미국이,
      이제는 함께 경험한 미국이 되었다. 미국에 대한 감정을 혼자 품고 있었지만,
      이제는 미국에 또 가고 싶다는 생각을 함께 한다. 이런 생각을 함께 했기에, 이
      글을 쓰고 있는 시점에는 미국에 한 번 더 방문하고 온 상태이다. 이번
      여행에서 기억나는 것들을 나열해보려 한다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/ihQ2qg4.jpeg"]}
      alt="올림픽 국립공원"
      caption="비가 오고 힘들고 지쳐도 즐거운 여행이었다."
    />
    <p>
      무엇보다 가장 아쉬운 것은 날씨였다. 제일 기대했던 곳이 올림픽
      국립공원이었는데, 비로 인해 진풍경을 제대로 즐기지 못했다. 미국 북서부의
      1~2월은 비가 많이 오는 시기임을 알고 있었지만, 나에게는 행운이 따를 것이라
      믿고 여행했었다. 언젠가는 리알토 비치, 허리케인 릿지 등 올림픽 공원의
      명소를 날씨 좋을 때 다시 보러 갈 것이다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/AVsEkbz.png"]}
      alt="올림픽 국립공원"
      caption="눈보라로 인해 아무것도 보이지 않았던 허리케인 릿지"
    />
    <p>
      우리는 3일차부터 숙소 주변의 식당에서 맥주와 함께 하루를 마무리했다. 어느
      시점부터는 직접 생맥주를 만드는 양조장에서 저녁 식사를 했는데, 맥주 맛과
      분위기는 색다른 즐거움이자 설렘이었다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/L7tmnhK.png"]}
      alt="사이더"
      caption="사이더 양조장에서 비운 술잔"
    />
    <p>
      우리 부모님께서는 여행 기념품으로 마그넷을 구입하셨고, 냉장고에
      붙여두셨다. 보고 배운 나는, 여행을 다녀오면 마그넷을 무진장 사온다. 지난
      로키산맥 여행에서는 뱃지 수집을 시작했다. 그리고 이번 여행 중에 와이프는
      엽서와 스탬프를 모으기 시작했다. 다만, 1일차부터 엽서와 스탬프를 모으기
      시작한 것이 아니라, 초반부에 엽서를, 중반부부터 스탬프를 모으기 시작한
      것이다. 수집에 대한 마음을 일찍 결정했더라면, 초반에 수집품을 놓치는
      불상사는 없었을 것이라 아쉽다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/VKDaLdK.png"]}
      alt="기념품 샵"
      caption="기념품 샵에 들어가면 우린 눈이 돌아간다."
    />
    <p>
      14박 15일 동안 3,000km를 운전했고, 그 피로가 계속 쌓였다. 하루하루
      지날수록 일정을 완벽하게 소화하는 것이 어려울 정도의 정신적/육체적 피로가
      쌓였다. 그리고 예상치 못한 생리적 현상으로 인해 루트가 꼬인 적도 있다.
      이런 다양한 변수를 미리 파악이라도 했다면, 더 좋은 여행을 즐길 수 있었을
      것이다.
    </p>
    <ImageInEntry
      src={["https://i.imgur.com/CZ2PYD5.jpeg"]}
      alt="크레이터 레이크 국립공원"
      caption=""
    />
  </>
);
