"use client";

import { ImageInEntry } from "@/components/entry-detail/image-in-entry";
import { OgLink } from "@/components/entry-detail/og-anchor";

export const content = (
  <>
    <p>
      2024년 5월 12일, 여행 3일차 한 가운데 날이다. 조식을 마치고 숙소에서 나라
      역으로 이동했다. 긴테스나라 역이 관광지와 더 가깝지만, 숙소 근처인 우메다
      역에서 환승하지 않기 위해 나라 역으로 이동했다. 내려서 버스를 한번 더 타고
      나라현청 앞으로 이동했다. 첫 목적지는 요시키엔 정원. 천천히 나라의
      분위기를 즐기며 걸어갔다. 딱 자연 속에 있는 일본, 일본 속에 있는 자연의
      느낌이었다. 시원하면서도 더웠고, 더우면서도 시원한 날씨였다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/weWs8BK.jpeg",
        "https://i.imgur.com/nk1UU7m.jpeg",
      ]}
      alt={["나라 현청에서 본 나라 시내 방향", "요시키엔 정원으로 가는 길"]}
      caption="나라현청에서 요시키엔 정원으로 가던 길"
    />
    <p>
      나라의 여러 관광지를 알아보다가, 요시키엔 정원이 눈에 들어왔다. 입장료도
      무료였고, 일본의 정원을 볼 수 있다는 점, 그리고 나라 공원으로 가는 길에
      있다는 점에서 선택하게 되었다. 걷다보니 요시키엔 정원이었다. 제한된 공간
      안에 펼쳐진 자연이 보였다. 큰 테라리움을 보는 거 같기도 했다. 서로의
      사진도 찍고, 정원도 찍고, 정원을 도는 길도 찍고. 한바퀴 도는데도 꽤 시간이
      걸렸다. 정원이 생각보다 크기도 했지만, 눈에 담을 것들이 많아 시간이 오래
      걸렸다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/6PonVKb.jpeg",
        "https://i.imgur.com/1NUmEwK.jpeg",
        "https://i.imgur.com/F50ZTfV.jpeg",
      ]}
      alt={[
        "요시키엔 정원",
        "요시키엔 정원의 길",
        "요시키엔 정원을 보고 있는 나",
      ]}
      caption="요시키엔 정원"
    />
    <p>
      정원을 빠져나와 도다이지 방향으로 걸어갔다. 일본 감성이 물씬 느껴지지만
      자연과 함께 있는, 센과 치히로의 행방불명과 같은 분위기가 나는 길이었다.
      외국인 관광객들도 많았다. 어찌 보면, 낮이라 이쁜 길일 수 있다. 밤이라면
      지나가지 못했을 법한 길이다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/juaUuxE.jpeg",
        "https://i.imgur.com/4TEQsdS.jpeg",
        "https://i.imgur.com/XJU1fNu.jpeg",
      ]}
      alt={["도다이지로 가는 길", "도다이지로 가는 길", "도다이지로 가는 길"]}
      caption="도다이지로 가는 길"
    />
    <p>
      사슴 한 마리가 보였다. 사슴이 많다고 들었는데, 우리가 옳은 방향으로 가고
      있다는 걸 느꼈다. 계속 걷다보니 사슴이 한두마리가 아니다. 동그란 사슴똥이
      많아지기 시작했고, 사슴이 관광객들과 함께 어우러져 있었다. 큰 사슴, 작은
      사슴 모두 사람을 무서워하지도, 공격하지도 않고 편하게 살고 있더라.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/uPmqS8H.jpeg",
        "https://i.imgur.com/sCZu0Qs.jpeg",
      ]}
      alt={["도다이지 앞의 사슴", "도다이지 앞의 사슴들"]}
      caption="도다이지 앞의 사슴들"
    />
    <p>
      사슴에 한눈 팔렸지만, 아직 도다이지를 보지 못했다. 다시 도다이지를 향해
      발걸음을 옮겼다. 이미 조사는 했었지만, 입장료가 있다는 것을 깜빡 잊고
      있었다. 우리는 빠르게 같은 의견으로, 입장하지 않기로 했다. 공부하면 볼
      것이 많겠지만, 멀리서 봐야 더 이쁜 것들이 훨씬 많다. 울타리 너머로 살짝
      구경했다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/NbeqDQ6.jpeg"
      alt="울타리 너머로 본 도다이지 정면"
      caption="울타리 너머로 본 도다이지 정면"
      height={600}
    />
    <p>
      나라에서 제일 유명한 관광지인 도다이지를 지나 나라 공원으로 갔다. 가던
      길에 도다이지 굿즈샵을 들러 마그넷을 샀다. 사슴 밥을 파는 상인들이 곳곳에
      있고, 주변에 사슴이 많았다. 신기하게도 사슴들이 밥상인들에게 덤벼들지는
      않았다. 밥을 뺏어먹지도 않았다. 사슴 밥을 하나 샀다. 한 세트에 200엔.
      뻥튀기 같기도 하고, 전병과자 같기도 하고. 내가 결제하고 사슴밥을 챙기는
      순간 사슴들이 나에게 뛰어온다. 난 사슴들에게 둘러싸여 밥을 강탈당하기
      시작했다. 나름 얘네한테도 예절이 있나보다. 자꾸 나한테 인사를 한다. 작고
      약해보이는 친구들에게 주고 싶지만, 크고 강한 놈들이 뺏어먹는다. 아름답게
      사슴 모이주는 모습을 생각했었는데, 난 그렇게 2~3분만에 모든 밥을
      소진해버렸다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/AAw0CHt.jpeg",
        "https://i.imgur.com/ZunTDH6.jpeg",
      ]}
      alt={["사슴 밥을 먹이는 나", "이쁜 척하는 사슴"]}
      caption="이쁜 척하면서 밥 강탈해가는 사슴 친구들"
    />
    <p>
      동물 친구들이 많이 생겼지만, 그들을 뒤로 한채 식사하러 이동했다. 모치이도
      시장이 있는 곳으로 이동하면서 여러 굿즈도 보고, 편집샵 구경도 했다. 미리
      찾아둔 우동 전문점에서 점심 식사를 주문했다. 약 10분 정도 대기 후
      입장했으며, 짜지 않고 맛있었다. 구글맵에서 별점이 높은 이유가 있긴
      한가보다. 식사를 마친 후, 동전 사이즈에 맞게 나온 지갑을 하나 샀다.
      차곡차곡 동전을 넣을 수 있는 작은 지갑이었다. 아기자기한 편집샵들로
      가득했던 모치이도 시장을 나와 다시 오사카로 돌아왔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/AAw0CHt.jpeg",
        "https://i.imgur.com/00LYOzK.jpeg",
      ]}
      alt={["소바 우동", "카레 우동과 새우튀김"]}
      caption="소바 우동과 카레 우동, 함께 시킨 새우튀김"
    />
    <ImageInEntry
      src="https://i.imgur.com/VC7t4j5.jpeg"
      alt="모치이도 시장의 작은 골목"
      caption="모치이도 시장에 있던 작은 골목. 편집샵으로 가득한 작은 거리다."
      height={600}
    />
    <ImageInEntry
      src="https://i.imgur.com/gjhmExG.jpeg"
      alt="웰컴 투 나라 문구"
      caption="나라를 떠나면서 본 웰컴 문구"
      height={600}
    />
    <p>
      덴덴타운을 구경하기로 해서 긴테스닛폰바시 역으로 이동했다. 애니메이션과
      관련된 굿즈들을 건질 생각으로 이동했지만, 축제가 있는지 관광객이 너무
      많았고, 그로 인해 구경이 쉽지 않았다. 그리고 결정적으로, 내가 알고보니
      애니메이션을 많이 아는 편이 아니었던 것이다. 많이 걸었지만, 아무것도
      건지지 못한채 도톤보리 방향으로 다시 돌아왔다. 다이마루 백화점에서 가볍게
      쇼핑 후 우메다 쪽으로 다시 돌아왔다.
    </p>
    <ImageInEntry
      src={[
        "https://i.imgur.com/IPGg2sN.jpeg",
        "https://i.imgur.com/NKDIhSC.jpeg",
      ]}
      alt={["포켓몬스터 전설의 새 포켓몬들", "주술회전 전시품"]}
      caption="다이마루 백화점에 있던 근본 새 세 마리와 주술회전"
    />
    <p>
      오늘의 저녁은 오사카에서 한국인들이 좋아하기로 유명한 기타스시. 한국인이
      많이 방문해서 그런지, 한국말로 안내판이 써져있다. 입구에서 잠시 대기하는
      것이 예절이라는 안내문. 노크 후 기다리다가 안내해주는 자리로 이동했다.
      근데 이상하게 한국어 메뉴판은 없더라. 한국인들이 좋아하는 메뉴들이 표기된
      영어 메뉴판을 보고 먹고 싶은 초밥들을 골라 주문했다. 한국인들이 좋아할만한
      초 양념 정도, 그리고 두툼한 횟감. 많이 먹고 나올 때, 주인장이 따로 비닐
      봉지를 하나 주었다. 나이스한 손님이라 몰래 주는 거라고 비밀을 지켜달랬다.
      작은 일본 과자와 한글로 쓰여진 작은 편지가 코팅되어 있었다. 매우 싼
      물건이겠지만, 꽤나 기억에 남는 선물이었다. 아직도 집에 잘 보관 중이다.
      물론 과자는 먹었고.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/Au2rQEM.jpeg"
      alt="기타스시 초밥"
      caption="기타스시 1차 (3차까지 주문해서 먹었다.)"
      height={500}
    />
    <p>
      소화도 시킬 겸, 걷다가 인형 뽑기를 했다. 약 3,000엔을 들여, 아주 작은
      피규어 두 개 뽑았다. 돈을 날리고 추억을 쌓았다.
    </p>
    <ImageInEntry
      src="https://i.imgur.com/bn2Ntoh.jpeg"
      alt="피규어 두 개"
      caption="하나에 1,500엔짜리 피규어"
      height={500}
    />
    <p>
      나라가 참 좋았다. 내가 일본에 기대하는 자연과 분위기가 녹아있었다. 꼭 다시
      갈거다. 사슴 밥도 다시 줄거고, 도다이지는 또 안 들어갈거다.
    </p>
    <OgLink
      href="https://maps.app.goo.gl/qQkMv2imyhtjk8XY7"
      ogTitle="카마이키 우동"
      ogDescription="うどん専門店 釜粋"
      ogImage="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
    <OgLink
      href="https://maps.app.goo.gl/vhw5apJHexZMjVcJ6"
      ogTitle="Kitasushi honten"
      ogDescription="亀多寿司 本店"
      ogImage="https://i.ytimg.com/vi/ZG4JQX4BO9A/maxresdefault.jpg"
    />
  </>
);
